<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>Toimingud kandidaatidega</h1>
<p>Kandidaadi kaardi vasakus osas pealkirja <b>Toimingud </b>all asub nuppude komplekt, mis
lubab kirjeldada kandidaadiga valiku protsessi k&auml;igus l&auml;biviidavaid
t&uuml;&uuml;pilisi operatsioone. Tarkvara v&otilde;rguversioonis on
v&otilde;imalik piirata osa operatsioonide k&auml;ttesaadavust kasutajate jaoks
nende gruppide piiridega, m&auml;&auml;rates neid v&auml;ljas&nbsp;<b>Aktuaalne vaid grupi jaoks</b> s&uuml;ndmuse
seadistuste kaardi sektsioonis<b> Lisaandmed </b>(<b>Administreerimine-&gt;Kataloogid</b>-&gt;<b>&Uuml;ldised-&gt;S&uuml;ndmuste t&uuml;&uuml;bid)</b>.</p>
<p>Iga operatsiooni ellu viimine lisab vastavat kirjet
(s&uuml;ndmust) kandidaadi personaaltoimikusse ning, j&auml;relikult, muudab ka
kandidaadi staatust. S&uuml;ndmuste jaoks, millel v&otilde;ib olla mitu
l&otilde;puvarianti, on k&auml;ttesaadav nupp <b>Tulemus</b>. S.t. et peale seda, kui planeeritud s&uuml;ndmus
tegelikult toimub, saab selle nupu abil esile kutsuda dialoogiakent tulemuse
fikseerimiseks ning vajadusel sisestada kommentaari. Tulemuse valimisel, mis
eeldab v&auml;rbaja poolt otsuse vastuv&otilde;tmist, l&uuml;litub automaatselt
sisse v&otilde;imalus luua teavitust teatud ajaperioodi p&auml;rast v&otilde;i
kindlaks kuup&auml;evaks ja kellaajaks. S&uuml;steemi teavituste t&ouml;&ouml;re&#382;iimi
saab reguleerida sektsioonis<b> Personaalsed seadistused -&gt;&Uuml;ldised-&gt;Teavitused</b>.</p>
<p>V&otilde;imalike s&uuml;ndmuste loetelu ning nende
k&auml;itumist reguleeritakse sektsioonis <b>Administreerimine-&gt;Kataloogid</b>-&gt;<b>&Uuml;ldised-&gt;S&uuml;ndmuste t&uuml;&uuml;bid</b>. Allpool on toodud
s&uuml;steemiga tarnitavate standardsete s&uuml;ndmuste kirjeldus.</p>
<p>Nupp <b>M&auml;rkus</b>&nbsp;lubab
lisada suvalist kommentaari kandidaadi personaaltoimikusse. Kommentaari
kirjutamisel saab teksti sisestamiseks uuest reast kasutada klahvide
kombinatsiooni&nbsp;<b>SHIFT+Enter</b>. Klahv&nbsp;<b>Enter</b>&nbsp;v&otilde;i
nupp&nbsp;<b>ОК</b>&nbsp;l&otilde;petab kommentaari sisestamist. M&auml;rkuse
lisamine ei muuda kandidaadi staatust.</p>
<p>Nuppu <b>Esimene
k&otilde;ne&nbsp;</b>kasutatakse kandidaadile esimese k&otilde;ne
fakti fikseerimiseks koos selle tulemuse m&auml;rkimisega (n&auml;iteks,
t&ouml;&ouml;vestlus planeeritud, tagasi l&uuml;kata, helistada hiljem uuesti
jne.).</p>
<p>Nuppu <b>Esmane
e-kiri</b>&nbsp;kasutatakse, kui on vajalik leppida kandidaadiga kokku
telefonik&otilde;nest v&otilde;i t&ouml;&ouml;vestluse ajast.&nbsp;Selleks
pakutakse Teile mitu kirja malli juhuks, kui kandidaat ise vastas vakantsile (aktiivne
kandidaat) ning kui kandidaat oli iseseisvalt leitud (passiivne kandidaat). Vt.
samuti:&nbsp;<a href="mail_sending.htm">&Uuml;ksikkirjade saatmine</a>.</p>
<p>Nupp <b>Tel.
t&ouml;&ouml;vestlus</b>&nbsp;lubab &auml;ra planeerida t&ouml;&ouml;vestlused
kandidaadiga telefoni teel. Tarkvaratelefoni v&otilde;i Skype k&otilde;nesid
kasutavad kasutajad saavad kandidaadile helistada tema kaardilt vajutades
telefoni pildiga nupule k&auml;su <b>Helistada
</b>valimisega. Peale seda, kui telefoni t&ouml;&ouml;vestlus on tegelikult ka
toimunud, on vajalik vajutada nuppu <b>Tulemus</b>,
paigaldada lippu, mis peegeldab l&auml;biviidud t&ouml;&ouml;vestlus tulemust
ning vajadusel sisestada kommentaari. Juhul, kui te ei soovi kommentaari
sisestada, on v&otilde;imalik sellest loobuda vajutades nuppu <b>OK</b>&nbsp;v&otilde;i
klahvi <b>Enter </b>klaviatuuril.
Kommentaari kirjutamisel saab teksti sisestamiseks uuest reast kasutada
klahvide kombinatsiooni&nbsp;<b>SHIFT+Enter</b>.</p>
<p>Nupp <b>T&ouml;&ouml;vestlus
</b>lubab &auml;ra planeerida vahetut t&ouml;&ouml;vestlused kandidaadiga. Peale
seda, kui t&ouml;&ouml;vestlus on tegelikult ka toimunud, on vajalik vajutada
nuppu <b>Tulemus</b>, paigaldada lippu, mis
peegeldab l&auml;bi viidud t&ouml;&ouml;vestluse tulemust ning vajadusel
sisestada kommentaari. Vt. samuti: Uue t&ouml;&ouml;vestluse planeerimine. Vaikimisi
on k&auml;esolev s&uuml;ndmus m&auml;&auml;ravaks asjaoluks vakantsi, mille
peale vaadeldakse kandidaati, t&otilde;stmiseks valiku etapile&nbsp;<b>Intervjueerimine</b>.</p>
<p>Nupp <b>CV
tellija juures</b>&nbsp;loob kandidaadi CV-d sisaldava kirja tellija jaoks (v&otilde;i
k&otilde;ikide vakantsi osas kontaktisikute jaoks). Peale kirja v&auml;ljasaatmist
vahetub kandidaadi staatus staatuseks <b>CV tellija juures</b>. Peale tellija
tagasiside k&auml;ttesaamist on vajalik vajutada nuppu <b>Tulemus</b>, paigaldada lippu, mis peegeldab CV &uuml;levaate tulemust
ning vajadusel sisestada kommentaari. Tellijalt tagasiside k&auml;ttesaamise
protsess v&otilde;ib olla automatiseeritud Datex Recruit integratsiooni
olemasolu korral Teie ettev&otilde;tte korporatiivportaaliga. Sellisel juhul
peale tellija otsuse vastuv&otilde;tmist kandidaadi suhtes saab kasutaja
sellest teavitust<b> </b>alasektsioonis<b>
S&uuml;ndmused-&gt;Teavitused</b>.</p>
<p>Nupp&nbsp;<b>T&ouml;&ouml;vestlus
tellijaga</b>&nbsp;lubab &auml;ra planeerida kandidaadi vahetut t&ouml;&ouml;vestlused
tellijaga. Peale kavandatava kuup&auml;eva ning aja valikut pakub tarkvara automaatselt
v&auml;lja saata kandidaadile kirja malli j&auml;rgi – teavitus planeeritud t&ouml;&ouml;vestlusest
tellijaga koos s&otilde;idu skeemiga. Korrigeerida malli ning lisada
s&otilde;idu skeemi saab sektsioonis<b> Administreerimine-</b>&gt;<b>Kataloogid</b>-&gt;<b>&Uuml;ldised</b>-&gt;<b>Kirjade
mallid</b>. Peale seda, kui t&ouml;&ouml;vestlus on tegelikult ka toimunud, on
vajalik vajutada nuppu <b>Tulemus</b>, paigaldada
lippu, mis peegeldab l&auml;bi viidud t&ouml;&ouml;vestluse tulemust ning
vajadusel sisestada kommentaari. Vaikimisi on k&auml;esolev s&uuml;ndmus
m&auml;&auml;ravaks asjaoluks vakantsi, mille peale vaadeldakse kandidaati,
t&otilde;stmiseks valiku etapile&nbsp;<b>Intervjueerimine
tellija juures</b>. T&auml;iendavalt on v&otilde;imalik Datex Recruit kalendri integratsiooni
kasutamine ettev&otilde;tte poolt kasutatava v&auml;lise kalendriga,  n&auml;iteks, Microsoft Outlook, Lotus Notes v&otilde;i
Google kalendriga (Datex Recruit<b> -&gt;Kalender</b>). See lubab tellijal
kasutada t&ouml;&ouml;vestluse kuup&auml;eva- ning ajaplaneerimise mehhanismi tema
tavap&auml;rases kalendris.</p>
<p>Nuppu&nbsp;<b>T&ouml;&ouml;pakkumine</b>&nbsp;kasutakse
kandidaadile tehtud pakkumise fakti registreerimiseks. Kandidaadi staatus
muutub staatuseks&nbsp;<b>T&ouml;&ouml;pakkumine
tehtud</b>. Peale kandidaadilt tagasiside k&auml;ttesaamist on vajalik vajutada
nuppu <b>Tulemus</b>, paigaldada lippu, mis
peegeldab pakkumise &uuml;levaate tulemust ning vajadusel sisestada kommentaari.
Vaikimisi on k&auml;esolev s&uuml;ndmus m&auml;&auml;ravaks asjaoluks vakantsi,
mille peale vaadeldakse kandidaati, t&otilde;stmiseks valiku etapile&nbsp;<b>Finalist</b>.</p>
<p>Nupp&nbsp;<b>Turvakontroll</b>&nbsp;registreerib
kandidaadi turvateenistuse kontrollile saatmise fakti. Kandidaadi staatus
muutub staatuseks <b>Turvakontroll</b>. Peale
turvateenistuselt tagasiside saamist on vajalik vajutada nuppu <b>Tulemus</b>, paigaldada lippu, mis
peegeldab l&auml;biviidud kontrolli tulemust ning vajadusel sisestada
kommentaari. Kandidaadi kontrollile saatmise protsessi ning tagasiside
k&auml;ttesaamist saab automatiseerida Datex Recruit integratsiooni korral Teie
ettev&otilde;tte korporatiivportaaliga.</p>
<p>Nupp <b>Vormistamine
</b>registreerib kandidaadi t&ouml;&ouml;le vormistamise protseduuri
k&auml;ivitamise fakti. Seejuures, pakub tarkvara ette m&auml;rkida kandidaadi
t&ouml;&ouml;le asumise kavandatavat p&auml;eva ning katseaja kestust (vajadusel).
Katseaja kestust vaikimisi, samuti ka selle kehtestamise v&otilde;imalust iga
kandidaadi jaoks eraldi reguleeritakse sektsioonis&nbsp;<b>Administreerimine-&gt;&Uuml;ldised
seadistused-&gt;T&ouml;&ouml; vakantsidega.</b></p>
<p>V&auml;lise s&uuml;steemiga integratsiooni korral
ettev&otilde;tte t&ouml;&ouml;tajate andmete impordiks Datex Recruit
s&uuml;steemi, v&otilde;ib staatus <b>Katseaeg
ei ole l&auml;bitud&nbsp;</b>olla automaatselt<b> </b>antud <b>kandidaadile</b> kandidaadiga
t&ouml;&ouml;lepingu l&otilde;petamise puhul tema katseaja perioodi jooksul. Vt.
<u>Kandidaadi ja t&ouml;&ouml;taja automaatse seose moodustamine</u>.</p>
<p>Kandidaadi staatus muutub staatuseks <b>Turvakontroll</b>. Peale turvateenistuse
tagasiside saamist on vajalik vajutada nuppu <b>Tulemus</b>, paigaldada lippu, mis peegeldab l&auml;biviidud kontrolli
tulemust ning vajadusel sisestada kommentaari. </p>
<p>Nuppu <b>T&ouml;&ouml;le
v&otilde;etud </b>kasutatakse<b> </b>l&otilde;pliku
kandidaadi k&auml;esoleva vakantsile valiku puhul. Peale antud toimingu elluviimist
pakub tarkvara ette:</p>
<ul type="disc">
 <li>Sulgeda
     vakantsi, millele otsiti kandidaati, t&otilde;stes ta &uuml;le staatusse <b>Suletud </b> v&otilde;i <b>Suletud tellija poolt</b> (valikul)</li>
 <li>&Uuml;le
     viia &uuml;lej&auml;&auml;nud kandidaadid, kellega alustati t&ouml;&ouml;d
     antud vakantsi raames staatusse <b>Ei
     l&auml;binud l&otilde;plikku valikut</b></li>
 <li>Automaatselt
     saata e-posti teel teavitusi eitava vastuse kohta tagasil&uuml;katud
     kandidaatidele.</li>
</ul>
<p>Kasutaja kinnituse p&auml;ringu haldamist
teostatakse lippude<b> K&uuml;sida kinnitust vakantsile mittevalitud
kandidaatide staatuse muutmisele </b>ja
<b>K&uuml;sida kinnitust teavituse saatmiseks vakantsile mittevalitud
kandidaatidele</b> abil staatuste seadistuste kaardil&nbsp;<b>Suletud </b>ning <b>Suletud tellija poolt </b>sektsioonis
<b> Administreerimine-&gt;Kataloogid-&gt;Vakantsid-&gt;Vakantside
staatused.</b></p>
<p>Peale kandidaadi t&ouml;&ouml;lev&otilde;tmist, 5
t&ouml;&ouml;p&auml;eva enne katseaja l&otilde;ppu luuakse v&auml;rbaja jaoks
&uuml;lesannet meeldetuletusega katseaja l&auml;bimise hindamise protseduuri
k&auml;ivitamise vajalikkuse kohta. Hindamise protseduuri k&auml;ivitamiseks
tuleb kandidaadi personaaltoimikus s&uuml;ndmuse all <b>Katseaja l&auml;bimise hindamine</b> (s&uuml;ndmust luuakse tarkvara
poolt automaatselt) vajutada nuppu <b>Tulemus
</b>ning paigaldada lippu <b>Algus</b>. Juhi
e-posti aadressile automaatse postitamise vahendusel saadetakse teavitust
t&ouml;&ouml;taja katseaja l&otilde;pu t&auml;htajast koos palvega teostada
hindamist. Peale juhipoolset tagasiside k&auml;ttesaamist tuleb uuesti vajutada
nuppu <b>Tulemus</b>, paigaldada lippu <b>L&otilde;petatud</b> ning vajadusel
sisestada kommentaari. Intervalli katseaja l&otilde;puni seadistakse ette
s&uuml;ndmuse <b>Katseaja l&auml;bimise
hindamine</b> lisaandmetes sektsioonis&nbsp;<b>Administreerimine-&gt;Kataloogid</b>-&gt;<b>&Uuml;ldised-&gt;S&uuml;ndmuste t&uuml;&uuml;bid</b>.</p>
<p>Nupud <b>Tagasi
l&uuml;katud v&auml;rbaja poolt, Tagasi
l&uuml;katud tellija poolt </b>ning<b>&nbsp;Keeldus </b>kasutatakse kandidaadi
tagasi l&uuml;kkamise fakti registreerimiseks igal valiku etappidest, mis
l&otilde;petab kandidaadi vaatlust vakantsile, millele ta kandideeris. Tagasil&uuml;kkamise
puhul v&auml;rbaja v&otilde;i tellija poolt pakub tarkvara ette saata
kandidaadile tagasil&uuml;kkamise teavitust. Samuti pakutakse nimetada
tagasil&uuml;kkamise p&otilde;hjust ning sisestada lisakommentaari. Tagasil&uuml;kkamise
t&uuml;&uuml;piliste p&otilde;hjuste kogumit reguleeritakse sektsioonis<b> Administreerimine-&gt;Kataloogid</b>-&gt;<b>Kandidaadid-&gt;Kandidaatide
tagas&uuml;l&uuml;kkamise p&otilde;hjused.</b></p>
<p>&nbsp;&nbsp;</p>
<p>Nuppu <b>Personalireserv</b> kasutatakse
kandidaadi arvamiseks reservi, mis l&otilde;petab tema vaatlust vakantsile, millele
ta kandideeris.</p>
<p>&nbsp;</p>
<p>Lisatoimingute nupud:</p>
<p>Nuppu&nbsp;<b>Registreerimine
grupit&ouml;&ouml;vestlusele</b> kasutatakse kandidaadi registreerimiseks
&uuml;hele kavandatutest grupit&ouml;&ouml;vestlustest teatud vakantsi raames. Vaikimisi
valib tarkvara l&auml;himat grupit&ouml;&ouml;vestlused n&otilde;utud vakantsi
osas ning sisestab kandidaati osalejate nimekirja.</p>
<p>Nupp <b>Testimine </b>lubab m&auml;&auml;rata
kandidaadile testimist, valides vajalikku testi nupuga&nbsp;<b>Lisada testid</b>. Lisaks sellele, on
v&otilde;imalik automaatselt m&auml;&auml;rata kandidaadile ette antud testide
kogumit, juhul kui selline valik oli m&auml;&auml;ratud vakantsi kaardil
sektsioonis <b>N&otilde;udmised kandidaadile</b>. Luua testide komplekte on
v&otilde;imalik sektsioonis <b>Administreerimine-&gt;Kataloogid-&gt;Integratsioon-&gt;Testide
komplektid.&nbsp;</b>Reeglina toimub
testimine automaatselt juhul, kui Datex Recruit on integreeritud
testimise s&uuml;steemiga, n&auml;iteks WebTutor-ga v&otilde;i Talent Q-ga. Samuti
on v&otilde;imalik sisestada testide tulemusi k&auml;sitsi. Iga vakantsi jaoks
on v&otilde;imalik ette anda n&otilde;utud testide komplekti. Peale testimise l&otilde;ppu
saab kasutaja teavitust sellest sektsioonis<b> S&uuml;ndmused-&gt;Teavitused</b>.</p>
<p>Nupp <b>Online-t&ouml;&ouml;vestlus </b>lubab
planeerida kaugt&ouml;&ouml;vestluse seanssi kandidaadiga, n&auml;iteks Skype
vahendusel.&nbsp;Klikkides hiirega Skype ikoonil on Teil koheselt
v&otilde;imalik &uuml;le minna kandidaadi kaardi &uuml;levaate re&#382;iimist
Skype k&otilde;nele. Peale seda, kui online-t&ouml;&ouml;vestlus on tegelikult
toimunud on vajalik paigaldada lippu <b>Online-t&ouml;&ouml;vestlus on toimunud</b>
- tarkvara pakub ette sisestada kommentaari&nbsp;t&ouml;&ouml;vestluse kohta. Juhul,
kui te ei soovi kommentaari sisestada, v&otilde;ite keelduda sellest, vajutades
nuppu <b>OK</b>&nbsp;v&otilde;i <b>Enter </b>klaviatuuril.</p>
<p>Nupp <b>Kinnitamine juhtkonna poolt</b> alustab
kandidaadi kinnitamise protseduuri juhtide poolt. Igalt osalejalt saadud vastus
(kas kandidaat on kinnitatud v&otilde;i mitte) m&auml;rgistakse vastava lipuga
antud s&uuml;ndmuse kaardi alasektsioonis&nbsp;<b>Kinnitamine osalejate poolt</b>.
K&otilde;ikide osalejate positiivse vastuse puhul l&auml;heb kandidaat
automaatselt &uuml;le staatusse <b>Kinnitamine juhtkonna poolt on l&auml;bitud</b>&nbsp;ning
kasv&otilde;i &uuml;he negatiivse vastuse olemasolul staatusse <b>- Kinnitamine
juhtkonna poolt ei ole l&auml;bitud</b>&nbsp;<b>.</b></p>
<p>Nupp <b>Hindamine juhtkonna poolt </b>alustab<b> </b>kandidaadi hindamise
protseduuri mitme hindava juhi poolt teatud k&uuml;sitluslehe kasutamisega. Lehti
hindamise l&auml;biviimiseks koos k&uuml;simuste nimekirjaga luuakse
sektsioonis<b> Administreerimine-</b>&gt;<b>Kataloogid</b>-&gt;<b>Muud-&gt;Hindamislehed</b>.&nbsp;Igalt
osalejalt saadud hindamise tulemusi t&auml;idetakse antud s&uuml;ndmuse kaardi
alasektsioonis<b> Osalejate vastused</b>. Alasektsioonis <b>&Uuml;ldised andmed</b> kuvatakse
k&otilde;ikide osalejate<b> </b>k&uuml;sitluse<b> </b>tulemuste
keskv&auml;&auml;rtusi. Reeglina teostatakse k&uuml;sitluslehtede saatmist
juhtidele ning tulemuste kogumist automaatselt juhul, kui Datex Recruit on
integreeritud WebTutor s&uuml;steemiga.</p>
<p>Nupp <b>2. t&ouml;&ouml;vestlus tellijaga</b>&nbsp;lubab
planeerida kandidaadi korduvat vahetut t&ouml;&ouml;vestlust tellijaga.&nbsp;Peale
seda, kui t&ouml;&ouml;vestlus on tegelikult ka toimunud, on vajalik vajutada
nuppu <b>Tulemus</b>, paigaldada
l&auml;biviidud t&ouml;&ouml;vestluse tulemust peegeldavat lippu ning vajadusel
sisestada kommentaari.</p>
<p>Nuppu <b>V&otilde;etud
t&ouml;&ouml;le t&auml;htajalise lepingu alusel</b> kasutatakse l&otilde;pliku
kandidaadi valikuks antud vakantsile, kuid ajutistel alustel. Peale antud
toimingu teostamist pakub tarkvara ette sulgeda vakantsi, millele vaadeldi
kandidaati, &uuml;le viia teisi kandidaate, kellega oli antud vakantsi raames t&ouml;&ouml;
alustatud, staatusse <b>Ei l&auml;binud l&otilde;plikku valikut </b>ning
automaatselt saata mittevalitud kandidaatidele malli j&auml;rgi koostatud kirja
– teavitust tagasil&uuml;kkamisest.</p>
<p>Nupp <b>T&ouml;&ouml;leping
l&otilde;petatud</b> registreerib<b> </b>eelnevalt
t&ouml;&ouml;le v&otilde;etud kandidaadi t&ouml;&ouml;lepingu l&otilde;petamise
fakti. Integratsiooni kasutamise puhul v&auml;lise s&uuml;steemiga
ettev&otilde;tte t&ouml;&ouml;tajate andmete laadimiseks Datex Recruit-sse, v&otilde;ib
staatus <b>T&ouml;&ouml;leping
l&otilde;petatud</b> olla antud kandidaadile automaatselt t&ouml;&ouml;tajaga
t&ouml;&ouml;lepingu l&otilde;petamise puhul peale katseaja l&otilde;ppu. Vt.&nbsp;<u>Kandidaadi
ja t&ouml;&ouml;taja seose automaatne moodustamine.</u></p>
<p>Nupp <b>Must
nimekiri</b> sisestab kandidaatide<b> </b>musta
nimekirja.</p>
<p>Vaikimisi, tarkvara v&otilde;rguversioonis teise kasutaja
kandidaadi kaardil s&uuml;ndmuse m&auml;&auml;ramisel, seotakse see kasutajaga,
kes on sisestatud kandidaadi kaardi v&auml;ljasse <b>V&auml;rbaja</b>. Juhul, kui on vajalik muuta tarkvara k&auml;itumist
selliselt, et m&auml;&auml;rav s&uuml;ndmus oleks seotud jooksva kasutajaga
sektsioonis<b> Administreerimine</b>-&gt;<b>&Uuml;ldised
seadistused</b> -&gt;<b>T&ouml;&ouml;
kandidaatidega</b> v&otilde;tke &auml;ra lipp&nbsp;<b>S&uuml;ndmuse m&auml;&auml;ramisel</b> <b>teise kasutaja kandidaadile siduda
s&uuml;ndmus kandidaadi kaardil sisestatud kasutajaga</b>.</p></body>
</html>
