<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>Töö ametistruktuuriga</h1>
<p>Ettev&otilde;tte personaliteenistuse poolt
kasutamisel lubab Datex Recruit s&auml;ilitada andmed ettev&otilde;tte
ametistruktuuri kohta. Andmeid v&otilde;ib s&auml;ilitada erineva detailsuse
astmega, vastavalt kasutaja vajadustele. Suurte, mitmeid juriidilisi isikuid
sisaldavaid ettev&otilde;tete jaoks on v&otilde;imalik segaametistruktuuri
re&#382;iimi kasutamine, mille puhul iga juriidilise isiku k&otilde;rgema
taseme struktuur&uuml;ksused seostakse vastava organisatsiooniga. Antud
re&#382;iimi v&otilde;ib sisse l&uuml;litada optsiooni&nbsp;<b>Seostada &uuml;ksused organisatsioonidega </b>abil sektsioonis<b> Administreerimine-&gt;&Uuml;ldised
seadistused -&gt;</b>&nbsp;<b>Kasutamise
poliitika</b>.</p>
<p>Ametistruktuuri andmeid v&otilde;ib automaatselt importida
personaliarvestuse s&uuml;steemist (vastava tehnilise integratsiooni
olemasolul) v&otilde;i sisestada k&auml;sitsi. Viimasel juhul teostatakse seda
vajadusel enne vastavate vakantside sisestamist.</p>
<p>Sektsioon <b>Org.struktuur</b>
sisaldab andmeid ettev&otilde;tte struktuur&uuml;ksuste kohta, hierarhilisel
kujul. &Uuml;ksuste t&auml;ieliku hierarhilise keti piisavalt suure pikkuse
puhul, ei pruugi see mahtuda sellele m&auml;&auml;ratud v&auml;ljale kaartidel
ja nimekirjades, mille tulemusena siht&uuml;ksuse nimetust ei ole n&auml;ha. Kuid
antud probleemi jaoks on olemas kaks teineteist t&auml;iendavat lahendust.&nbsp;Vt..&nbsp;<a href="long_div_row.htm">Soovitused s&uuml;steemi
seadistamiseks ametistruktuuriga t&ouml;&ouml; jaoks suurtes (holding)
ettev&otilde;tetes</a>.</p>
<p>Sektsioon <b>T&ouml;&ouml;tajad </b>sisaldab ettev&otilde;tte
t&ouml;&ouml;tajate nimekirja. V&auml;lise s&uuml;steemiga integratsiooni
kasutamise puhul t&ouml;&ouml;tajate andmete laadimiseks Datex Recruit-sse, on
v&otilde;imalik &auml;ra seadistada t&ouml;&ouml;le v&otilde;etud kandidaadi
automaatset seostamist vastava t&ouml;&ouml;tajaga, mis lubab kiiresti liikuda
nende vahel ning samuti automaatselt muuta seotud kandidaadi staatust
t&ouml;&ouml;tajaga lepingu l&otilde;petamise puhul. Vt.&nbsp;<a href="candidate_employee_auto_bind.htm">Kandidaadi ja
t&ouml;&ouml;taja seose automaatne loomine</a>.<u></u></p>
<p>Sektsioon <b>Ametikohad</b>
sisaldab ettev&otilde;tte ametikohtade loetelu. Antud sektsiooni v&otilde;ib
kasutada v&otilde;i mitte s&otilde;ltuvalt Datex Recruit kasutaja poliitikast, mida
antakse ette lipu abil <b>Pidada ametikohtade arvestust </b>sektsioonis<b> Administreerimine-&gt;&Uuml;ldised
seadistused -&gt;Ametistruktuur</b>. Ametikohtade kasutamise puhul
v&otilde;ib (v&otilde;i peab) iga t&ouml;&ouml;taja olla seotud teatud
ametikohaga, mis vabaneb temaga lepingu l&otilde;petamisel. Samuti iga
ametikohaga v&otilde;ib (v&otilde;i peab) olla seotud iga vakants. Ametikohtade
&uuml;le arvestuse v&auml;lja l&uuml;litamisel v&otilde;ivad t&ouml;&ouml;tajate
ametikohtade nimetused ning vakantside nimetused olla sisestatud suvalises
vormis. Sissel&uuml;litatud ametikohtade arvestuse re&#382;iimi puhul
v&otilde;ib t&ouml;&ouml;tajate ning vakantside suvaliste nimetuste sisestamine
olla keelatud vastavalt lippude&nbsp;<b>N&otilde;uda kohustuslikku t&ouml;&ouml;taja
sidumist ametikohaga</b> abil sektsioonis<b> Administreerimine-&gt;&Uuml;ldised
seadistused -&gt;Ametistruktuur</b>&nbsp;ning <b>N&otilde;uda vakantsi</b> <b>sidumist ametikohaga </b>abil sektsioonis <b>Administreerimine-&gt;&Uuml;ldised
seadistused -&gt;T&ouml;&ouml; vakantsidega</b>.</p>
<p>Samuti v&otilde;ib tarkvaras olla sisse
l&uuml;litatud t&uuml;&uuml;pametikohtade arvestuse re&#382;iim, millele
v&otilde;ivad (v&otilde;i peavad) viitama k&otilde;ik ametikohad. Selleks on
vajalik paigutada lippu <b>Pidama
t&uuml;&uuml;pametikohtade arvestust </b>sektsioonis
<b>Administreerimine-&gt;&Uuml;ldised seadistused -&gt;Ametistruktuur</b>. T&uuml;&uuml;pametikohtade
arvestust kasutatakse suhteliselt harva ning reeglina &uuml;levaatuseks, ametikohtadele
formaalsete n&otilde;udmiste &uuml;hise kataloogi s&auml;ilitamise vajaduse
puhul.</p><br/>
<br/>
<p><a href="4AB390737FAB0239.htm">Struktuurüksuse kaart</a></p>
<p><a href="4AB390737FAB023A.htm">Töötaja (kontaktisiku) kaart</a></p>
<p><a href="4AB390737FAB023D.htm">Ametikoha kaart</a></p>
<p><a href="long_div_row.htm">Soovitused süsteemi seadistamiseks ametistruktuuriga tööks suurtes (holding) ettevõtetes  </a></p>
</body>
</html>
