<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>Vakantsi lisamine</h1>
<p>Reeglina sisestab Datex Recruit kasutaja (v&auml;rbaja)
vakantsi k&auml;sitsi.</p>
<ul type="disc">
 <li>Vakantsi
     k&auml;sitsi lisamiseks vajutage nupp<b> Uus vakants</b> instrumentide
     ribal. Lisaks on seda v&otilde;imalik teha vahetult
     t&ouml;&ouml;taja/kontaktisiku kaardilt nupu „Uus vakants“ abil
     instrumentide ribal. Sellisel juhul t&auml;idetakse v&auml;lju <b>Struktuur&uuml;ksus (Klient</b>&nbsp;– personaliagentuuride
     jaoks) ning <b>Kontaktisikud</b> automaatselt.</li>
</ul>
<p>Avaneb uue vakantsi t&uuml;hi kaart. Vaikimisi omab
uus vakants staatust <b>T&ouml;&ouml;s</b>.</p>
<p>Reeglina on kohustuslikuks t&auml;imiseks
v&auml;ljad&nbsp;<b>Nimetus,</b>&nbsp;<b>Struktuur&uuml;ksus</b> (ettev&otilde;tte
personaliteenistuste jaoks) v&otilde;i <b>Klient</b> (personaliagentuuride
jaoks).</p>
<p>Struktuur&uuml;ksuse valimisel (ettev&otilde;tete
personaliteenistuste jaoks) kuvatakse olemasolevate &uuml;ksuste nimekirja ning
seej&auml;rel t&auml;idab tarkvara automaatselt kontaktisikute nimekirja nende
&uuml;ksuste juhi v&otilde;i teise t&ouml;&ouml;taja nimega (juhul, kui ta on
selle &uuml;ksuse ainus t&ouml;&ouml;taja).</p>
<p>Kliendi valikul (personaliagentuuride jaoks) t&auml;idab
tarkvara vaikimisi kontaktisikute nimekirja antud organisatsiooni-kliendi v&otilde;tmeisiku
nimega (kellel on sisse l&uuml;litatud lipp <b>Peamine</b> <b>kontaktisik</b>). Juhul, kui peamine kontaktisik puudub
v&otilde;i side temaga oli kaotatud, moodustatakse kontaktisikute nimekirja
organisatsiooni-kliendi alles j&auml;&auml;nud aktiivsete isikute koosseisust.</p>
<p>Kontaktisikute nimekirja automaatset laadimist
kliendi valimisel v&otilde;ib vajadusel v&auml;lja l&uuml;litada sektsioonis<b>
Administreerimine-&gt;&Uuml;ldised seadistused</b> -&gt;<b>T&ouml;&ouml; vakantsidega</b>, v&otilde;ttes lipu <b>Vakantsi loomisel automaatselt
laadida kontaktisikute nimekirja kliendi kaardilt </b>&auml;ra.</p>
<p>Lisaks sellele, on Teil v&otilde;imalik &auml;ra
muuta moodustatud kontaktisikute nimekirja k&auml;sitsi: lisada kirjet vajutades
paremal poolel nuppu <b>Valida kontaktisik
nimekirjast</b> v&otilde;i kustutada, vajutades nimekirjas valitud positsioonil
parema nupuga ning valides kontekstmen&uuml;&uuml;s k&auml;sku <b>Kustutada</b>.</p>
<p>Vaikimisi luuakse vakantsi sisestamisel
&uuml;ksikvakants (valik <b>&Uuml;ksik</b>).</p>
<p>Valik <b>Mitme
inimese peale</b> lubab teostada mitme inimese otsingut &uuml;hesuguse
t&uuml;&uuml;bi vakantsile. Igale vajaminevale inimesele luuakse nn. detailset
vakantsi oma parameetrite kogumiga (avamise kuup&auml;ev, tekkimise alus,&nbsp;prioriteet,
otsingu t&auml;htaeg, v&auml;rbaja, finaalne kandidaat, palk), mida s&auml;ilitatakse
p&otilde;hivakantsi kaardil (sektsioon <b>Detailsus</b>).
Tarkvaras on ette n&auml;htud detailsuse massilise vahetuse v&otilde;imalus
kontekstmen&uuml;&uuml; k&auml;su <b>Muuta
staatus </b>abil, mida
kutsutakse esile hiire parema nupuga valitud detailsuse kaartide grupil.</p>
<p>Valik <b>Massiline (vool)</b>&nbsp;lubab l&auml;bi viia
piiramata inimeste arvu otsingut massilisele vakantsile, mida reeglina kunagi
ei suleta.</p>
<ul type="disc">
 <li>T&auml;ites
     vakantsi kaardi kohustuslikud v&auml;ljad, vajutage <b>Salvestada ja sulgeda</b>.</li>
</ul>
<p>&nbsp;</p>
<p>Vajadusel saab Datex Recruit integreerida
ettev&otilde;tte korporatiivportaaliga selliselt, et struktuur&uuml;ksuse juht
saab esitada vakantside taotlusi portaali veebiliidese kaudu, mille j&auml;rel imporditakse
neid automaatselt Datex Recruit-sse uute kinnitamata vakantsidena (staatusega <b>Uus taotlus</b>).</p></body>
</html>
