<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>Ligipääsu tasemed</h1>
<p>Igale
kasutajale tarkvara v&otilde;rguversioonis tagatakse teatud ligip&auml;&auml;su
taset (tavaliselt <b>Standardne kasutaja</b>), mis piirab ligip&auml;&auml;su &otilde;igusi
tarkvara &uuml;hele v&otilde;i teisele sektsioonile (funktsioonile).</p>
<p>Peale
paigaldust sisaldab tarkvara allolevaid ligip&auml;&auml;su tasemeid:</p>
<ul type="disc">
 <li><b>Rakenduse
     administraator </b>– kasutajal puuduvad igasugused piirangud tarkvaras.</li>
</ul>
<ul type="disc">
 <li><b>Standardne
     kasutaja </b>– kasutaja omab andmebaasile t&auml;ieliku
     ligip&auml;&auml;su, kuid ei saa redigeerida sektsiooni <b>Administreerimine</b>.</li>
</ul>
<p>Ligip&auml;&auml;su
tasemete seadustamine toimub sektsioonis <b>Administreerimine-&gt;Kataloogid-&gt;&Uuml;ldised-&gt;Ligip&auml;&auml;su
tasemed</b> lippude komplekti muutmisega.</p>
<p>&nbsp;</p>
<p>Ligip&auml;&auml;su
taseme kaart sisaldab j&auml;rgmist lippude komplekti:</p>
<p><b>T&auml;ielik
ligip&auml;&auml;s</b>. Kasutaja v&otilde;ib teostada igasuguseid toiminguid administraatoriga
samal tasemel, sealhulgas luua uusi kasutajaid ning muuta nende &otilde;igusi. Juhul,
kui see lipp on paigutatud, eiratakse k&otilde;ikide teiste lippude
v&auml;&auml;rtusi.</p>
<p><b>On
lubatud andmete kustutamine pr&uuml;gikastist.</b>&nbsp;Juhul, kui see lipp on
paigas,  kasutajal on &otilde;igus
andmete l&otilde;plikuks kustutamiseks pr&uuml;gikastist ning samuti ka
kustutatud andmete taastamiseks.</p>
<p><b>On
lubatud &uuml;ldiste seadistuste muutmine</b>. Lubab antud kasutajale
igasuguste seadistuste muutmist sektsioonis<b> Administreerimine</b>, v&auml;lja
arvatud sektsioonide<b> Kasutajad</b>,&nbsp;<b>Grupid </b>ning&nbsp;<b>Ligip&auml;&auml;su
tasemed</b>.</p>
<p><b>On
lubatud kasutajate ning gruppide redigeerimine</b>. Lubab antud kasutajale luua
uusi kasutajaid/gruppe ning muuta nende &otilde;igusi.</p>
<p><b>On
lubatud objektide &uuml;levaatus piiratud ligip&auml;&auml;suga</b>. Lubab antud kasutajale
t&ouml;&ouml;tada vakantsidega piiratud ligip&auml;&auml;suga (eksklusiivsed
vakantsid).</p>
<p><b>Ligip&auml;&auml;s
ainult &uuml;levaatuseks</b>. Juhul, kui lipp on paigas, omab kasutaja
s&uuml;steemile ligip&auml;&auml;su ainult &uuml;levaatuse re&#382;iimis.</p>
<p><b>On
keelatud igasuguste objektide kustutamine.</b>&nbsp;Antud seadistuse
sissel&uuml;litamine keelab kasutajal kustutada igasuguseid objekte Datex
Recruit-st (vakantse, kandidaate, s&uuml;ndmusi jms.).</p>
<p><b>On
keelatud kasutaja vahetamine igal kaardil</b>. Antud seadistuse
sissel&uuml;litamine keelab kaardi omaniku vahetamist.</p>
<p><b>On
keelatud grupi vahetamine igal kaardil</b>. Antud seadistuse
sissel&uuml;litamine keelab kaardil m&auml;&auml;ratud grupi vahetamist.</p>
<p><b>On
keelatud ekraanil kuvatud nimekirjade kopeerimine ning eksport.</b>&nbsp;Antud seadistuse
sissel&uuml;litamine keelab nimekirjade kopeerimist ning nende eksporti MS
Excel-sse v&otilde;i OpenOffice Calc-sse.</p>
<p><b>On
keelatud vastaspoolte redigeerimine.</b>&nbsp;Antud seadistuse sissel&uuml;litamine keelab
igasuguseid tegevusi kaartidega (sealhulgas nende loomist) sektsioonis Vastaspooled
(Personaliteenistuse jaoks) v&otilde;i Kliendid (Personaliotsingu agentuuri
jaoks).</p>
<p><b>On
keelatud teiste gruppide vastaspoolte &uuml;levaatus</b>.&nbsp;Juhul, kui antud lipp on
paigas, ei saa kasutaja avada Vastaspoolte (Personaliteenistuse jaoks) v&otilde;i
Klientide  (Personaliotsingu agentuuri
jaoks) kaarte, juhul kui nad kuuluvad teise grupi kasutajate hulka.</p>
<p><b>On
keelatud ametikohtade &uuml;levaatus grupi juur&uuml;ksusest v&auml;ljaspool.</b>&nbsp;K&auml;esoleva seadistuse
sissel&uuml;litamine v&otilde;imaldab ainult selliste ametikohtade
&uuml;levaatust, mis on seotud v&auml;rbaja grupi seadistustes
m&auml;&auml;ratud juur&uuml;ksusega. V&auml;rbajad, kes kuuluvad sellisse
gruppi, n&auml;evad tarkvara peaakna sektsioonis Ametikohad nende
juur&uuml;ksusele kuuluvaid ametikohti.</p>
<p><b>On
keelatud teiste kasutajate kalendrite &uuml;levaatus</b>. Juhul, kui antud lipp on
paigas, ei saa kasutaja &uuml;le vaadata s&uuml;ndmusi ning andmeid teiste
kasutajate kalendritest.</p>
<p><b>On
keelatud teiste gruppide kalendrite &uuml;levaatus.</b>&nbsp;K&auml;esoleva seadistuse
sissel&uuml;litamine v&otilde;imaldab kasutajal &uuml;le vaadata vaid enda
grupi kalendreid ning s&uuml;ndmusi. &nbsp;</p>
<p><b>On
keelatud struktuur&uuml;ksuste redigeerimine.</b>&nbsp;K&auml;esoleva seadistuse
sissel&uuml;litamine keelab muudatuste sisseviimist struktuur&uuml;ksuste
kaartidel, sealhulgas ka nende loomist v&otilde;i kustutamist.</p>
<p><b>On
keelatud teiste kasutajate vakantside &uuml;levaatus.</b>&nbsp;K&auml;esoleva seadistuse
sissel&uuml;litamine lubab kasutajale &uuml;le vaadata ainult temaga seotuid
vakantse.</p>
<p><b>On
keelatud teiste gruppide vakantside &uuml;levaatus.</b>&nbsp;K&auml;esoleva seadistuse
sissel&uuml;litamine lubab &uuml;le vaadata ainult enda grupi kasutajatega
seotuid vakantse.</p>
<p><b>On
keelatud teiste kasutajate vakantside redigeerimine.</b> Antud seadistuse
sissel&uuml;litamine lubab v&auml;rbajatel redigeerida ainult nendega seotud
vakantside kaarte.</p>
<p><b>On
keelatud teiste kasutajate kandidaatide &uuml;levaatus</b>. Juhul, kui k&auml;esolev lipp
on paigas, ei saa kasutaja &uuml;le vaadata teiste kasutajate kandidaate.</p>
<p><b>On
keelatud teiste kasutajate vakantsile valitud ning teatud staatuseni
j&otilde;udnud kandidaatide &uuml;levaatus.</b>&nbsp;Antud seadistuse
sissel&uuml;litamine keelab kasutajal &uuml;le vaadata teiste kasutajate
vakantsidele valituid ning v&auml;ljas <b>Peidetud
kandidaadi staatus</b> staatuseni j&otilde;udnuid kandidaate.</p>
<p><b>On
keelatud teiste kasutajate kandidaatide redigeerimine.</b>&nbsp;Antud seadistuse sissel&uuml;litamine
v&otilde;imaldab kasutajal redigeerida vaid temaga seotud kandidaatide kaarte.&nbsp;</p>
<p>M&auml;rkus.
Antud keeld ei laiene kandidaadi &uuml;le teostatavatele toimingutele.</p>
<p><b>On
keelatud teistel kasutajatel t&ouml;&ouml;s olevate kandidaatide redigeerimine.&nbsp;</b>Antud seadistuse sissel&uuml;litamine
keelab nende kandidaatide redigeerimist, kellega on juba toimumas mingid
toimingud teiste kasutajatega seotud vakantside osas.</p>
<p>M&auml;rkus.
Antud keeld ei laiene kandidaadi &uuml;le teostatavatele toimingutele.</p>
<p><b>On
keelatud teiste gruppide kandidaatide &uuml;levaatus.</b> K&auml;esoleva seadistuse
sissel&uuml;litamine lubab &uuml;le vaadata ainult enda grupi kasutajatega
seotuid kandidaate.</p>
<p><b>On
keelatud teiste gruppide kandidaatide kaartide sisu &uuml;levaatus.</b>&nbsp;Antud seadistuse
sissel&uuml;litamine lubab kasutajal vaadata antud grupiga seotuid kandidaate, kuid
keelab &uuml;le vaadata nende kaartide sisu.</p>
<p><b>On
keelatud teiste gruppide kandidaatide kaardi manuste &uuml;levaatus.</b>&nbsp;Antud seadistuse
sissel&uuml;litamine keelab kasutajal &uuml;le vaadata teatud manuste
t&uuml;&uuml;pe teise grupiga seotud kandidaatide kaartidel. Peidetud
t&uuml;&uuml;pide loetelu seadistatakse ette v&auml;ljas <b>Manuse
t&uuml;&uuml;p</b>.</p>
<p><b>On
keelatud vakantsi avamise kuup&auml;eva muutmine.</b>&nbsp;Antud seadistuse
sissel&uuml;litamine keelab kasutajal muuta Avamise kuup&auml;eva v&auml;lja
v&auml;&auml;rtust vakantsi kaardil.</p>
<p><b>On
keelatud vakantsi sulgemise planeeritud t&auml;htaja muutmine.</b>&nbsp;Antud seadistuse
sissel&uuml;litamine keelab kasutajal muuta v&auml;ljade <b>Planeeritud
t&auml;htaeg</b> ning&nbsp;<b>Sulgeda kuni </b>v&auml;&auml;rtusi vakantsi
kaardil.</p>
<p><b>On
keelatud agentuuri tulu &uuml;levaatus vakantsi osas.</b>&nbsp;Antud seadistuse
sissel&uuml;litamine keelab kasutajal vaadata vakantsi osas finantsinfot, mis
on kuvatud v&auml;ljades <b>Maksumus </b>ning&nbsp;<b>Konsultandi tasu</b> vakantsi
kaardi sektsioonis Lisaandmed.</p>
<p><b>Kliendi
valik vakantsi kaardil on piiratud oma ettev&otilde;tetega.</b>&nbsp;Antud seadistuse
sissel&uuml;litamine lubab kasutajal lisada vakantsi kaardile ainult temaga
seotuid kliente.</p>
<p><b>Lubada
ainult teatud staatusega kandidaatide &uuml;levaatust</b>. Lubab antud kasutajal
t&ouml;&ouml;tada vaid selliste teiste kasutajate kandidaatidega, kes asuvad
&uuml;hes v&auml;ljas <b>Kandidaadi staatus
</b>m&auml;&auml;ratud<b> </b>staatustest.</p>
<p><b>On
keelatud vakantside &uuml;levaatus oma &uuml;ksusest v&auml;ljaspool</b>. Antud seadistuse
sissel&uuml;litamine keelab kasutajal vakantside &uuml;levaatust oma
juur&uuml;ksusest v&auml;ljaspool.</p>
<p><b>On
keelatud enda &uuml;ksuses vakantsidele mittevaadeldavate kandidaatide kaartide
avamine</b>. Antud
seadistuse sissel&uuml;litamine keelab kasutajal t&ouml;&ouml;tada enda
juur&uuml;ksusest v&auml;ljaspool vakantsidele vaadeldavate kandidaatidega.</p>
<p>M&auml;rkus.
Juhul, kui esialgselt t&ouml;&ouml;tasid kasutajad s&uuml;steemis jaotuseta
gruppidesse ning seej&auml;rel v&otilde;eti vastu otsuse jagada neid
gruppidesse v&otilde;i tehti muudatused ligip&auml;&auml;su tasemete
seadistustesse grupikeelude osas, on vajalik &uuml;mber salvestada eelnevalt
loodud objektide (klientide/vastaspoolte, vakantside ning kandidaatide) kaarte.</p></body>
</html>
