<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>Statistika</h1>
<p>Sektsioon<b>
Statistika </b>avatakse eraldi aknas
k&auml;suga<b> Servis-&gt;Statistika</b>&nbsp;v&otilde;i instrumentide
paneeli nupu <b>Statistika </b>(diagrammi
kujul) vajutusega.&nbsp;</p>
<p>Antud
sektsioon sisaldab rida aruandeid, mis on grupeeritud aruandluse
t&uuml;&uuml;bi v&otilde;i objekti j&auml;rgi. &Uuml;he v&otilde;i teise
aruande loomiseks, tuleb valida seda akna vasakus osas olevast loetelust, m&auml;&auml;rata
vajadusel lisaparameetreid (<b>Kuup&auml;ev</b>,&nbsp;<b>V&auml;rbaja
</b>jne.) ning vajutada nuppu <b>Kuvada</b>. Kataloogile viidavate filtrite
jaoks (n&auml;iteks,&nbsp;<b>Otsingu suund</b>,&nbsp;<b>Jooksev staatus</b>), saab valida kohe mitu
v&auml;&auml;rtust, m&auml;rkides neid vaheldumisi hoides klahvi&nbsp;<b>Ctrl</b>.
Standardse perioodi (n&auml;dal, kuu, kvartal, aasta) kiireks valikuks saab
kasutada v&auml;ljast <b>Kuup&auml;ev </b>paremal
asuvat lisanuppu.</p>
<p>M&otilde;ned
aruanded lubavad vaadata statistika detaile – valimi kujul &uuml;ksikasjalikke
andmeid andmebaasist. M&otilde;ne n&auml;itaja j&auml;rgi detailse statistika
saamiseks tuleb kasutajal klikkida aruande t&auml;idetud lahtsisse.</p>
<p>Iga
aruannet saab eksportida Word&acute;i printeri pildiga nupu abil („<b>Tr&uuml;kk“</b>)
v&otilde;i Exceli&acute;sse nupuga <b>„Eksport Microsoft Excel-sse&quot;</b>.
Lisaks sellele, Excel&acute;sse saab aruannet eksportida eelnevalt
ettevalmistatud malli lahtrite automaatse sisestamisega esimesele lehele. Ettevalmistatud
malli saab lisada aruande seadistustes sektsioonis<b> Administreerimine-&gt;Servis-&gt;Aruanded</b>.</p>
<p><b>Jooksev
seis</b></p>
<p><b>Jooksvad
vakantsid v&auml;rbajate kaupa</b> – aruanne, mis peegeldab iga v&auml;rbaja osas
vakantside nimekirja, mis on seotud valitud otsingu suunaga. Iga vakantsi osas
kuvatakse struktuur&uuml;ksust (hierarhilise jaotusega), positsioonide arvu (&uuml;ldist
ning avatuid), avamise kuup&auml;eva, mitu p&auml;eva on ta t&ouml;&ouml;s
olnud.</p>
<p><b>Jooksvad
vakantsid struktuur&uuml;ksuste kaupa</b> - aruanne, mis peegeldab iga struktuur&uuml;ksuse
osas vakantside nimekirja, mis on seotud valitud otsingu suunaga. Iga
struktuur&uuml;ksuse osas kuvatakse sellest tulnud vakantside nimekirja ning
iga vakantsi jaoks n&auml;idatakse positsioonide arvu (&uuml;ldist ning
avatuid), avamise kuup&auml;eva, mitu p&auml;eva on ta t&ouml;&ouml;s olnud.</p>
<p><b>Jooksvad
vakantsid klientide kaupa&nbsp;</b>- aruanne, mis peegeldab iga kliendi osas vakantside
nimekirja, mis on seotud valitud otsingu suunaga. Iga kliendi osas kuvatakse
sellest tulnud vakantside nimekirja ning iga vakantsi jaoks n&auml;idatakse
positsioonide arvu (&uuml;ldist ning avatuid), avamise kuup&auml;eva, mitu
p&auml;eva on ta t&ouml;&ouml;s olnud..</p>
<p><b>V&auml;rbajate
jooksev h&otilde;ivatus</b>&nbsp;– aruanne, mis peegeldab v&auml;rbajate
jooksvat h&otilde;ivatust t&ouml;&ouml;l vakantsidega, mis on seotud valitud otsingu
suunaga. Iga v&auml;rbaja osas n&auml;idatakse temal t&ouml;&ouml;s olevate
vakantside &uuml;ldarvu, jooksvat h&otilde;ivatust ning aegunud vakantside arvu.</p>
<p><b>Jooksev
progress</b>&nbsp;– aruanne,
mis peegeldab vakantsidega t&ouml;&ouml; valitud otsingu suuna protsessi
k&auml;iku. Iga vakantsi osas kuvatakse t&ouml;&ouml;s olemise p&auml;evade
arvu,&nbsp;avalikustamiste arvu t&ouml;&ouml;otsingu portaalidel, mitu
kandidaati oli „sisemisel“ (saabunud vastuste ning iseseisvalt leitud
kandidaatide arv), mitu neist oli valitud  ning mitu j&otilde;udis iga etapini, alustades
t&ouml;&ouml;vestluse planeerimisest kuni pakkumise tegemiseni.</p>
<p>&nbsp;</p>
<p><b>Valiku
protsess</b></p>
<p><b>Otsingu
lehter&nbsp;</b>– aruanne,
mis peegeldab vakantsidega t&ouml;&ouml; protsessi m&auml;&auml;ratud perioodil.
Iga vakantsi osas luuakse „valiku lehtrit“, mis peegeldab taotlejate
juurdevoolu igal valiku etapi sisenemisel ning vastavat &auml;ravoolu
v&auml;ljumisel (nii arvuliselt, kui ka protsentuaalselt).</p>
<p><b>Tagasil&uuml;kkamised&nbsp;</b>– aruanne, mis lubab hinnata
valikut mittel&auml;binud kandidaatide &auml;ravoolu mahte m&auml;&auml;ratud
perioodil etteantud otsingu suuna vakantside osas. Iga vakantsi osas
n&auml;idatakse, palju oli kokku kandidaate t&ouml;&ouml;s ning palju neist ei
l&auml;binud konkursi &uuml;hel v&otilde;i teisel p&otilde;hjusel (nii
arvuliselt, kui ka protsentuaalselt).</p>
<p><b>Kandidaatide
keeldude p&otilde;hjused</b> – aruanne, mis lubab anal&uuml;&uuml;sida
taotlejate keeldude p&otilde;hjuseid m&auml;&auml;ratud perioodil etteantud
otsingu suunda ja/v&otilde;i personali kategooria vakantside osas. Iga vakantsi
osas kuvatakse, palju kandidaate keeldus &uuml;ldse ning palju neist keeldus
&uuml;hel v&otilde;i teisel p&otilde;hjusel (nii arvuliselt, kui ka protsentuaalselt).</p>
<p><b>&Auml;ravool
katseajal&nbsp;</b>– aruanne, mis lubab hinnata t&ouml;&ouml;le v&otilde;etud, kuid
katseaega mitte l&auml;binud 
kandidaatide, keda vaadeldakse ette antud otsingu suunda ja/v&otilde;i
personali kategooria vakantsidele, &auml;ravoolu mahtu m&auml;&auml;ratud
perioodil. Iga v&auml;rbaja osas kuvatakse, kui palju kandidaate v&otilde;eti
t&ouml;&ouml;le ning mitmega neist t&ouml;&ouml;lepingu l&otilde;petati (nii
arvuliselt, kui ka protsentuaalselt).</p>
<p><b>Otsingu
protsess 1</b>&nbsp;– aruanne,
mis peegeldab vakantsidega t&ouml;&ouml; protsessi k&auml;iku
m&auml;&auml;ratud perioodil (<b>Periood</b>).
Iga vakantsi osas, mille osas teostati kandidaatidega t&ouml;&ouml;
m&auml;&auml;ratud perioodil, n&auml;idatakse nii nimetatut „otsingu lehtrit“, mitu
kandidaati oli „sisenemisel“ (valitud), mitu neist l&auml;bis t&ouml;&ouml;vestlust,
mitu CV-d (t&ouml;&ouml;vestlust l&auml;binud kandidaate) saadeti tellijale
&uuml;levaatuseks (lisainfo veerus „%“ – nende osakaal toimunud t&ouml;&ouml;vestluste
koguse suhtes), mitu neist l&auml;bis seej&auml;rel t&ouml;&ouml;vestluse
tellijaga (lisainfo veerus „%“ – nende osakaal tellija poolt &uuml;le vaadatud CV-de
arvu suhtes), mitu neist oli kokkuv&otilde;ttes t&ouml;&ouml;le v&otilde;etud. Kolm
viimast veergu, n&auml;itavad mitu valitud kandidaatidest oli tagasi l&uuml;katud
&uuml;he v&otilde;i teise algataja poolt: v&auml;rbaja, tellija v&otilde;i
kandidaadi (keeld) poolt.</p>
<p><b>Otsingu
protsess 2 –</b>&nbsp;analoogne
aruanne, mis peegeldab vakantsidega t&ouml;&ouml; protsessi k&auml;iku
m&auml;&auml;ratud perioodil (<b>Periood</b>),
kuid mis lisaks sisaldab informatsiooni aktiivsete vakantside, nende
prioriteetide, finaalsete kandidaatide nimekirja kohta ning kommentaare
vakantsidele.&nbsp;Selle aruande „otsingu lehtri“ viimaseks etapiks on t&ouml;&ouml;vestlus
tellijaga (personaliagentuuride jaoks) v&otilde;i turvateenistuse kontroll (personaliteenistuste
jaoks).</p>
<p><b>Vakantsid
+ Kandidaadid </b>– aruanne, mis peegeldab jooksvat olukorda aktiivsete v&auml;rbaja/grupi
vakantside osas t&ouml;&ouml;s kandidaatidega.&nbsp;Iga aktiivse vakantsi osas
kuvatakse lisaks p&otilde;hilisele informatsioonile (avamise kuup&auml;ev,
aktiivsete vakantside arv, struktuur&uuml;ksus (personaliteenistuste jaoks) v&otilde;i
klient (personaliagentuuride jaoks)) ka kandidaatide aktuaalset nimekirja (ehk
vaid neid, kes asuvad aktiivses staatuses ning kellega viidi eelmise kahe kuu
jooksul l&auml;bi t&ouml;&ouml;). Iga kandidaadi jaoks kuvatakse tema jooksvat
staatust.</p>
<p><b>V&auml;rbajad
+ s&uuml;ndmused</b>&nbsp;– koondaruanne, mis kajastab &uuml;ldist pilti ning k&otilde;ikide
v&auml;rbajate t&ouml;&ouml; efektiivsust m&auml;&auml;ratud perioodil nende
aktiivsuse alusel. Iga kandidaatidega m&auml;&auml;ratud perioodil
t&ouml;&ouml;d teostanud v&auml;rbaja osas kuvatakse „otsingu lehtrit“, alustades
andmebaasi sisestatud kandidaatide arvust kuni t&ouml;&ouml;lev&otilde;etud,
tagasil&uuml;katud v&otilde;i reservi arvatud kandidaatide arvuni.</p>
<p>&nbsp;</p>
<p><b>Vakantsid</b></p>
<p><b>Vakantside
seisukord v&auml;rbajate kaupa –</b>&nbsp;aruanne, mis peegeldab v&auml;rbajate
arvulisi n&auml;itajaid vakantsidega t&ouml;&ouml; osas m&auml;&auml;ratud
perioodil. Iga v&auml;rbaja kohta kuvatakse vakantside arvu perioodi
alguses/l&otilde;pus, avatud, suletud, peatatud ning  tagasikutsutud vakantside arvu
m&auml;&auml;ratud perioodil, samuti ka sulgemiseks planeeritavate vakantside
kogust.</p>
<p><b>Vakantside
seisukord &uuml;ksuste kaupa –</b>&nbsp;aruanne, mis peegeldab
struktuur&uuml;ksustest saabunuid arvulisi n&auml;itajaid vakantsidega
t&ouml;&ouml; osas m&auml;&auml;ratud perioodil. Iga struktuur&uuml;ksuse kohta
kuvatakse n&auml;itajaid vakantside arvu kohta perioodi alguses/l&otilde;pus, avatud,
suletud, peatatud ning  tagasikutsutud
vakantside arvu kohta m&auml;&auml;ratud perioodil, samuti ka sulgemiseks
planeeritavate vakantside koguse kohta.</p>
<p><b>Vakantside
seisukord klientide kaupa -</b>&nbsp;aruanne, mis peegeldab arvulisi
n&auml;itajaid klientidelt saabunud vakantsidega t&ouml;&ouml; osas
m&auml;&auml;ratud perioodil. Iga kliendi kohta kuvatakse n&auml;itajaid
vakantside arvu kohta perioodi alguses/l&otilde;pus, avatud, suletud, peatatud
ning  tagasikutsutud vakantside arvu kohta
m&auml;&auml;ratud perioodil, samuti ka sulgemiseks planeeritavate vakantside koguse
kohta.</p>
<p><b>&Uuml;ldised
n&auml;itajad </b>– aruanne, mis peegeldab &uuml;ldisi n&auml;itajaid perioodi jooksul
avatud vakantside osas (<b>Avamise
kuup&auml;ev</b>): palju avati vakantse kokku, palju neist suleti, s.h.
t&auml;htajaks, palju oli t&uuml;histatud, vakantside sulgemise keskmist
ajavahemikku.</p>
<p><b>Otsingu
t&auml;htajad</b> – aruanne,
mis n&auml;itab m&auml;&auml;ratud perioodi jooksul avatud vakantsidega
t&ouml;&ouml; tulemusi (<b>Avamise kuup&auml;ev</b>). Iga vakantsi kohta
kuvatakse mitu p&auml;eva on ta t&ouml;&ouml;s olnud, normatiivaega, plussiga
t&auml;histatakse t&auml;htajaks suletuid vakantse ning iga kasutaja jaoks
arvutatakse v&auml;lja &otilde;igeks t&auml;htajaks suletud vakantside protsenti.&nbsp;Lisaks
sellele, n&auml;idatakse finaalset kandidaati ning k&otilde;ige viimases veerus
asub kommentaar vakantsile, n&auml;iteks, kaaluv p&otilde;hjus, mille
t&otilde;ttu ei olnud vakants t&auml;htajaks suletud. Kui on vajalik aruannet
vaid suletud vakantside osas, tuleb &uuml;mber l&uuml;litada d&uuml;naamilist
filtrit v&auml;&auml;rtuselt <b>Jooksev
staatus </b>v&auml;&auml;rtuse<b> Suletud</b>
peale.</p>
<p><a name="0.1_OLE_LINK3"></a><a name="0.1_OLE_LINK4"></a>Koondn&auml;itajad:</p>
<p>V&auml;rbaja
j&auml;rgi grupeerimise real:</p>
<p>- veerg &quot;P&auml;eva
t&ouml;&ouml;s &quot; – vakantsidega t&ouml;&ouml; keskmine p&auml;evade arv.</p>
<p>- veerg
&quot;+&quot; – &otilde;igeks t&auml;htajaks suletud vakantside kogus.</p>
<p>Real
Kokku:</p>
<p>- veerg
&quot;Jooksev staatus &quot; – aruande vakantside &uuml;ldkogus.</p>
<p>- veerg
&quot;P&auml;eva t&ouml;&ouml;s&quot; – aruande k&otilde;ikide vakantsidega
t&ouml;&ouml; keskmine p&auml;evade arv.</p>
<p>- veerg &quot;+&quot;
– &otilde;igeks t&auml;htajaks suletud vakantside summaarne kogus</p>
<p><b>Otsingu
t&auml;htajad (detailid)</b>&nbsp;– analoogne aruanne, mis peegeldab
t&ouml;&ouml; tulemusi k&otilde;ikide m&auml;&auml;ratud perioodi jooksul
avatud (<b>Avamise kuup&auml;ev) </b>vakantside
osas (sealhulgas detailsetega).</p>
<p><b>Suletud
kuup&auml;evade j&auml;rgi</b> – aruanne, mis n&auml;itab
v&otilde;tmeinformatsiooni m&auml;&auml;ratud perioodi jooksul suletud
vakantside osas (<b>Sulgemise kuup&auml;ev</b>).
Iga vakantsi kohta kuvatakse avamise ning sulgemise kuup&auml;eva, struktuur&uuml;ksust
(personaliteenistuste jaoks) v&otilde;i klienti (v&auml;rbamisagentuuride jaoks)
ning finaalset kandidaati.</p>
<p><a name="0.1_OLE_LINK7"></a><a name="0.1_OLE_LINK8"></a>Koondn&auml;itajad:&nbsp;<a name="0.1_OLE_LINK11"></a><a name="0.1_OLE_LINK10"></a><a name="0.1_OLE_LINK9"></a>arvutatakse v&auml;lja kuu, aasta
jooksul suletud vakantside arvu ning nende &uuml;ldist kogust.</p>
<p><b>Valiku
allikate j&auml;rgi</b> – aruanne, mis peegeldab kandidaatide saabumise allikate (n&auml;iteks,
personaliagentuuride kodulehek&uuml;lgede) efektiivsust &quot;v&auml;ljumisel &quot;,
s.t. mis lubab hinnata, milliselt neist saabub enam kandidaate, keda
kokkuv&otilde;ttes valitakse vakantsile.</p>
<p><a name="0.1_OLE_LINK12"></a><a name="0.1_OLE_LINK15"></a><a name="0.1_OLE_LINK14"></a><a name="0.1_OLE_LINK13"></a>Koondn&auml;itajad:
arvutatakse v&auml;lja suletud vakantside kogust.</p>
<p><b>Keerukusastmete</b>,&nbsp;<b>Erialade</b>,&nbsp;<b>V&auml;rbajate/gruppide j&auml;rgi</b> -aruanded, mis
peegeldavad m&auml;&auml;ratud perioodi jooksul <b>(Avamise kuup&auml;ev)</b> avatud vakantsidega t&ouml;&ouml; osas
jooksvaid tulemusi vastavalt keerukusastmete, erialade v&otilde;i
v&auml;rbajate kaupa. Iga parameetri kohta kuvatakse etteantud perioodi jooksul
avatud vakantside &uuml;ldarvu, mitu neist oli suletud jooksval momendil, palju
suletud vakantsidest suleti &otilde;igeks t&auml;htajaks,&nbsp;otsingu keskmist
perioodi ning t&uuml;histatud vakantside arvu.</p>
<p>Koondn&auml;itajad:
arvutatakse v&auml;lja vakantside &uuml;ldarvu iga n&auml;itaja osas ning
otsingu keskmist t&auml;htaega.</p>
<p><b>Kandidaadid</b></p>
<p><b>Saabumise
allikate j&auml;rgi</b> – aruanne, mis peegeldab kandidaatide saabumise allikate efektiivsust
„sisenemisel“, s.t. mis lubab hinnata, mis allikast saabub enam kandidaate.</p>
<p>Koondn&auml;itajad:
arvutatakse v&auml;lja andmebaasi sisestatud ning t&ouml;&ouml;le v&otilde;etud
kandidaatide &uuml;ldarvu.</p>
<p><b>Erialade
j&auml;rgi</b> – aruanne,
mis n&auml;itab v&auml;rbaja poolt m&auml;&auml;ratud perioodi jooksul (<b>Kandidaadi sisestamise kuup&auml;ev) </b>andmebaasi lisatud kandidaatide
jaotust erialade j&auml;rgi.</p>
<p><b>Sisemised
soovitused</b> – aruanne,
mis n&auml;itab m&auml;&auml;ratud perioodi jooksul <b>(Kuup&auml;ev) </b>t&ouml;&ouml;le v&otilde;etud kandidaatide
nimekirja, kes olid andmebaasi lisatud sisemise soovituse j&auml;rgi .</p>
<p>&nbsp;</p>
<p><b>Muu </b></p>
<p><b>Personaliotsingu
kulud</b>&nbsp;- aruanne,
mis n&auml;itab maksete nimekirja, mille osas on m&auml;&auml;ratud perioodil (<b>Alguskuup&auml;ev</b>) alustatud teenuste
osutamine.</p>
<p><b>Eelarve
t&auml;itmine</b> - aruanne,
mis peegeldab kvartaalset eelarve t&auml;itmise bilanssi m&auml;&auml;ratud
perioodil.</p>
<p>&nbsp;</p>
<p>&nbsp;</p></body>
</html>
