<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>CV import Microsoft Outlook või Mozilla Thunderbird nupu kasutamisega</h1>
<p>Datex Recruit lubab lisada nuppu <b>CV import Datex Recruit-sse</b>&nbsp; Microsoft Outlook v&otilde;i Mozilla
Thunderbird instrumentide ribale. Antud nupu abil v&otilde;ib kiiresti
t&otilde;sta kandidaadi CV-d kirjast Datex Recruit-sse. Siinjuures,
s&otilde;ltumata sellest, kas CV asus kirja tekstis v&otilde;i lisatud failis, rakendus
impordib seda CV-d kandidaadi kaardile ning tuvastab v&otilde;tmev&auml;lju.</p>
<p>Esimesel k&auml;ivitamisel pakub Datex Recruit lisada
seda nuppu automaatselt. Samuti on Teil v&otilde;imalik teha seda ka hiljem
sektioonis <b>Personaalsed seadistused -&gt;Moodulid v&auml;liste tarkvarade jaoks</b>.</p>
<p>Kandidaadi CV kiireks impordiks Microsoft Outlook v&otilde;i
Mozilla Thunderbird s&otilde;numist Datex Recruit-sse:</p>
<ul type="disc">
 <li>Valige
     kandidaadi CV-d sisaldav kiri.</li>
 <li>Vajutage
     nupp <b>CV import Datex Recruit-sse</b>&nbsp;
     Microsoft Outlook v&otilde;i Mozilla Thunderbird instrumentide ribal.</li>
</ul>
<p>Juhul kui kandidaat on juba andmebaasis olemas ning
Microsoft Outlook kiri sisaldab kasv&otilde;i &uuml;hte manust v&otilde;i kui
kandidaat on uus ning kiri sisaldab &uuml;hest manusest enam ilmub dialoogi
aken „Posti kirja import“, mis sisaldab failide nimekirja. Iga manuse jaoks on
k&auml;ttesaadav valik „Importida“ (vaikimisi &auml;ra m&auml;rgistatud) ning
nimekiri lisatud failide t&uuml;&uuml;biga (kataloogist<b> Lisad kaartidele</b>).
Nupu „OK“ vajutamisega laaditakse kandidaadi kaardile ainult valitud manused etteantud
lisa t&uuml;&uuml;biga.</p>
<p>Juhul, kui kiri sisaldab mitme kandidaatide manuseid-
CV-d (n&auml;iteks personaliagentuurist), siis valiku abil <b>&Uuml;ks manus – &uuml;ks
kandidaat</b>, luuakse iga valitud CV jaoks eraldi kandidaadi kaarti.</p>
<p>Avaneb kandidaadi kaart, millel on t&auml;idetud tarkvara
poolt tuvastatud v&auml;ljad kirjast. Ekraani alumises osas asub kandidaadi CV
esialgsel kujul. Juhul, kui oli valitud mitu kirja sisestatakse kandidaate andmebaasi
ilma eelneva kaartide avamiseta.</p>
<p>Enne CV lisamist teostab tarkvara eelnevalt
kontrolli andmebaasis v&otilde;imalike olemasolevate dublikaatide osas. Juhul,
kui v&otilde;imalikud dublikaadid leitakse &uuml;lesse, annab tarkvara
v&auml;lja vastavat veateadet.</p></body>
</html>
