<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>SMS mallid</h1>
<p>Datex
Recruit tarkvara v&otilde;imaldab saata valitud kandidaatidele ning tellijatele
mobiilsele telefonile l&uuml;his&otilde;numeid (SMS) eelnevalt ettevalmistatud
malli j&auml;rgi. Vajaliku malli valimiseks SMS saatmiseks saate kasutada nuppu
mobiilitelefoni kujuga kandidaadi v&otilde;i tellija kardil.</p>
<p>SMS saatmise
funktsiooni seadistamist teostatakse sekstioonis<b> Administreerimine–</b>&gt;<b>Kataloogid–&gt;Integratsioon–&gt;SMS-pordid</b>.
Korrektseks seadistamiseks v&otilde;ib vaja minna Teie
s&uuml;steemadministraatori abi. Erandjuhtudel saab seadistamist teostada
ainult s&uuml;steemadministraator.</p>
<p>SMS mallide
lisamiseks kasutatakse sektsiooni<b> Administreerimine-&gt;Kataloogid-&gt; SMS
mallid</b>.</p>
<ul type="disc">
 <li>Uue
     malli lisamiseks vajutage nupp<b> Uus element</b>.</li>
 <li>Avanenud
     aknas sisestage malli <b>Nimetus</b> (Te
     hakkate seda n&auml;gema nimekirjas SMS malli valikul saatmiseks), m&auml;&auml;rake
     <b>Saaja t&uuml;&uuml;p</b> (mall
     konkreetse kontaktisiku, kandidaadi, kasutaja v&otilde;i fikseeritud
     numbri jaoks), ning sisestage s&otilde;numi tekst. Juhul, kui on valitud
     saaja t&uuml;&uuml;p -&nbsp;<b>Kasutaja</b>, siis on vajalik &uuml;le
     kontrollida, et saajate seadistustes (sektsioon <b>Administreerimine-</b>&gt;<b>Ligip&auml;&auml;s</b>-&gt;<b>Kasutajad</b>) on m&auml;&auml;ratud vastav t&ouml;&ouml;taja
     ning selle t&ouml;&ouml;taja kaardil on sisestatud mobiiltelefoni number.</li>
</ul>
<p>S&otilde;numi
sisus on Teil v&otilde;imalik kasutada standardseid arvutatavaid elemente (PNI,
vakants, kavandatud s&uuml;ndmuse kuup&auml;ev), mille kohale asetab tarkvara
tegelikke v&auml;&auml;rtusi.</p>
<p>M&auml;rkus:
arvutatavate elementidega s&otilde;numite korrektseks loomiseks on vajalik, et
s&otilde;numi loomise momendil oleksid kaardile sisestatud andmed, mida asetab
&uuml;ks v&otilde;i teine arvutatav element.</p>
<p>Juhul,
kui loodav mall ei ole m&otilde;eldud SMS saatmiseks k&auml;sitsi kandidaadi
v&otilde;i tellija kaardilt, paigaldage lipp<b> Peita mall kasutaja valikuks
k&auml;ttesaadavate mallide nimekirjast</b>.</p>
<p>Juhul,
kui on vajalik, et s&otilde;numi saatmise fakt antud malli j&auml;rgi oleks
fikseeritud, paigaldage lipp <b>Registreerida kirja saatmise fakt s&uuml;ndmuse
kujul</b> ning valige vajalik s&uuml;ndmus.</p>
<p>&nbsp;</p>
<p>Lipp&nbsp;<b>Uus
grupp men&uuml;&uuml;s</b> lubab mallide nimekirja avamisel kaardil eraldada seda
malli koos selle all olevate mallidega teistelt.</p>
<p>M&auml;&auml;rates
gruppi v&auml;ljas<b> Kasutada ainult kasutajate grupi sees</b> v&otilde;ib
piirata antud malli k&auml;ttesaadavust sellesse gruppi mittekuuluvate
kasutajate jaoks.</p>
<p>Kuna tarkvara
v&otilde;rguversioonis kasutavad k&otilde;ik kasutajad &uuml;hiseid malle, siis
igale kasutajale on vajalik t&auml;ita oma allkirja malli sektsioonis<b> Servis-&gt;Personaalsed
seadistused</b> (punkt <b>Allkiri</b>).</p></body>
</html>
