<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>Vastuste kogumine veebist</h1>
<ul type="disc">
 <li>Vastuste kogumise k&auml;ivitamiseks vajutage
     nupp <b>Otsing Internetis -&gt;Vastuste kogumine veebilehtedelt</b> instrumentide paneelil (v&otilde;i
     minge sektsiooni<b> Vakantsid-&gt;Vastused </b><b>veebilehtedelt</b> ning
     vajutage nupp<b> Laadida vastused</b>) ning avanenud alamen&uuml;&uuml;s
     m&auml;&auml;rake vastuste kogumise ala&nbsp;<b>-K&otilde;ik </b><b>veebilehed</b>&nbsp;v&otilde;i
     &uuml;ks veebilehtedest, kus on vakantsid avalikustatud.</li>
</ul>
<p>Juhul, kui koost&ouml;&ouml; seadistustes
valitud veebilehega ei olnud eelnevalt teostatud, avaneb tarkvara brauseris
autentimise veebilehte, mille kaudu oleks Teil vajalik siseneda veebilehele kasutades
selle personaliotsingu veebilehe oma konto kasutajanimi ning salas&otilde;na.</p>
<p>Avaneb protsessi
k&auml;ek&auml;igu peegeldav vastuste kogumise aken.</p>
<p>Peale vastuste kogumise
l&otilde;ppu saab tulemusi vaadata tarkvara peamise puu sektsioonis&nbsp;<b>Vakantsid-&gt;Vastused veebilehtedelt</b>,
kus toimub ka nende esmane t&ouml;&ouml;tlemine.</p>
<p>Hiljem (peale t&auml;ieliku
kuulutuste nimekirja saamist) on Teil v&otilde;imalik koguda vastuseid mitte
koheselt k&otilde;ikide kuulustuste osas, vaid ka nende osa kohta. Selleks
tuleb filtris <b>Kuvada</b>&nbsp;valida
v&auml;&auml;rtust <b>Kuulutused</b> ning
seej&auml;rel vajamineva kuulutuse kontekstmen&uuml;&uuml;s valida k&auml;sku <b>Kontrollida vastused kuulutustele</b>.</p>
<p>Akna &uuml;lemises osas asub
vakantside/kuulutuste nimekiri.</p>
<ul type="disc">
 <li>Vastuste nimekirja saamiseks antud kuulutuse
     osas selekteerige see aken &uuml;lemises osas olevast nimekirjast.</li>
</ul>
<p>Akna keskosas ilmub vastuste
nimekiri.</p>
<ul type="disc">
 <li>CV vaatluseks selekteerige see nimekirjast. Vastuste
     vaatlemine toimub online re&#382;iimis (vastust m&auml;rgitakse loetuks
     tegeliku &uuml;levaatuse hetkel).</li>
</ul>
<p>Akna alumises osas kuvatakse veebilehe
lehte vastanud taotleja CV-ga.</p>
<p>Paremas alumises nurgas asub
nuppudega ala valitud CV lisamiseks andmebaasi ning v&otilde;tmeinformatsiooni
vaatlemiseks kandidaadi osas, kelle CV oli eelnevalt andmebaasi salvestatud (kiireks
ligip&auml;&auml;suks tema kaardile v&otilde;ib kasutada perekonnanime ja nime
n&auml;ol kuvatud viidet). Samas alas v&otilde;ib &uuml;le vaadata ka kaaskirja
(olemasolu korral).</p>
<ul type="disc">
 <li>Valitud CV t&otilde;stmiseks Teie andmebaasi
     kasutatakse nupp <b>Salvestada andmebaasi.</b></li>
</ul>
<p>Avaneb kandidaadi t&auml;idetud
kaart. Kaardi manustena lisatakse kandidaadi CV-d ning kaaskirja (valikuliselt,&nbsp;seda
valikut saab reguleerida sektsioonis <b>Administreerimine-&gt;&Uuml;ldised seadistused -&gt;Personaliotsingu
veebilehed</b>).</p>
<p>Juhul, kui vakants oli
avalikustatud veebilehel otseselt, mitte Datex Recruit kaudu, siis CV
salvestamisel andmebaasi kuvatakse vastavat hoiatust ning pakutakse valikul  edaspidiste v&otilde;imalike toimingute
variante:</p>
<ul type="disc">
 <li><b>Luua vastavat sisemist vakantsi</b>. Kasutatakse reeglina tarkvara esmasel
     kasutamisel eelnevalt Internetis avalikustatud vakantside automaatseks kaartide
     loomiseks Datex Recruit-s ning nende sidumiseks vastavate kuulutustega.</li>
 <li><b>Siduda kuulutust olemasoleva sisemise
     vakantsiga</b>. Kasutatakse
     juhul, kui tarkvara internetimooduli esmasel kasutamisel olid vakantside
     kaardid andmebaasi juba sisestatud teisel moel.</li>
</ul>
<p>Juhul, kui selgus, et vaadeldav
taotleja sobib paremini teisele ametikohale ning Teil on vajalik sisestada teda
andmebaasi teisele vakantsile, saab CV t&otilde;stmist teostada k&auml;su<b> Salvestada
</b><b>andmebaasi teisele vakantsile</b> abil nupu „K&otilde;ik toimingud“
rippmen&uuml;&uuml;st. Sellisel juhul avaneb dialoogi aken, mis pakub valida
vakantsi aktiivsete vakantside nimekirjast.</p>
<p>S&otilde;ltuvalt tehtud otsusest muutub
andmebaasi salvestatud vastus, seejuures, kandidaadiks, kes on valitud
(v&otilde;imalikud variandid):</p>
<ul type="disc">
 <li>vakantsile, millele ta vastanud on (vaikimisi)</li>
 <li>vakantsile, mille Teie olete
     m&auml;&auml;ranud CV sisestamisel andmebaasi</li>
 <li>esmasele vakantsile (juhul, kui vakants,
     millele on kandidaat vastanud, on lisakuulutuseks esmasele vakantsile – lipp&nbsp;<b>Lisakuulutus teisele vakantsile</b> vakantsi kaardi sektsioonis <b>Lisaandmed</b>).</li>
</ul>
<p>&nbsp;</p>
<ul type="disc">
 <li>Valitud taotleja tagasi l&uuml;kkamiseks
     kasutatakse nuppu <b>Tagasi l&uuml;kata.</b>&nbsp;Sellist vastust
     nimekirjas m&auml;rgitakse s&uuml;mboliga &quot;<b>X</b>&quot;.</li>
</ul>
<p>Salvestatud vastuste
s&auml;ilimisaega andmebaasis reguleeritakse sektsioonis<b> Administreerimine-&gt;&Uuml;ldised
seadistused -&gt;Personaliotsingu </b><b>veebilehed.</b></p></body>
</html>
