<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>Integratsioon testimise süsteemiga</h1>
<p>Datex
Recruit saab olla integreeritud testimise s&uuml;steemiga  WebTutor (juhul, kui viimane on teie
ettev&otilde;ttes paigaldatud). Integratsioon testimise s&uuml;steemiga lubab
teostada kandidaatide testimist s&uuml;steemi WebTutor veebiliidese kaudu
automaatse testimise tulemuste laadimisega Datex Recruit-sse. </p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>Integratsiooni
seadistamiseks Datex Recruit poolt:</p>
<p>· Sisenege
sektsiooni<b> Administreerimine-&gt;Kataloogid-&gt;Integratsioon-&gt;Testimise
v&auml;lised s&uuml;steemid</b> ning avage punkt<b> WebTutor</b>.</p>
<p>· M&auml;&auml;rake
serveri, kus on paigaldatud testimise s&uuml;steemi server, nimi ning
IP-aadress.</p>
<p>· Salvestage
ning sulgege seadistuste aken.</p>
<p>&nbsp;</p>
<p>Testimise
m&auml;&auml;ramiseks kandidaadile:</p>
<ul type="disc">
 <li>Avage
     kandidaadi kaart, vajutage nupp<b>...</b>&nbsp;(<b>Muud s&uuml;ndmused</b>) kaardi vasakus osas ning valige punkt <b>Testimine</b>.</li>
 <li>Avaneb
     kaart automaatselt imporditud testide kogumiga (juhul, kui kogum oli
     m&auml;&auml;ratud vakantsi kaardi sektsioonis N&otilde;uded kandidaadile),
     mis on vajalik l&auml;bida kandideerimiseks k&auml;esolevale vakantsile.</li>
 <li>Juhul,
     kui tekstide kogum ei ole imporditud, on teil v&otilde;imalik iseseisvalt
     valida testi, vajutades nupule<b> Lisada testid</b>. Juhul, kui testide
     kataloog on t&uuml;hi, vajutage nupp<b> Laadida kataloog</b>, seej&auml;rel
     laaditakse s&uuml;steemist sisse viimast aktuaalset testide kataloogi.</li>
 <li>Vajutage
     nupp m&auml;&auml;ratud testist paremat k&auml;tt ning valige punkt <b>Aktiveerimine</b>. Ilmunud aktiveerimise
     kood on vajalik kandidaadi ligip&auml;&auml;suks testimise s&uuml;steemi.</li>
</ul>
<p>Kandidaadid
saavad testimist l&auml;bida kas ettev&otilde;tte kontoris v&otilde;i kaudselt
korporatiivportaali kaudu.</p>
<ul type="disc">
 <li>Testimiseks
     ettev&otilde;tte kontoris vajutage nupp m&auml;&auml;ratud testist paremat
     k&auml;tt ning valige punkt<b> Avada Link</b>&nbsp;– avaneb testimise
     s&uuml;steemi korporatiivportaali leht sisestatud aktiveerimiskoodiga.</li>
 <li>Kaudseks
     testimiseks (v&auml;ljas) vajutage nupp m&auml;&auml;ratud testist paremat
     k&auml;tt ning valige punkt<b> Kopeerida Link</b>&nbsp;– vahetuspuhvrisse
     kopeeritakse Link testimise s&uuml;steemi korporatiivportaalile, mida
     tuleks sisestada kirja teksti ning koos aktiveerimiskoodiga saata
     kandidaadile.</li>
</ul>
<p>&nbsp;</p>
<p>Kandidaadi
poolt testi l&auml;bimise staatuse ning kogutud punktide arvu kontrollimiseks
vajutage nupp m&auml;&auml;ratud testist paremat k&auml;tt ning valige punkt<b>
Kontrollida staatust</b>.</p>
<p>&nbsp;</p></body>
</html>
