<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>Kataloogid</h1>
<p>Sektsioon
<b>Administreerimine-&gt;Kataloogid </b>sisaldab tarkvara sees kasutatavaid
katalooge. K&otilde;ikide objektide jaoks &uuml;hised kataloogid on v&auml;lja
toodud alasektsioonis<b> &Uuml;ldised</b>,&nbsp;teised, mida kasutatakse ainult
&uuml;hes v&otilde;i teises objektis (vastaspooled, vakantsid, kandidaadid)<b>&nbsp;–</b>&nbsp;eraldi
vastavates alasektsioonides.</p>
<p>Kataloogid,
s&otilde;ltuvalt vajadusest, v&otilde;ivad olla &uuml;hetasemelisteks (n&auml;iteks,&nbsp;<b>Br&auml;ndid</b>,&nbsp;<b>Kuluartiklid</b>)
v&otilde;i hierarhilisteks.</p>
<p>&Uuml;he v&otilde;i
teise kataloogi elemendi valikut t&ouml;&ouml;s tarkvaraga teostatakse
rippmen&uuml;&uuml;st v&otilde;i dialoogiaknast otsingu funktsiooniga. Iga
kataloogi elemendi valiku viisi seadistatakse ette sektsioonis<b> Administreerimine-&gt;Kataloogid
</b>tema omaduste aknas, mida kutsutakse esile hiire parema nupuga (<b>Kataloogi
omadused</b>) vabas alas v&auml;lja <b>Teksti
otsing </b>l&auml;heduses. Seal samas v&otilde;ib sisse l&uuml;litada kataloogi
elementide sortimise re&#382;iimi nende nimetuste j&auml;rgi.</p>
<ul type="disc">
 <li>Kataloogi
     uue elemendi lisamiseks vajutage nupp <b>Uus
     element</b>. Hierarhiliste kataloogide jaoks v&auml;ljas <b>Emaelement</b> m&auml;&auml;rake
     k&otilde;rgema taseme element.</li>
</ul>
<p>Kasutaja
poolt muudetud standardelemente t&auml;histatakse lahtris <b>Elemendi
t&uuml;&uuml;p</b> s&uuml;mboliga (*).&nbsp;Muudetud kataloogi elementi
p&ouml;&ouml;ramiseks tarkvara paigalduskomplektis olnud esialgsele kujule, klikkige
sellel elemendil hiire parema nupuga, valige punkt<b> Viia esialgsele kujule </b>ning j&auml;lgige tarkvara edasised juhised.</p>
<ul type="disc">
 <li>Uue
     kataloogi elemendi lisamiseks olemasoleva p&otilde;hjal, vajutage
     olemasoleva elemendi kaardil nupp<b> Fail-&gt;Luua kaardi dublikaat</b>.</li>
 <li>Kataloogi
     elemendi eemaldamiseks selekteerige see nimekirjast ning vajutades hiire
     parema nupuga valige punkt<b> Kustutada </b>v&otilde;i vajutage klahv <b>Delete </b>klaviatuuril.</li>
</ul>
<p>M&auml;rkus.
Osa kataloogide standardelemente ei ole v&otilde;imalik kustutada, kuna nad
v&otilde;ivad olla seotud kohe mitme tarkvara moodulite t&ouml;&ouml;ga
v&otilde;i vahetuse protokollidega integratsiooni korral v&auml;liste
s&uuml;steemidega v&otilde;i veebilehtedega.</p><br/>
<br/>
<p><a href="4AB390737FAB025E.htm">Üldised</a></p>
<p><a href="4AB390737FAB026F.htm">Vakantsid</a></p>
<p><a href="4AB390737FAB025F.htm">Kandidaadid</a></p>
<p><a href="4AB390737FAB0281.htm">Integratsioon</a></p>
<p><a href="4AB390737FAB0260.htm">Muud</a></p>
</body>
</html>
