<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>Vakantsete positsioonidega töö seadistamine</h1>
<p>„Massilise
otsingu“ mooduli loogikas v&otilde;ib v&auml;lja tuua m&otilde;ned vakantsidega
t&ouml;&ouml; variandid:</p>
<p><![if !supportLists]>1.&nbsp;&nbsp;&nbsp;&nbsp; <![endif]>Variant 1 (k&otilde;ige
keerulisem).<br>
Datex Recruit-sse sisestakse vakants igale vakantsele positsioonile. Kuna
selliste vakantside k&auml;sitsi sisestamine v&auml;rbaja poolt ei ole
realistlik, saab vakants olla sisestatud filiaali juhi poolt esitatud
taotlusest v&otilde;i laaditud v&auml;lisest s&uuml;steemist. Vakantsi seotakse
&uuml;ksusega ning, v&otilde;imalik, et ka ametikohaga. Kandidaadi
t&ouml;&ouml;lev&otilde;tmisel tuleks valida v&auml;lja vakantsi, millele
kandidaati v&otilde;etakse. Seega, iga suletud vakantsi osas s&auml;ilitakse
s&uuml;steemis avamise kuup&auml;eva, sulgemise kuup&auml;eva ja
vastuv&otilde;etud kandidaati ning selle informatsiooni j&auml;rgi saab
eksportida statistikat.</p>
<p><![if !supportLists]>2.&nbsp;&nbsp;&nbsp;&nbsp; <![endif]>Variant 2 (keskmine keerukusaste).<br>
Vakantside kaarte massilise otsingu jaoks ei sisestata s&uuml;steemi &uuml;ldse.
Selle asemel laaditakse Datex Recruit-sse v&auml;lisest s&uuml;steemist nii
h&otilde;ivatud, kui ka vakantsete ametikohtade nimekirja (alternatiivne
variant – vakantseid ametikohti m&auml;rgitakse filiaalide juhtide poolt eraldi
liidese kaudu). Kandidaadi t&ouml;&ouml;lev&otilde;tmisel tuleb v&auml;rbajal
valida ametikohta, millele kandidaati v&otilde;etakse.</p>
<p><![if !supportLists]>3.&nbsp;&nbsp;&nbsp;&nbsp; <![endif]>Variant 3 (k&otilde;ige lihtsam).<br>
S&uuml;steemi ei sisestata ei vakantse, ega ka ametikohti. Otsingut teostatakse
voolumeetodiga, kandidaadi t&ouml;&ouml;lev&otilde;tmisel ei m&auml;rgitsata
midagi (maksimaalselt m&auml;rgitakse filiaali, kuhu kandidaati v&otilde;etakse).
Selle variandi puudus v&otilde;rreldes kahe esimese viisiga seisneb selles, et
v&auml;rbaja ei n&auml;e millises &uuml;ksuses on otsingu hetkel olemas
reaalsed vakantsed ametikohad.</p>
<p>S&uuml;steemi
seadistamise seisukohalt erinevad need variandid peamiselt selle poolest,
millega peaks olema kandidaat seotud t&ouml;&ouml;lev&otilde;tmise hetkel – vakantsiga,
ametikohaga v&otilde;i struktuur&uuml;ksusega.</p>
<p>Iga
massilise otsingu suunda valitud variandi seadistust teostatakse sektsioonis&nbsp;<b>Administreerimine-&gt;Kataloogid-&gt;&Uuml;ldised-&gt;Otsingu
suunad</b>.</p>
<p>Massilise
otsingu vajaliku suuna jaoks:</p>
<ul type="disc">
 <li>Vakantsi
     valiku v&otilde;imalust l&uuml;litakse sisse valikuga&nbsp;<b>Siduda kandidaati</b> <b>vakantsiga
     t&ouml;&ouml;lev&otilde;tmise hetkel</b></li>
 <li>Ametikoha
     valiku v&otilde;imalust l&uuml;litakse sisse valikuga&nbsp;<b>Siduda kandidaati</b> <b>ametikohaga
     t&ouml;&ouml;lev&otilde;tmise hetkel</b> </li>
 <li>Struktuur&uuml;ksuse
     valiku v&otilde;imalust l&uuml;litakse sisse valikuga&nbsp;<b>Siduda kandidaati</b> <b>struktuur&uuml;ksusega
     t&ouml;&ouml;lev&otilde;tmise hetkel</b> </li>
</ul>
<p>S&uuml;ndmust,
mille m&auml;&auml;ramisel toimub kandidaadi sidumine (reeglina „V&otilde;etud
t&ouml;&ouml;le“),<b>&nbsp;</b>m&auml;rgitakse<b>
</b>v&auml;ljas&nbsp;<b>T&ouml;&ouml;lev&otilde;tmist
m&auml;rgistav s&uuml;ndmuse t&uuml;&uuml;p</b>.</p></body>
</html>
