<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>Kandidaatidega tööplaani koostamine</h1>
<p>V&auml;rbaja t&ouml;&ouml;plaani koostamiseks on
mugav kasutada sektsiooni<b> S&uuml;ndmused-&gt; &Uuml;lesanded.</b>&nbsp;Selles
sektsioonis kuvatakse nimekirja kohal statistilisi andmeid (&uuml;lesannete
&uuml;ldarv, l&auml;heneva t&auml;htajaga &uuml;lesannete arv, samuti ka
t&auml;htaega &uuml;letanud &uuml;lesannete arv), allpool automaatselt tekib
kandidaatide nimekiri (kiireloomulisuse kahanemise j&auml;rjekorras), keda
v&auml;rbajal on vajalik t&ouml;&ouml;delda. N&auml;iteks, olete l&auml;bi
viinud kandidaadiga t&ouml;&ouml;vestlus – vajalik on otsustada, mida temaga
edasi peale hakata –&nbsp;j&auml;tkata temaga t&ouml;&ouml;d, t&otilde;stes
teda j&auml;rgmisse etappi, v&otilde;i tagasi l&uuml;kata. Lisaks sellele,
sellesse sektsiooni sattuvad kandidaadid, kellest on „unustatud“ (Teie
v&otilde;i tellija poolt) v&otilde;i kelle osas t&ouml;&ouml; on peatatud
mingil etapil liiga pikaks perioodiks.&nbsp;Selleks on tarkvaras ette antud
staatuses olemise maksimaalne lubatud periood. See t&auml;hendab, et kui,
n&auml;iteks, peale CV juhile &uuml;levaateks saatmist ei ole viie p&auml;eva
jooksul saadud temalt tagasisidet, sattub k&auml;esolev kandidaat sellesse
sektsiooni. Kandidaadi &uuml;hes v&otilde;i teises staatuses oleku aega reguleeritakse
s&uuml;ndmuse seadistustes (v&auml;li <b>Maksimaalne
oleku aeg</b>) sektsioonis<b> Administreerimine-&gt;Kataloogid-&gt;&Uuml;ldised-&gt;S&uuml;ndmuste
t&uuml;&uuml;bid</b>.</p>
<p>Kandidaatide nimekirjaga kaasneb v&auml;rviline
indikatsioon, mis iseloomustab staatuse aegumise taset:</p>
<ul type="disc">
 <li>Kollane
     – on saabunud 1. p&auml;ev, millal kandidaat on k&auml;esolevas staatuses
     &uuml;le maksimaalselt lubatud aega;</li>
 <li>Roosa
     - on saabunud 2. v&otilde;i iga j&auml;rgmistest p&auml;evadest, millal
     kandidaat on k&auml;esolevas staatuses &uuml;le maksimaalselt lubatud
     aega. </li>
</ul>
<p>Kandidaadi staatuses olemise puhul &uuml;le
maksimaalselt lubatud aega saab kasutaja teavituse sellest sektsioonis<b> S&uuml;ndmused-&gt;Teavitused</b>.</p></body>
</html>
