<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>Integratsioon korporatiivportaaliga</h1>
<p>Datex
Recruit saab olla integreeritud korporatiivportaaliga WebTutor (juhul, kui
viimane on teie ettev&otilde;ttes paigaldatud). Integratsioon
korporatiivportaaliga avab allj&auml;rgnevaid uusi v&otilde;imalusi:</p>
<p>Korporatiivportaali
siseselt, vastavalt seadistatud dokumendivoolule ts&uuml;klile, kinnitamise l&auml;binud
personali otsingu taotluste automaatne laadimine Datex Recruit-sse.</p>
<p>Automaatne
ettev&otilde;tte ametistruktuuri andmete import. Portaaliga integratsiooni
kasutamise korral ettev&otilde;tte t&ouml;&ouml;tajate kohta andmete
laadimiseks Datex Recruit-sse, saab seadistada automaatse seose loomist
t&ouml;&ouml;lev&otilde;etud kandidaadi ning vastava t&ouml;&ouml;taja vahel, mis
lubab kiiresti liikuda nende vahel ning automaatselt muuta seotud kandidaadi
staatust t&ouml;&ouml;tajaga lepingu l&otilde;petamise korral. Vt.&nbsp;<a href="candidate_employee_auto_bind.htm">Automaatne seose
loomine kandidaadi ning t&ouml;&ouml;taja vahel</a>.</p>
<p>S&uuml;steemi
WebTutor veebiliidese kaudu testimise l&auml;binud kandidaatide testimise
tulemuste automaatne laadimine Datex Recruit-sse.</p>
<p>Oma
taotluste osas t&ouml;&ouml; staatuse j&auml;lgimine struktuur&uuml;ksuse juhi
poolt portaali veebiliidese kaudu, sealhulgas kandidaatide CV-de &uuml;levaatus,
teatud kandidaatide heakskiitmine v&otilde;i tagasil&uuml;kkamine.</p>
<p>Integratsioon
korporatiivportaaliga on v&otilde;imalik ainult Datex Recruit v&otilde;rguversiooni
jaoks limiteerimata t&ouml;&ouml;kohtade arvuga.</p>
<p>&nbsp;</p>
<p>Integratsiooni
seadistamiseks Datex Recruit poolt:</p>
<p>Sisenege
sektsiooni <b>Administreerimine-&gt;&Uuml;ldised seadistused </b>ning avage punkt<b> Personaliarvestuse
v&auml;line s&uuml;steem</b>.</p>
<p>M&auml;&auml;rake
veebiliides<b> Web-service </b>ning<b> </b>serveri,
kus on paigaldatud korporatiivportaal, nimi ning IP-aadress.</p>
<p>· 
Laaditud taotlustele antakse, reeglina, automaatselt algstaatust <b>Uus taotlus</b>. Vajadusel saab staatuse automaatset
lisamist muuta<b> T&ouml;&ouml;s </b>peale,
m&auml;&auml;rates seda v&auml;ljas <b>Staatus</b>.</p>
<p>Juhul,
kui on vajalik, et k&otilde;ik imporditud taotlused oleksid kinnistatud
&uuml;he teatud kasutajaga (grupiga), m&auml;&auml;rake v&auml;ljades Kasutaja (Grupp)
vajalikud parameetrid.&nbsp;Uute taotluste saabumise korral saadetakse m&auml;&auml;ratud
kasutajale nendest teavitusi alasektsiooni<b> S&uuml;ndmused-&gt;Teavitused</b>.</p>
<p>&nbsp;</p>
<p>V&auml;lja
<b>Viimase laadimise kuup&auml;ev</b>
v&auml;&auml;rtus m&auml;&auml;rab ajahetke, millest alates imporditakse
v&auml;lisest s&uuml;steemist t&ouml;&ouml;tajaid/vakantse tausta&uuml;lesande j&auml;rgmisel
k&auml;ivitamisel. J&auml;relikult, laaditud andmete mahu piiramise vajalikkuse
korral tuleks seda v&auml;lja t&auml;ita vajaliku alguskuup&auml;evaga. Peale
tausta&uuml;lesande edukat l&otilde;petamist t&auml;idetakse v&auml;lja automaatselt
jooksva kuup&auml;evaga.</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>Kui on
vajalik, et uute taotluste saabumise korral oleksid selle kohta saadetud
teavitused etteantud malli j&auml;rgi m&auml;&auml;ratud E-posti aadressile, saab
antud funktsiooni sisse l&uuml;litada, m&auml;&auml;rates kirja malli ning
E-posti aadressi kaardi alumises osas.</p>
<p>&nbsp;</p>
<p><i>M&auml;rkus</i>. Postiteavituste saatmise
v&otilde;imaldamiseks peab tarkvaras olema seadistatud automaatse posti
saatmise funktsioon sektsioonis <b>Administreerimine-&gt;&Uuml;ldised seadistused-&gt;Automaatne
posti saatmine.</b></p>
<p>Salvestage
ning sulgege seadistuste aken.</p>
<p>Sektsioonis&nbsp;<b>Administreerimine-&gt;&Uuml;ldised
seadistused -&gt;Korporatiivportaal</b> sisestage korporatiivse veebilehe URL.</p>
<p>Portaali
WebTutor kaudu v&otilde;i personaliarvestuse v&auml;lise s&uuml;steemi kaudu esitatud
taotluste automaatseks jaotamiseks teatud v&auml;rbajate ning gruppide vahel (s&otilde;ltuvalt
vakantsi positsioonist organisatsioonilises struktuuris)&nbsp;gruppide seadistustes
(<b>Servis-&gt;Administreerimine-&gt;Ligip&auml;&auml;s-&gt;Grupid</b>), kelle
juurde need v&auml;rbajad kuuluvad,  tuleks
m&auml;&auml;rata &uuml;ksusi, mille eest vastutab &uuml;ks v&otilde;i teine
grupp, ning vastutavat v&auml;rbajat (v&auml;li <b>V&auml;lises s&uuml;steemis</b> <b>esitatud</b>
<b>vakantside</b> <b>taotlusi
t&ouml;&ouml;tlev v&auml;rbaja</b>).</p>
<p>Sellisel
juhul seostakse m&auml;&auml;ratud ning t&uuml;tar&uuml;ksustest saabuvaid
taotlusi vastava vastutava grupi- ning v&auml;rbajaga. Lisaks sellele,
saadetakse m&auml;rgitud v&auml;rbajatele uute taotluste saabumisel teavitusi
selle kohta alasektsiooni&nbsp;<b>S&uuml;ndmused-&gt;Teavitused</b>.</p>
<p>Uute
saabunud personaliotsingu taotluste laadimiseks valige k&auml;sk <b>Vakantside
laadimine v&auml;lisest s&uuml;steemist</b> men&uuml;&uuml;st<b> Servis-&gt;Tausta&uuml;lesande
manuaalne k&auml;ivitamine</b>.</p>
<p>Laaditud
taotlused ilmuvad sektsioonis<b> Vakantsid-&gt;Uued taotlused</b>.</p>
<p>Portaalilt
taotluste impordi re&#382;iimi (manuaalset v&otilde;i automaatset) seadistatakse
sektsioonis<b> Administreerimine-&gt;Servis-&gt;Tausta&uuml;lesanded -&gt;Vakantside
laadimine v&auml;lisest s&uuml;steemist</b>. Automaatne otsingu taotluste
laadimine portaalilt on v&otilde;imalik kas igap&auml;evaselt k&auml;ivitamise
m&auml;&auml;ratud ajal v&otilde;i perioodiliselt etteantud ajavahemike
p&auml;rast.</p></body>
</html>
