<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>Töötaja (kontaktisiku) kaart</h1>
<p>T&ouml;&ouml;taja kaart Datex Recruit tarkvaras langeb
peaaegu t&auml;ielikult kokku kontaktisiku kaardiga. Kontaktisik muutub
t&ouml;&ouml;tajaks lipu <b>Oma t&ouml;&ouml;taja</b>
sisse l&uuml;litamisel kaardi vasakus osas. Kaardil on allj&auml;rgnev
struktuur:</p>
<p>Sektsioon <b>&Uuml;ldandmed</b>:</p>
<p><b>Number:</b>&nbsp;t&ouml;&ouml;taja sisemine (tabeli)
number. Numbrit t&auml;idetakse automaatselt tarkvara poolt, siiski on teil
v&otilde;imalik seda k&auml;sitsi &auml;ra parandada. Juhul, kui Teile ei sobi tarkvara
poolt pakutav numeratsiooni viis, saate seda &auml;ra muuta sektsioonis<b> Administreerimine-&gt;Objektid</b>.</p>
<p><a name="_Hlk491718791"><b>Perekonnanimi, eesnimi</b></a>: T&ouml;&ouml;taja perekonnanimi ja eesnimi.</p>
<p><b>Sugu</b>: Tarkvara sisemisse nimede
kataloogi kuuluva nime sisestamise puhul t&auml;idetakse v&auml;lja
automaatselt.</p>
<p><b>S&uuml;nniaeg</b>: T&ouml;&ouml;taja s&uuml;nniaeg.</p>
<p><b>T&ouml;&ouml;telefon, Mobiiltelefon</b>: T&ouml;&ouml;taja
t&ouml;&ouml;- ning mobiiltelefon. Peale sisestamist kontrollib tarkvara
sisestatud mobiiltelefoni numbri formaadi &otilde;igsust (vaikimisi). Vajadusel
saab valikut sisse l&uuml;litada ka teiste telefoninumbrite kontrollimiseks
sektsioonis<b> Administreerimine-&gt;&Uuml;ldised seadistused -&gt;Regionaalsed
seadistused.</b></p>
<p>Tarkvara telefoni v&otilde;i Skype&acute;i kasutajad
saavad helistada m&auml;rgitud telefonile vajutades telefoni t&auml;hisega
pildile selle v&auml;lja kohal ning valides k&auml;sku <b>Helistada</b>. Lisaks
sellele, juhul kui Datex Recruit on integreeritud SMS-pordiga, saavad kasutajad
analoogselt saata ka SMS mobiilidele kasutades eelnevalt ette valmistatuid
malle v&otilde;i k&auml;sitsi, valides k&auml;sku <b>Saada</b> <b>SMS</b>&nbsp;ning sisestades vajalikku teksti. SMS mallide
lisamiseks kasutatakse sektsiooni<b> Administreerimine-&gt;Kataloogid-&gt;SMS
mallid</b>.</p>
<p><b>E-post</b>: t&ouml;&ouml;taja peamine
elektroonposti aadress (reeglina t&ouml;&ouml; oma)</p>
<p><b>E-post 2</b>: t&ouml;&ouml;taja t&auml;iendav
elektroonposti aadress (reeglina isiklik). Antud aadressi ei kasutata
postitusteks ning teavituste saatmiseks, vaid, reeglina, h&auml;daolukorras
t&ouml;&ouml;tajaga &uuml;henduse saamiseks v&otilde;i t&ouml;&ouml;tajaga
kontaktiks peale t&ouml;&ouml;lepingu l&otilde;petamist.</p>
<p><b>Skype</b>: t&ouml;&ouml;taja Skype konto kasutajanimi.</p>
<p><b>Struktuur&uuml;ksus</b> (<b>Organisatsioon </b>– kontaktisikute jaoks): Viide
struktuur&uuml;ksusele (organisatsioonile), kus t&ouml;&ouml;taja
t&ouml;&ouml;l on.</p>
<p><b>Ametinimetus</b>: T&ouml;&ouml;taja ametinimetus.
See v&auml;li v&otilde;ib sisaldada nii suvalist teksti, kui ka viidet
objektile <b>Ametikoht</b>, s&otilde;ltuvalt
seadistustest sektsioonis<b> Administreerimine-&gt;&Uuml;ldised seadistused -&gt;Ametistruktuur</b>.</p>
<p><b>&Uuml;ksuse juht</b> (personaliteenistuste jaoks): Lipp,
mis m&auml;rgistab, et antud struktuur&uuml;ksuse t&ouml;&ouml;taja on selle
&uuml;ksuse juht. Lisaks, juhul kui andmebaasis on struktuur&uuml;ksuses enam
kui &uuml;ks t&ouml;&ouml;taja,&nbsp; m&auml;&auml;rab lipp antud
t&ouml;&ouml;tajat automaatseks sisestamiseks kontaktisikute nimekirja selle
struktuur&uuml;ksuse m&auml;rgistamisel vakantsi kaardil. Juhul, kui
sektsioonis<b> Administreerimine-&gt;&Uuml;ldised seadistused -&gt;Ametistruktuur</b>
on sisse l&uuml;litatud valik <b>N&otilde;uda
t&ouml;&ouml;taja kohustuslikku sidumist ametikohaga</b>, kopeeritakse selle lipu v&auml;&auml;rtust
ametikohast, millele see t&ouml;&ouml;taja kuulub.</p>
<p><b>Peamine kontaktisik</b> (kontaktisikute jaoks): Lipp,
mis t&auml;hendab, et antud isik on v&otilde;tmeisikuks organisatsioonis,
millele ta kuulub. Lisaks, juhul kui andmebaasis on organisatsioonis enam kui
&uuml;ks kontaktisik,&nbsp;m&auml;rgistab lipp antud isikut automaatseks
sisestamiseks kontaktisikute nimekirja selle organisatsiooni kliendina
m&auml;rkimisel vakantsi kaardil (personaliotsingu agentuuride jaoks). Juhul,
kui side kontaktisikuga oli &auml;ra kaotatud, moodustatakse kontaktisikute
nimekirja organisatsiooni alles j&auml;&auml;nud aktiivsete isikute koosseisust.</p>
<p><b>Hindav isik t&ouml;&ouml;tajate otsingu puhul </b>(personaliteenistuste jaoks; ilmub
valiku <b>Kasutada valikut „Hindav juht“ iga t&ouml;&ouml;taja jaoks </b>sisse l&uuml;litamisel<b> </b>sektsioonis
<b>Administreerimine-&gt;&Uuml;ldised seadistused -&gt;Ametistruktuur</b>): Lipp, mis
t&auml;hendab, et antud t&ouml;&ouml;taja oli nimetatud tulevate kandidaatide
hindajaks, ehk teiste s&otilde;nadega, temast saab tellija, nii nagu ka juht (v&otilde;i
tema asemel - sisse l&uuml;litatud valiku <b>Lugeda
&uuml;ksuse juhti hindavaks juhiks ainult sisse l&uuml;litatud valikul „Hindav juht“</b>&nbsp;puhul sektsioonis
<b>Administreerimine-&gt;&Uuml;ldised seadistused -&gt;Ametistruktuur</b>). Sellisel
juhul struktuur&uuml;ksuse valikul vakantsi kaardil, laaditakse neid tellijaid
automaatselt kontaktisikutena.</p>
<p><b>Rollid</b>&nbsp;(kontaktisikute jaoks): lippude
lisakomplekt kontaktisiku rolli m&auml;&auml;ramiseks m&auml;rgitud organisatsioonis.</p>
<p><b>Riik:</b>&nbsp;f&uuml;&uuml;silise isiku
t&ouml;&ouml;koha riik (valik nimekirjast). Kasutatakse juhul, kui
ettev&otilde;ttel on olemas tegevus mitmes riigis.</p>
<p><b>Side on &auml;ra kaotatud</b> (kontaktisikute jaoks): Lipp,
mis m&auml;rgistab, et vastaspoole kontaktisikuga on koost&ouml;&ouml;
l&otilde;petatud (n&auml;iteks temaga lepingu l&otilde;petamise t&otilde;ttu). Andmebaasi
objekt muutub mitteaktiivseks ning m&auml;rgistatakse loetelus halli pildiga.</p>
<p><b>Lisaandmed</b>: suvaline lisainfo.</p>
<p>&nbsp;</p>
<p>Sektsioon <b>Lisaandmed</b>:</p>
<p><b>Regioon:&nbsp;</b>T&ouml;&ouml;taja
t&ouml;&ouml;koha<b> </b>regioon (valik loetelust). Kasutatakse juhul, kui
ettev&otilde;ttel on olemas tegevus mitmes regioonis.</p>
<p><b>Alukoha aadress</b>: T&ouml;&ouml;taja elukoha
aadress.</p>
<p><b>Perekondlik seis</b>: T&ouml;&ouml;taja perekondlik
seis (valik loetelust)</p>
<p><b>Lapsed</b>: Laste arv.</p>
<p><b>Haridus</b>: T&ouml;&ouml;taja haridustase (valik
nimekirjast).</p>
<p><b>T&ouml;&ouml;lev&otilde;tmise kuup&auml;ev</b>: T&ouml;&ouml;taja
organisatsiooni t&ouml;&ouml;lev&otilde;tmise kuup&auml;ev.</p>
<p><b>T&ouml;&ouml;lepingu l&otilde;petamise kuup&auml;ev</b>: T&ouml;&ouml;lepingu
l&otilde;petamise kuup&auml;ev (t&ouml;&ouml;tajate jaoks, kellega
t&ouml;&ouml;leping on l&otilde;petatud). Juhul, kui on m&auml;rgitud t&ouml;&ouml;lepingu
l&otilde;petamise kuup&auml;ev ning selle v&auml;&auml;rtus on jooksvast
kuup&auml;evast v&auml;iksem, m&auml;rgistatakse t&ouml;&ouml;tajat nimekirjas
halli pildiga.</p>
<p><b>T&ouml;&ouml;taja staatus</b>: T&ouml;&ouml;taja jooksev
staatus (v&auml;&auml;rtus kataloogist).</p>
<p><b>V&auml;line ID</b>: Juhul, kui t&ouml;&ouml;taja
oli imporditud korporatiivportaalist v&otilde;i v&auml;lisest
personaliarvestuse s&uuml;steemist, sisaldab antud v&auml;li vastava objekti
identifikaatori v&auml;lises s&uuml;steemis.</p>
<p><b>Windows nimi</b>: t&ouml;&ouml;taja Windows nimi (Active
Directory kasutajana) ligip&auml;&auml;su tagamiseks veebiliidese kaudu.</p>
<p>&nbsp;</p>
<p>Sektsioon <b>T&ouml;&ouml;kohad</b>
sisaldab t&ouml;&ouml;taja eelnevate t&ouml;&ouml;kohtade nimekirja koos
t&ouml;&ouml;perioodi ning ametikoha andmetega.</p></body>
</html>
