<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>Üksikkasutaja versiooni paigaldus</h1>
<ul type="disc">
 <li>K&auml;ivitage
     distributiivist fail <b>DatexRecruit.exe</b>. Avaneb dialoogi aken
     paigalduse kinnitamiseks. Vajutage nupp <b>Edasi</b>.</li>
 <li>Avaneb
     dialoogi aken, mis pakub sisestada Teie tarkvara koopia seerianumbrit. Sisestage
     seerianumber (neli s&uuml;mbolit igas v&auml;ljas) ning vajutage nupp <b>Edasi</b>.</li>
 <li>Avaneb
     dialoogi aken, mis pakub m&auml;&auml;rata kataloogi, kuhu paigaldatakse tarkvara
     Datex Recruit (vaikimisi m&auml;&auml;ratakse soovitatav kataloog). Vajutage
     nupp <b>Edasi</b>.</li>
 <li>Avaneb
     dialoogi aken, mis pakub valida v&auml;liseid tarkvarasid, mille jaoks teostatakse
     paigalduse protsessi raames CV impordi mooduli registreerimist, mis lubab
     kasutajal kiiresti &uuml;le viia kandidaadi CV-s sisaldavaid andmeid Datex
     Recruit s&uuml;steemi. Valige vajalikud tarkvarad ning vajutage nupp <b>Paigaldus</b>.</li>
 <li>K&auml;ivitage
     tarkvara paigalduse protsess, mis reeglina v&otilde;tab kuni minut aega. Peale
     tarkvara paigalduse l&otilde;pust teavitava dialoogi akna ilmumist
     vajutage nupp <b>Valmis</b>.</li>
</ul>
<p>Teie arvuti t&ouml;&ouml;laual, samuti ka
men&uuml;&uuml;s Start/Tarkvarad (Start/Programs) ilmub ikoon&nbsp;<b>Datex
Recruit</b>.</p>
<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; K&auml;ivitage
tarkvara Datex Recruit t&ouml;&ouml;laual v&otilde;i men&uuml;&uuml;s Start/Tarkvarad
(Start/Programs) asuva ikooni abil.</p>
<p>Avaneb dialoogi aken, mis pakub aktiveerida Teie tarkvara
koopiat t&ouml;&ouml;ks sellel arvutil. Juhul, kui Teie arvutil on olemas
Interneti &uuml;hendus, valige aktiveerimise automaatset viisi Interneti kaudu ning
vajutage <b>OK</b>.</p>
<p>Juhul kui Interneti &uuml;hendus puudub, valige
manuaalset aktiveerimise viisi.</p>
<p>Juhul, kui tarkvara paigaldatakse esmakordselt, k&auml;ivitub
peale aktiveerimise l&otilde;ppu <b>Datex Recruit</b><b> esialgse konfiguratsiooni Master </b>esialgsete
seadistuste teostamiseks, mis lubab m&auml;&auml;rata j&auml;rgmiseid parameetreid:</p>
<ul type="disc">
 <li>Kasutamise
     poliitika: ettev&otilde;tte personaliteenistus v&otilde;i personaliotsingu
     agentuur</li>
 <li>T&ouml;&ouml;
     poliitika ettev&otilde;tte ametistruktuuriga (personaliteenistuste jaoks)</li>
 <li>Regionaalsed
     seadistused: riigi ja p&otilde;hilise valuuta valik (palgatase
     salvestamise jaoks)</li>
 <li>Vajalike
     regioonide valik ja import kataloogist</li>
</ul>
<p>Hiljem v&otilde;ib mainitud parameetrid muuta sektsioonides
<b>Administreerimine-&gt;&Uuml;ldised seadistused </b>ja<b> Administreerimine-&gt;Kataloogid</b>-<b>&gt;&Uuml;ldised</b>-&gt;<b>Regioonid</b>.</p></body>
</html>
