<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>CV-de pakettimport postkastidest</h1>
<p>Datex Recruit tarkvara lubab automaatselt importida
e-postiga saabuvad CV-d. Siinjuures, t&ouml;&ouml;deldakse nii kirja sisus
olevad CV-d, kui ka lisatud Microsoft Word v&otilde;i OpenOffice failidena. &Uuml;lej&auml;&auml;nud
lisatud faile sisestatakse kandidaadi kaardile manustena.</p>
<p>Olemasolevate postirakenduste mitmekesisuse
t&otilde;ttu, n&otilde;uab import postkastidest reeglina lisaseadistamist (vt. sektsioon
<b>CV impordi allikad</b>). Seadistus ei
saa alati olla teostatud kasutaja poolt iseseisvalt – osa juhtudel tuleks teil
p&ouml;&ouml;rata teie s&uuml;steemadministraatori poole. Seadistuse
teostamiseks kasutatakse sektsiooni<b> Administreerimine-&gt;Kataloogid-&gt;Kandidaadid-&gt;</b>
<b>CV impordi allikad</b>). Iga postkasti jaoks, kust impordi
teostatakse, tuleb luua eraldi impordi allikat.</p>
<p>Rakendus v&otilde;ib olla seadistatud mitmele
t&ouml;&ouml;re&#382;iimile vastavalt sellele, kas t&ouml;&ouml;deldav postkast
on eraldi kaustaks sissetulevate CV-de jaoks v&otilde;i kaustaks, mida
sealhulgas kasutatakse ka personaliotsingu eest vastutava t&ouml;&ouml;taja
&auml;rikorrespondentsi jaoks. Rakendus suudab, n&auml;iteks, k&otilde;rge
t&otilde;en&auml;osuse astmega eristada CV-d sisaldava kirja igasugusest
teisest kirjast.</p>
<p>Rakenduse standardsed seadistused teostavad
allj&auml;rgnevat postkastist impordi stsenaariumit:</p>
<ul type="disc">
 <li>Rakendus
     teeb postkasti lahti ning vaatab l&auml;bi k&otilde;iki lugemata kirju.</li>
 <li>Kui
     rakendus tegi selgeks, et kiri sisaldab CV-d, siis CV koos kirja esialgse
     tekstiga imporditakse vahepealsesse nimekirja ning kirja
     m&auml;rgistatakse postkastis &auml;ra loetud kirjana.</li>
 <li>Juhul,
     kui rakendus tegi selgeks, et kiri CV-d ei sisalda, j&auml;&auml;b kiri
     alles postkasti esialgsel kujul.</li>
</ul>
<p>&nbsp;</p>
<ul type="disc">
 <li>Kandidaatide
     impordi teostamiseks postkastist minge &uuml;le vastavale kastile
     sektsioonis <b>CV import</b>&nbsp;rakenduse
     peaakna vasakus osas.</li>
</ul>
<ul type="disc">
 <li>CV-de
     impordi protsessi alustamiseks vajutage nupp <b>Importida</b>.</li>
</ul>
<p>Rakendus k&auml;ivitab postkastist CV-de
t&ouml;&ouml;tlemise protsessi. Laadimise k&auml;igus saadud CV-d kuvatakse nimekirjas
ekraani &uuml;lemises osas.</p>
<p>&Uuml;he kirja t&ouml;&ouml;tlemine (s&otilde;ltumata
sellest, kas selles kirjas on avastatud CV v&otilde;i mitte) v&otilde;ib
v&otilde;tta kahest kuni viie sekundini s&otilde;ltuvalt teie arvuti kiirusest.
Impordi k&auml;igus on Teil v&otilde;imalik minna teistele lehek&uuml;lgedele
ning j&auml;tkata t&ouml;&ouml;d rakendusega.</p>
<ul type="disc">
 <li>Alla
     laaditud CV vaatlemiseks valige vastav rida &uuml;lemises nimekirjas.</li>
</ul>
<p>Siinjuures, kuvatakse ekraani alumises osas kirja
teksti ning k&otilde;ik lisatud CV-d eraldi vahekaartidel.</p>
<p>Imporditud kirja tekst asub ajutises andmebaasis
ning ei ole veel sisestatud kandidaatide p&otilde;hiandmebaasi. Teil on
v&otilde;imalik kas valida seda kandidaatide andmebaasi v&otilde;i &auml;ra
kustutada.  Seda toimingut v&otilde;ib teostada
nii iga kirja jaoks eraldi, p&otilde;gusalt l&auml;bi vaadates selle sisu, kui
ka kui ka mitme kirja jaoks korraga. Mitu kirja saab korraga valida nimekirjast
vajutades klahvidele Shift v&otilde;i Ctrl. </p>
<ul type="disc">
 <li>CV
     t&otilde;stmiseks &uuml;ldisse andmebaasi valige CV nimekirjas, vajutage
     sellele hiire parema nupuga, seej&auml;rel valige vastav toiming loetelust.</li>
 <li>CV
     kustutamiseks vajutage klahv Delete klaviatuuril.</li>
</ul>
<p>Juhul, kui laaditud kirjade teemas on olemas
eeldatava vakantsi number mingisuguse prefiksiga (n&auml;iteks, VAC-0015), siis
valides sisestamise viisi<b> Lisada </b><b>andmebaasi ning valida eeldatavale vakantsile</b>
lisatakse CV-d andmebaasi automaatse valikuga m&auml;&auml;ratud vakantsile. Prefiksi
seadistamiseks kasutage sektsioon <b>Administreerimine-&gt;&Uuml;ldised seadistused-&gt;</b>
<b>CV tuvastamine</b>.</p></body>
</html>
