<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>CV-de pakettimport Microsoft Word, OpenOffice või Adobe Reader dokumentidest</h1>
<p>Juhul, kui Teie kettas asub piisavalt suur maht
kandidaatide CV-d formaadis Microsoft Word, OpenOffice v&otilde;i Adobe Reader,
on Teil v&otilde;imalik kasutada CV-de pakettimporti funktsiooni. Rakenduse
t&ouml;&ouml; tulemus j&auml;&auml;b seejuures samasuguseks, kui eelnevas
l&otilde;igus kirjeldatud &uuml;ksikimpordi puhul, kuid antud juhul ei pea Teie
valima igat faili eraldi – tarkvara t&ouml;&ouml;tleb k&otilde;iki faile
iseseisvalt Teie poolt m&auml;&auml;ratud kataloogis.</p>
<ul type="disc">
 <li>Rakenduse
     seadistamiseks CV-de impordiks kettas asuvast kaustast avage sektsioon<b> Administreerimine-&gt;Kataloogid-&gt;Kandidaadid-&gt;</b>
     <b>CV impordi allikad </b>ning
     vajutage nupp <b>Uus element</b>.</li>
 <li>Sisestage
     suvalise allika nimetus (n&auml;iteks &quot;Kaust 1&quot;).</li>
 <li>V&auml;ljas
     <b>Allika t&uuml;&uuml;p</b> valige <b>Kaust kettas</b>.</li>
 <li>M&auml;&auml;rake
     CV-d sisaldava kausta t&auml;isaadress v&auml;ljas <b>Algkaust </b>v&otilde;i
     valige kaust vajutades nuppu <b>&Uuml;levaade</b>. Paigutage lipp <b>Kaasaarvatud
     lisatud kaustad</b>, juhul kui Te soovite, et tarkvara t&ouml;&ouml;tleks
     samuti ka k&otilde;iki katalooge valitud kausta sees.</li>
 <li>Juhul,
     kui olete kindel, et valitud kaust sisaldab ainult CV-dega faile, m&auml;&auml;rake
     null <b>CV kontrolli taset</b>.</li>
 <li>Lipp&nbsp;<b>Tuvastada
     eriala kausta nimetuse j&auml;rgi </b>lubab<b> </b>automaatselt<b> </b>m&auml;&auml;rata
     imporditavatele kandidaatidele eriala vastavalt CV-d sisaldava kausta
     nimetusele. Selle funktsiooni t&ouml;&ouml; jaoks on olemas kohustuslik
     tingimus – kausta nimetus peab &uuml;htima eriala nimetusega Datex Recruit
     erialade kataloogist (<b>Administreerimine-&gt; Kataloogid-&gt; &Uuml;ldised-&gt;
     Erialad</b>).</li>
 <li>Vajutage&nbsp;<b>Salvestada ja sulgeda</b>.</li>
</ul>
<p>&nbsp;</p>
<ul type="disc">
 <li>CV-de
     impordi teostamiseks kaustast minge vastavale allikale sektsioonis&nbsp;<b>CV import</b> tarkvara peaakna vasakus
     osas.</li>
</ul>
<ul type="disc">
 <li>CV-de
     impordi protsessi alustamiseks vajutage nupp <b>Laadida</b>.</li>
</ul>
<p>Rakendus k&auml;ivitab kaustast CV-de
t&ouml;&ouml;tlemise protsessi. Siinjuures, hakkavad impordi k&auml;igus tuvastatud
CV-d ilmuma ekraani &uuml;lemisse ossa.</p>
<p>&Uuml;he faili t&ouml;&ouml;tlemine (s&otilde;ltumata
sellest, kas antud failis on tuvastatud CV v&otilde;i mitte) v&otilde;ib
v&otilde;tta kahest kuni viie sekundini s&otilde;ltuvalt Teie arvuti kiirusest.
Laadimise k&auml;igus on Teil v&otilde;imalik minna teistele lehek&uuml;lgedele
ning j&auml;tkata t&ouml;&ouml;d rakendusega.</p>
<ul type="disc">
 <li>Alla
     laaditud CV &uuml;levaateks valige vastav rida &uuml;lemises nimekirjas.</li>
</ul>
<p>Ekraani alumises osas kuvatakse seejuures imporditud
CV teksti.</p>
<p>Laaditud CV asub ajutises andmebaasis ning ei ole
veel sisestatud kandidaatide p&otilde;hiandmebaasi. Teil on v&otilde;imalik
seda kas valida kandidaatide baasi v&otilde;i &auml;ra kustutada. Seda
operatsiooni v&otilde;ite teha nii iga CV jaoks eraldi, p&otilde;gusalt
vaadates l&auml;bi selle sisu, kui ka mitme CV jaoks korraga. Mitu CV-d saab
korraga nimekirjast valida vajutades klahvidele Shift v&otilde;i Ctrl.</p>
<ul type="disc">
 <li>CV
     t&otilde;stmiseks &uuml;ldisse andmebaasi valige CV nimekirjast, vajutage
     sellele hiire parema nupuga, seej&auml;rel valige vastav toiming loetelust.</li>
 <li>CV
     kustutamiseks vajutage klahv Delete klaviatuuril.</li>
</ul></body>
</html>
