<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>Kandidaadi kaart</h1>
<p>Kandidaadi kaart Datex Recruit rakenduses omab
allj&auml;rgnevat struktuuri:</p>
<p>Kaardi vasakus nurgas asub kaardi <b>sektsiooni
sisu</b> puu vormis. Vajutades hiirega puu elementidele on Teil v&otilde;imalik
liikuda kaardi sektsioonide vahel, mis ilmuvad akna paremas osas.</p>
<p>Sisu all asub <b>toimingute (s&uuml;ndmuste)
nimekiri</b>, mida v&otilde;ib ette v&otilde;tta kandidaadi suhtes. Igast
tegevusest vasakut k&auml;tt v&otilde;ib asuda &uuml;ks j&auml;rgmistest
m&auml;rkidest:<br>
<b>!</b>&nbsp;– toiming on planeeritud<br>
<b>+</b>&nbsp;- toiming on toimunud<br>
<b>*</b>&nbsp;- toiming on t&auml;itmise protsessis <br>
<b>x</b>&nbsp;– toiming ei toimunud</p>
<p>Loetelus kuvatakse k&otilde;ige tihedamalt
kasutatavaid toiminguid. &Uuml;lej&auml;&auml;nud toimingute esile kutsumiseks
tuleb vajutada nuppu&nbsp;<b>&quot;...&quot;</b>&nbsp;(&Uuml;lej&auml;&auml;nud
toimingud) toimingute loetelu all.</p>
<p>Allpool asuvad m&otilde;ned teised kaardi
lisaatribuudid:</p>
<ul type="disc">
 <li>Kandidaadi<b> </b>andmebaasi<b> Sisestamise viis</b> ning&nbsp;kandidaadi
     laekumise <b>Allikas </b>(t&auml;iendav info vt. all
     Sektsiooni <b>Lisaandmed</b>).</li>
 <li><b>V&auml;rbaja/Grupp</b>:
     Datex Recruit kasutaja, kelle juurde kuulub antud kandidaat ning vastav
     grupp.</li>
 <li>Kaardi
     loomise kuup&auml;ev ning selle viimase muutmise kuup&auml;ev. Rakenduse
     versioonis mitme kasutaja jaoks kuvatakse samuti ka kaardi loonud kasutaja
     nimi ning viimati kaardi andmeid muutnud kasutaja nimi.</li>
</ul>
<p>Kaardi paremas (p&otilde;hilises) osas asub,
s&otilde;ltuvalt kasutaja valikust, allj&auml;rgnevate sektsioonide sisu:</p>
<p>&nbsp;</p>
<p>Sektsioon <b>&Uuml;ldised
andmed:</b></p>
<p><b>Number:</b>&nbsp;Sisemist numbrit sisestatakse
tarkvara poolt automaatselt, siiski on Teil v&otilde;imalik muuta seda ka k&auml;sitsi.
Juhul, kui Teile ei sobi rakenduse poolt pakutav kandidaatide numeratsiooni
viis, v&otilde;ite seda muuta sektsioonis <b>Administreerimine-&gt;Objektid-&gt;Kandidaat</b>).</p>
<p><b>Perekonnanimi, eesnimi</b>: Kandidaadi perekonnanimi, ja
eesnimi. </p>
<p><b>Sugu</b>: Kandidaadi sugu. Tarkvarasisese
nimede kataloogi kuuluva nime sisestamise korral t&auml;idetakse v&auml;lja
automaatselt.</p>
<p><b>S&uuml;nnip&auml;ev</b>: Kandidaadi s&uuml;nnip&auml;ev.</p>
<p><b>Mobiiltelefon, Muu telefon</b>: Kandidaadi mobiil ning
alternatiivne (lisa mobiiltelefon v&otilde;i kodutelefon) telefon. Peale
sisestamist kontrollib rakendus sisestatud mobiiltelefoni formaati (vaikimisi).
Vajadusel saab antud valikut sisse l&uuml;litada ka teiste telefoninumbrite
kontrollimiseks sektsioonis<b> Administreerimine -&gt;&Uuml;ldised seadistused -&gt;Regionaalsed
seadistused.</b></p>
<p>Tarkvaratelefoni v&otilde;i Skype k&otilde;nesid
kasutavad kasutajad saavad helistada m&auml;rgitud numbrile vajutades telefoni
pildiga m&auml;rgile selle v&auml;lja kohal ning valides k&auml;sku <b>Helistada</b>. Lisaks sellele, Datex
Recruit integratsiooni korral SMS-pordiga saavad kasutajad analoogselt saata SMS
mobiilstelefoni numbrile eelnevalt ettevalmistatud malli j&auml;rgi v&otilde;i
k&auml;sitsi valides k&auml;sku <b>Saata SMS</b>&nbsp;ning sisestades vajalikku
teksti. SMS mallide lisamiseks kasutatakse sektsiooni<b> Administreerimine-&gt;Kataloogid-&gt;
SMS mallid</b>.</p>
<p><b>T&ouml;&ouml;telefon</b>: Kandidaadi t&ouml;&ouml;telefon.
Kaardi lisav&auml;li, mida vajadusel v&otilde;ib sisse l&uuml;litada
sektsioonis<b> Administreerimine-&gt;&Uuml;ldised seadistused -&gt;Kaardiv&auml;ljade
haldus</b>.</p>
<p><b>E-post</b>: kandidaadi p&otilde;hiline
e-posti aadress (reeglina isiklik).</p>
<p><b>E-post 2</b>: kandidaadi lisa e-posti aadress.
Antud aadress ei osale postitustes ning teavituste v&auml;ljasaatmistes.</p>
<p><b>Skype</b>: kandidaadi Skype konto kasutajanimi.</p>
<p><b>Elukoht</b>: Kandidaadi tegelik elukoha
aadress.</p>
<p><b>Riik:</b>&nbsp;Kandidaadi eeldatava
t&ouml;&ouml;h&otilde;ive riik (v&auml;&auml;rtus kataloogist). Kandidaadi sisestamisel
andmebaasi t&auml;idetakse v&auml;lja reeglina automaatselt
t&ouml;&ouml;otsingu regiooni alusel.</p>
<p><b>T&ouml;&ouml;otsingu regioon</b>: T&ouml;&ouml;h&otilde;ive
eeldatav regioon (v&auml;&auml;rtus kataloogist). Kandidaadi sisestamisel andmebaasi
t&auml;idetakse v&auml;lja reeglina automaatselt. Erandjuhtumitel v&otilde;ib
olla t&auml;idetud elukoha regiooniga, juhul kui kandidaadi CV-s oli elukoha
aadress m&auml;rgitud. &Uuml;ldjuhul, ei pruugi t&ouml;&ouml;otsingu regioon
tegeliku elukoha regiooniga &uuml;htima.</p>
<p><b>Haridus</b>: Kandidaadi haridustase (v&auml;&auml;rtus
kataloogist).</p>
<p><b>Eeldatav ametikoht</b>: Ametikoha nimetus, millele
kandidaat pretendeerib.  Nimetust valib
reeglina kandidaat ise ning t&auml;idetakse automaatselt Internetist leitud
v&otilde;i vakantsile vastustest laaditud CV-de puhul.</p>
<p><b>Palgatase</b>: Kandidaadi soovitav palgatase.</p>
<p><b>Teenistusaeg</b>: Kandidaadi erialane
t&ouml;&ouml;kogemus (aastate arv).</p>
<p><b>Eriala</b>: Eriala objektide klassifikaator
(v&auml;&auml;rtus kataloogist). Vaikimisi kasutab tarkvara erialade
kahetasemelist kataloogi, mida tarnitakse koos rakendusega. Teil on
v&otilde;imalik redigeerida standardset erialade kataloogi sektsioonis<b> Administreerimine-&gt;Kataloogid-&gt;Erialad</b>)
v&otilde;i importida neid sisse ettevalmistatud MS Excel formaadi failist.</p>
<p><b>Reiting</b>: Kandidaadile antud reiting. V&otilde;ib
olla arvutatud automaatselt hindamisvormide kasutamise puhul v&otilde;i olla
k&auml;sitsi t&auml;idetud.</p>
<p><b>V&auml;ljad Perekonnanimi</b>,&nbsp;<b>Nimi</b>,<b> Sugu</b>,&nbsp;<b>S&uuml;nniaeg</b>,&nbsp;<b>Elukoha</b> a<b>adress</b>,&nbsp;<b>Telefonid
(mobiil, alternatiivne),</b>&nbsp;<b>E-post (E-post 2), Skype, Palgatase,
Teenistusaeg, Riik, Kodakondsus </b>t&auml;idetakse,
reeglina,<b> </b>automaatselt&nbsp;impordi k&auml;igus CV-st saadud
andmetega. Kandidaadi kaardi k&auml;sitsi loomisel tuleb Teil neid v&auml;lju
t&auml;ita iseseisvalt.</p>
<p><b>Vaadeldakse vakantsidele</b>: Vakantside nimekiri, millele
kandidaat on valitud (vaadeldakse). </p>
<p>&nbsp;</p>
<p>Sektsiooni <b>&Uuml;ldised
andmed </b>alumises osas kuvatakse kandidaadi CV-d esialgsel kujul. Vajadusel
on Teil v&otilde;imalik teha esialgsesse CV-sse parandusi. On v&otilde;imalik CV-de
suvalise arvu lisamine (samuti ka k&otilde;ikide muude dokumentide lisamine
kandidaadi kaardile) nupuga &quot;klamber&quot; kaardi instrumentide ribal. Kusjuures,
viimast lisatud CV-d eristatakse v&auml;rviga ning k&otilde;ikide CV-de jaoks
on m&auml;rgitud nende lisamise aeg. K&otilde;ik lisatud dokumendid on kuvatud
kandidaadi kaardi vasakus osas puu sektsioonis Lisad.</p>
<p>Uue dokumendi lisamiseks vajutage nupp „klamber“
instrumentide ribal kaardi &uuml;lemises osas, seej&auml;rel sisestage
dokumendi tekst v&otilde;i laadige selle Microsoft Word v&otilde;i OpenOffice
dokumendist. Sektsioonis <b>&Uuml;ldised
andmed</b> kuvatakse CV-d, mis on j&auml;rjestuses esimene.</p>
<p>&nbsp;</p>
<p>Sektsioon <b>Lisaandmed</b>:</p>
<p><b>Perekondlik seis</b>: Kandidaadi perekondlik seis (v&auml;&auml;rtus
kataloogist).</p>
<p><b>Lapsed</b>: Laste arv perekonnas.</p>
<p><b>Kodakondsus</b>: Kandidaadi kodakondsus – passi
v&auml;lja andnud riigi nimetus (v&auml;&auml;rtus kataloogist).</p>
<p><b>Sisestamise viis</b>: Kandidaadi andmebaasi
sisestamise viis (v&auml;&auml;rtus kataloogist). V&auml;li on reeglina
automaatselt t&auml;idetav kandidaadi CV impordi k&auml;igus
t&ouml;&ouml;otsingu portaalilt ning erineb juhtumite korral, kui kandidaat oli
sisestatud andmebaasi rakendusse laaditud vastustest ning juhul, kui kandidaat
oli leitud brauserist aktiivse otsingu abil.</p>
<p><b>Laekumise allikas</b>: Kandidaadi laekumise allikas (v&auml;&auml;rtus
kataloogist). V&auml;li on reeglina automaatselt t&auml;itetud kandidaadi CV
impordi k&auml;igus t&ouml;&ouml;otsingu portaalililt.</p>
<p><b>Kandidaati soovitanud isik</b>: Isik (viide objektile&nbsp;<b>F&uuml;&uuml;siline isik)</b>, kelle soovitusel vaadeldakse
antud kandidaati.</p>
<p><b>Ettev&otilde;te-doonor</b>: Viide objektile&nbsp;<b>Organisatsioon</b> (ettev&otilde;te-konkurent),
kust on k&auml;esolev kandidaat tulnud. Manuaalsel valikul moodustatakse
nimekirja tunnusega “Konkurent”.</p>
<p>Juhul, kui CV impordil veebilehelt, mille jaoks
eelnevate t&ouml;&ouml;kohtade laadimine on toetatud (sektsioon “T&ouml;&ouml;kohad
” kandidaadi kaardil), ettev&otilde;tte nimetus kronoloogiliselt viimases
t&ouml;&ouml;kohas osutub t&auml;idetuks, siis v&auml;lja <b>Ettev&otilde;te-doonor</b>&nbsp;t&auml;idetakse automaatselt tingimusel,
et kasv&otilde;i &uuml;ks ettev&otilde;tte nimetustest (tinglik, t&auml;ielik
v&otilde;i alternatiivne) on sisaldatud kandidaadi poolt m&auml;&auml;ratud
ettev&otilde;tte nimetusse. Kuulumise otsingut teostatakse ilma registri
arvesse v&otilde;tmiseta.</p>
<p>&nbsp;</p>
<p>Sektsioon <b>Personaaltoimik</b>
sisaldab kandidaadiga toimunud s&uuml;ndmuste nimekirja alates tema andmete andmebaasi
sisestamise hetkest. S&uuml;ndmuste hulka kuuluvad faktid kandidaadi valimisest
vakantsile, telefoni vestlused, t&ouml;&ouml;vestlused ning muud s&uuml;ndmused.
Kusjuures, iga Teie poolt lisatud kommentaari igale s&uuml;ndmusele kuvatakse
nimekirjas. Teises ajatsoonis s&uuml;ndmuste aja &uuml;levaatuse vajadusel
kandidaadi personaaltoimikus, on Teil v&otilde;imalik &auml;ra muuta ajatsooni
v&auml;&auml;rtust kandidaadi<b> </b>kaardi
sektsioonis <b>Lisaandmed</b>. S&uuml;ndmuse
kaardi avamiseks klikkige hiirega topelt s&uuml;ndmuse reale.</p></body>
</html>
