<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>Kaartidega töö üldised printsiibid</h1>
<p>Tarkvara k&otilde;ikide objektide (kandidaadid,
vakantsid jne.) kaardid on &uuml;lesehitatud &uuml;hise printsiibi j&auml;rgi. Avatavaid
kaarte kuvatakse ekraanile eraldi akendes. Kaardi akna suurust v&otilde;ib muuta.
Tarkvara j&auml;tab meelde iga objekti t&uuml;&uuml;bi akende suurust, seega
j&auml;rgneval avamisel omavad kaardid ennem valitud suurust.</p>
<p>Kaardi standardsete v&auml;ljade olemasolu ja
asukoha &uuml;le (teatud v&auml;ljade jaoks v&otilde;ib m&auml;&auml;rata mis
sektsioonis neid kuvada – “&Uuml;ldised andmed ” v&otilde;i “Lisaandmed ”) ning
samuti ka v&otilde;imaluse &uuml;le m&auml;&auml;rata t&auml;itmiseks
kohustuslikud kaardi v&auml;ljad v&otilde;ib juhtida sektsioonis <b>Administreerimine-&gt;&Uuml;ldised
seadistused -&gt;Kaardi v&auml;ljade juhtimine</b>.</p>
<p>Tarkvaras on ette n&auml;htud v&otilde;imalus
v&auml;ljade v&auml;&auml;rtuste massiliseks vahetamiseks kaardil. Seda
teostatakse allj&auml;rgnevalt:</p>
<ul type="disc">
 <li>Valige
     loetelust k&otilde;ik kaardid, kus on vaja vahetada m&otilde;ne v&auml;lja
     v&auml;&auml;rtust uue vastu</li>
 <li>Peamen&uuml;&uuml;s
     valige k&auml;sk <b>Tegevused-&gt;M&auml;&auml;rake v&auml;lja
     v&auml;&auml;rtus</b></li>
 <li>V&auml;lja
     rippmen&uuml;&uuml;st <b>„V&auml;li“</b>
     valige vajalik v&auml;li ning v&auml;ljas <b>„V&auml;&auml;rtus“</b> m&auml;&auml;rake uus v&auml;&auml;rtus ja
     vajutage <b>ОК</b>.</li>
</ul>
<p>Iga kandidaadi kaart sisaldab reeglina &uuml;hte
lisatud dokumenti - CV-d. Lisaks sellele, on Teil v&otilde;imalik lisada
kandidaadi kaardile suvalist dokumentide arvu, samuti ka vakantse ja tellijat (n&auml;iteks,
CV-d v&otilde;&otilde;rkeeles, vakantsi t&auml;ielikku kirjeldust, lepingut
tellijaga jne.).</p>
<p>Selleks tuleb avatud kaardi instrumentide paneelil
vajutada nuppu <b>Lisada manus&nbsp;</b>(&quot;Klipp&quot;), valida dokumendi
t&uuml;&uuml;pi ning valida &uuml;hte v&otilde;i mitu faili (mitu faili
v&otilde;ib lisada juhul, kui on sisse l&uuml;litatud optsioon <b>Lubada mitme
faili lisamist</b> antud dokumendi t&uuml;&uuml;bi seadistustes sektsioonis <b>Administreerimine-&gt;Kataloogid-&gt;&Uuml;ldised-&gt;Kaardi
manused</b>). Hiljem v&otilde;ib vajadusel lisada kaardile veel faile <b>Import </b>nupu abil ning eemaldada neid k&auml;suga<b> Kustutada </b>kontekstmen&uuml;&uuml;st.</p>
<p>Juhul, kui vastav dokumendi t&uuml;&uuml;p puudub
nimekirjast, valige punkt<b> Lisada fail</b>.</p>
<p>Lisatud Microsoft Word, Microsoft Excel v&otilde;i
Adobe Reader failide puhul on nende eelvaade v&otilde;imalik otse kaardilt faili
avamata.</p>
<p>Peale dokumendi t&uuml;&uuml;bi valikut avaneb leht
t&uuml;hja dokumendiga. Teil on v&otilde;imalik sisestada dokumendi tekst
k&auml;sitsi, kopeerida see teisest redaktorist v&otilde;i importida otse Microsoft
Word, OpenOffice v&otilde;i Adobe Reader failist, vajutades nuppu <b>Import</b>.</p>
<p>Lisatud dokumendi/faili eemaldamiseks sektsioonist<b> Lisad</b> on vajalik valida sektsiooni,
seej&auml;rel valida eemaldatavat dokumenti/faili ning vajutada klaviatuuri
klahvile „<b>Delete“</b>.</p>
<p>Iga objekti uue t&auml;idetud kaardi ning samuti ka
muudetud kaardi sulgemisel pakub tarkvara salvestada uued andmed andmebaasi. Valige
vastus <b>Jah</b>. Samuti on Teil
v&otilde;imalik salvestada andmed eelnevalt, valides k&auml;su <b>Salvestada Fail </b>men&uuml;&uuml;st
(v&otilde;i valides Ctrl+S klaviatuuril).</p>
<p>&nbsp;</p></body>
</html>
