<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>Sündmuste tüübid</h1>
<p>Kataloog <b>S&uuml;ndmuste
t&uuml;&uuml;bid</b>&nbsp;sisaldab s&uuml;steemis kasutatavate
k&otilde;ikv&otilde;imalike s&uuml;ndmuste t&uuml;&uuml;pide nimekirja.</p>
<p>Enamus
s&uuml;ndmuste t&uuml;&uuml;pidest t&auml;histab vastavat objekti staatust, millega
ta seostatud on (n&auml;iteks,&nbsp;<b>T&ouml;&ouml;vestlus on toimunud</b>,&nbsp;<b>CV
juhataja juures</b>,&nbsp;<b>Katseaeg</b>). Samuti v&otilde;ib
s&uuml;ndmuse t&uuml;&uuml;p staatust ka mitte t&auml;histada (n&auml;iteks, <b>M&auml;rkus</b>,&nbsp;<b>Kohtumine</b>).</p>
<p>&Uuml;ldised
andmed:</p>
<p>V&auml;li
<b>Baasobjekt</b>&nbsp;t&auml;hendab objekti t&uuml;&uuml;pi, millega on
s&uuml;ndmus seotud. Enamuse s&uuml;ndmuste jaoks on Datex Recruit-s baasobjektiks
kandidaat.</p>
<p>Lipp&nbsp;<b>M&auml;&auml;rab
objekti staatust</b>&nbsp;t&auml;hendab, et kronoloogiliselt viimane antud
t&uuml;&uuml;pi s&uuml;ndmus m&auml;&auml;rab objekti staatust.</p>
<p>Lipp <b>Kalendri
kirje</b>&nbsp;kandidaatide kohta t&auml;hendab, et uue s&uuml;ndmuse loomisel
avaneb eelnevalt kalendri aken s&uuml;ndmuse kuup&auml;eva ning kellaaja
valimiseks.</p>
<p>L&uuml;liti
<b>&Uuml;hekordne s&uuml;ndmus/Ajaline intervaal</b> m&auml;&auml;rab, kas
s&uuml;ndmus (staatus) on &uuml;hekordne (n&auml;iteks,&nbsp;<b>Vastus
vakantsile</b>) v&otilde;i kestev (n&auml;iteks,&nbsp;<b>T&ouml;&ouml;vestlus</b>,&nbsp;<b>T&ouml;&ouml;pakkumine</b>).</p>
<p>Lipp <b>Kasutada
ruume</b>&nbsp;t&auml;hendab, et antud t&uuml;&uuml;pi s&uuml;ndmuse jaoks saab
valida ruumi ruumide nimekirjast selleks, et arvestada nende h&otilde;ivatusega.</p>
<p>Lipp&nbsp;<b>Siduda
vastaspoolega</b>&nbsp;t&auml;hendab, et vastava s&uuml;ndmuse kaardil ilmub
v&auml;li<b> Ettev&otilde;te</b>, mis sisaldab viidet objektile <b>Organisatsioon</b>.</p>
<p>Lipp&nbsp;<b>Siduda
vakantsiga</b>&nbsp;t&auml;hendab, et vastava s&uuml;ndmuse kaardil ilmub
v&auml;li<b> Vakants</b>, mis sisaldab viidet objektile <b>Vakants</b>.</p>
<p>Lipp <b>Pidada
osalejate nimekirja&nbsp;</b>t&auml;hendab, et vastava s&uuml;ndmuse kaardil s&auml;ilitatakse
eraldiseisev antud s&uuml;ndmuse osalejate nimekirja.</p>
<p>Lipp&nbsp;<b>Kinnitus
mitme osalejate poolt</b> t&auml;hendab, et l&otilde;petamise tunnuse „on
toimunud“ sissel&uuml;litamiseks on vajalik iga s&uuml;ndmuse osaleja
positiivne otsus.</p>
<p>Lipp&nbsp;<b>Hindamise
vormi t&auml;itmise osalejate poolt</b> t&auml;hendab, et iga osaleja peab
t&auml;itma m&auml;&auml;ratud k&uuml;simustikku.</p>
<p>&nbsp;</p>
<p>Ala&nbsp;<b>L&otilde;petamise
tunnused</b> sisaldab v&otilde;imalike l&otilde;petamise tunnuste nimekirja
antud s&uuml;ndmuse jaoks. Selliste tunnuste komplekt s&otilde;ltub
s&uuml;ndmuse sisust.</p>
<p>S&uuml;ndmust
saab &uuml;ldjuhul planeerida tulevikuks (tunnus <b>„Planeeritud“</b>), seej&auml;rel see toimub (tunnus <b>„On toimunud“</b>). Juhul, kui see kestab
teatud aega, see v&otilde;ib toimuda edukalt (tunnus <b>„On l&auml;bitud“</b>) v&otilde;i mitte (tunnus „<b>Ei ole l&auml;bitud“</b>).&nbsp;<br>
Lisaks sellele v&otilde;ib s&uuml;ndmus olla t&uuml;histatud (tunnus <b>„T&uuml;histatud“</b>).</p>
<p>Lisaks
standardsetele l&otilde;petamise tunnustele saab vajadusel lisada ka
kasutajapoolseid tunnuseid (<b>Lisada l&otilde;petamise tunnust -&gt;Kasutajapoolne</b>),
kuid eelnevalt veenduge, et &uuml;kski standardsetest tunnustest Teile
t&otilde;esti ei sobi.</p>
<p>&nbsp;</p>
<p>Lisaandmed:</p>
<p>Lipp&nbsp;<b>N&auml;idata
eraldi nupuna kandidaadi kaardi vasakus osas</b>&nbsp;t&auml;hendab, et
s&uuml;ndmus kuulub kandidaadi vaatlemise p&otilde;hiketti ning kuvatakse
kandidaadi kaardi vasakus osas eraldi nupuna.</p>
<p>V&auml;li&nbsp;<b>Nupu
pealkiri&nbsp;</b>muutub k&auml;ttesaadavaks sissel&uuml;litatud valiku&nbsp;<b>N&auml;idata
eraldi nupuna kandidaadi kaardi vasakus osas</b>&nbsp;korral.</p>
<p>Lipp <b>Luua
tarkvara eraldiseisvat sektsiooni antud t&uuml;&uuml;pi s&uuml;ndmuste jaoks</b>
t&auml;hendab, et sektsioonis<b> S&uuml;ndmused </b>lisandub vastav alasektsioon antud t&uuml;&uuml;bi s&uuml;ndmuste
kuvamise jaoks.</p>
<p>V&auml;li
<b>Aktuaalne vaid grupi jaoks</b>&nbsp;lubab &auml;ra piirata kandidaatide
kaartidel antud t&uuml;&uuml;bi s&uuml;ndmuste k&auml;ttesaadavust nende
gruppide piiridega.</p>
<p>Lipp&nbsp;<b>Eksportida
v&auml;lisesse kalendrisse</b> t&auml;hendab, et s&uuml;ndmuse
m&auml;&auml;ramisel eksporditakse selle koopiat selle kasutaja v&auml;lisesse kalendrisse,
kes on salvestanud s&uuml;ndmuse kaardil. Funktsioon on aktiivne
sissel&uuml;litatud valiku <b>Kirje
kalendris</b> korral sektsioonis <b>&Uuml;ldised
andmed</b>, valitud v&auml;lises kalendri puhul sektsioonis P<b>ersonaalsed
seadistused -&gt;Kalender </b>ning paigaldatud mooduli puhul sektsioonis<b> Personaalsed
seadistused -&gt;Moodulid v&auml;liste tarkvarade jaoks</b> (MS Outlook v&otilde;i
Lotus Notes kasutamise korral).</p>
<p>Lipp&nbsp;<b>Eelnevalt
valida aega, kasutades sisseehitatud kalendrit</b>&nbsp;t&auml;hendab, et
planeeritud s&uuml;ndmuse aja valikuks kasutatakse tarkvara sisemist kalendrit.</p>
<p>Lipp&nbsp;<b>Avada
s&uuml;ndmust v&auml;lises kalendris</b> t&auml;hendab, et vastava
t&uuml;&uuml;bi s&uuml;ndmuse loomisel tekib ning avaneb s&uuml;ndmus ka
kasutaja v&auml;lises kalendris. Kui see lipp on &auml;ra v&otilde;etud, kuid
on sisse l&uuml;litatud valik <b>Pidada osalejate nimekirja </b>sektsioonis
&Uuml;ldised andmed, siis tarkvara teostab s&uuml;ndmusest teavituste
automaatset laialisaatmist s&uuml;ndmuse osalejatele.</p>
<p>&nbsp;</p>
<p>Staatused:</p>
<p>V&auml;li
<b>Standardne nimetus&nbsp;</b>m&auml;&auml;rab<b> </b>objekti vastava staatuse nimetust. Vaikimisi
on objekti staatuse nimetus m&auml;&auml;ratud kui s&uuml;ndmuse nimetus, pluss
l&otilde;petamise tunnus.</p>
<p>Lipp <b>deaktiveerib objekti </b>&nbsp;t&auml;hendab,
et antud staatusega objekt muutub mitteaktiivseks (t&auml;histatakse halli
pildiga). Selliste staatuste n&auml;idisteks on  <b>Personalireserv</b>,&nbsp;<b> Tagasi
l&uuml;katud v&auml;rbaja poolt</b>,&nbsp;<b>V&otilde;etud t&ouml;&ouml;le</b>.</p>
<p>Lipp <b>Staatus
eeldab kasutajapoolse otsuse vastuv&otilde;tmist s&uuml;ndmuse kohta kandidaadi
osas </b>t&auml;hendab, et
v&auml;rbaja on vastutav selle eest, et kandidaat on siiamaani antud staatuses.
N&auml;iteks, staatused <b>Vastus
vakantsile</b>,&nbsp;<b>T&ouml;&ouml;vestlus on toimunud</b>,&nbsp;<b>CV on
tellija poolt heaks kiidetud</b> t&auml;hendavad, et v&auml;rbaja peab
kandidaati kas tagasi l&uuml;kata v&otilde;i vastu v&otilde;tta mingisuguseid
aktiivseid toiminguid kandidaadiga edasise t&ouml;&ouml; osas ning viia ta
&uuml;le j&auml;rgmisse staatusse. Selliste staatustega kandidaate kuvatakse
sektsioonis<b> Kandidaadid-&gt;V&otilde;tta vastu otsust</b> (tingimusel, et
kandidaat asub sellises staatuses kuni 90 p&auml;eva).</p>
<p>Lipp&nbsp;<b>Luua
tarkvara eraldi sektsiooni sellise staatusega objektide jaoks</b> t&auml;hendab
kandidaadi jaoks, et peasektsioonis<b> Kandidaadid staatuse j&auml;rgi</b> ilmub
selline sektsioon.</p>
<p>Lipp <b>K&uuml;sida
kasutajapoolset kinnitust</b> t&auml;hendab, et &uuml;leviimisel antud staatusse
avaneb dialoogi aken kinnitamise p&auml;ringuga.</p>
<p>Lipp <b>N&auml;idata
dialoogiakna kommentaari sisestamise jaoks</b> t&auml;hendab, et
&uuml;leminekul antud staatusse avaneb dialoogiaken  kommentaari sisestamiseks.</p>
<p>Lipp&nbsp;<b>&Uuml;leminekul antud staatusse avada
s&uuml;ndmuse kaarti lisainformatsiooni sisestamiseks</b> kandidaatide suhtes
t&auml;hendab, et s&uuml;ndmuse &uuml;leminekul antud staatusse avaneb
s&uuml;ndmuse kaart, kuhu saab sisestada lisainformatsiooni.</p>
<p>Lipp <b>Kommentaari
olemasolu on kohustuslik</b> t&auml;hendab, et s&uuml;steem ei lase lisada
s&uuml;ndmust ilma v&auml;lja <b>Kommentaar </b>minimaalselt m&auml;&auml;ratud pikkusega kommentaariga<b> </b>t&auml;itmiseta
(v&auml;li&nbsp;<b>Kommentaari minimaalne pikkus)</b>.</p>
<p>V&auml;li&nbsp;<b>Kommentaari
esialgne mall</b> v&otilde;imaldab ette seadistada m&otilde;ningat esialgset
mustrit, et kommentaari sisestamiseks dialoogiakna ilmumisel oleks ta
moodustatud selle malli j&auml;rgi.</p>
<p>V&auml;li&nbsp;<b>Olemise piirt&auml;htaeg</b>&nbsp;m&auml;&auml;rab
maksimaalset normatiivaega, mille jooksul v&otilde;ib objekt olla antud
staatuses. Juhul, kui objektiks on kandidaat, siis piirt&auml;htaja
m&ouml;&ouml;dumisel kajastatakse teada sektsioonis&nbsp;<b>Kandidaadid-&gt;Staatus
on aegunud</b> (antud staatuses kuni 90 p&auml;eva olemise tingimusel).</p>
<p>Lipp&nbsp;<b>N&otilde;uab
kandidaadi sidumist vakantsiga</b>&nbsp;t&auml;hendab, et s&uuml;steem ei lase
&uuml;le viia kandidaati antud staatusse, kuni kandidaati ei valita
mingisugusele aktiivsele vakantsile v&otilde;i kuni vakantsi eelnevalt ei
selekteerita nimekirjas <b>Vaadeldakse vakantsile</b> (kandidaadi vaatlemise
puhul mitmele aktiivsele vakantsile).</p>
<p>Lipp <b>M&auml;&auml;rab
kandidaati finaalsena vakantsi osas</b> t&auml;hendab, et k&auml;esoleva
staatuse saabumisel t&auml;histatakse kandidaati finaalse kandidaadina selle
vakantsi osas, millele ta vaadeldi.</p>
<p>Lipp&nbsp;<b>Muudab vakantsi staatust</b> t&auml;hendab,
et antud staatuse saabumisel muutub vakantsi staatus, mille peale vaadeldi
kandidaati.</p>
<p>Lipp&nbsp;<b>Saabumisel
automaatselt viib objekti &uuml;le j&auml;rgmisse staatusse</b> t&auml;hendab,
et k&auml;esoleva staatuse saabumisel l&auml;heb objekt automaatselt &uuml;le
j&auml;rgmisse staatusse. N&auml;iteks, staatuse <b>CV on heaks kiidetud juhi
poolt </b>saabumisel v&otilde;ib
kandidaat olla &uuml;le viidud staatusse<b> Hindamine juhtide poolt</b>.</p>
<p>&nbsp;</p>
<p>Alasektsioon&nbsp;<b>Toimingud</b>:</p>
<p><b>Toimingu
t&uuml;&uuml;p –</b>&nbsp;viide on m&otilde;eldud lisatoimingu m&auml;&auml;ramiseks (<b>Saata E-kirja&nbsp;</b>v&otilde;i&nbsp;<b>T&auml;ita
skripti</b>), mida on vajalik teostada enne/p&auml;rast s&uuml;ndmuse
&uuml;leminekut k&auml;esolevasse staatusse.</p>
<p><b>Saata E-kirja&nbsp;</b>t&auml;hendab, et s&uuml;ndmuse
&uuml;leminekul k&auml;esolevasse staatusse objektile saadetakse s&otilde;numit
m&auml;&auml;ratud mustri j&auml;rgi. Lisaks sellele, on olemas mitme
alternatiivse kirjamalli ette seadistamise v&otilde;imalus nupu abil<b> Kataloogi
elemendi valik</b>.</p>
<p>Lipp&nbsp;<b>Saata
osalejatele</b>&nbsp;t&auml;hendab, et &uuml;leminekul antud staatusse koostatakse
s&uuml;ndmuse osalejatele automaatselt s&otilde;numit m&auml;&auml;ratud mustri
j&auml;rgi saatmiseks. Valik muutub k&auml;ttesaadavaks paigaldatud lipu<b> Pidada
osalejate nimekirja</b> korral sektsioonis &Uuml;ldised andmed.</p></body>
</html>
