<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>CV otsing Internetis</h1>
<p>Tarkvara Datex Recruit lubab
teostada CV otsingut &uuml;heaegselt mitmelt personaliotsingu veebilehelt
&uuml;he p&auml;ringu abil ning t&otilde;sta leitud CV-d sisemisse andmebaasi.</p>
<p>Veebilehtedele
ligip&auml;&auml;suks kasutatakse Teie sektsioonis <b>Personaalsed seadistused -&gt;Internetimoodul
-&gt;Kontod </b>sisestatud
registreerimisandmeid.</p>
<ul type="disc">
 <li>CV otsingu teostamiseks Internetis Datex
     Recruit kaudu valige tarkvara peamen&uuml;&uuml;s k&auml;sk&nbsp;<b>Servis-&gt;Otsing Internetis -&gt;CV otsing Internetis</b>&nbsp;(v&otilde;i
     vajutage otsingunupp instrumentide paneelil).</li>
</ul>
<p>Avaneb CV Internetiotsingu aken:</p>
<ul type="disc">
 <li>Vahelehel&nbsp;<b>Otsingu parameetrid</b>&nbsp;valige veebilehed, kus plaanitakse
     otsingu teostamist ning m&auml;&auml;rake vajalikud kriteeriumid (v&auml;hemalt
     v&otilde;tmes&otilde;nu ning regiooni).</li>
</ul>
<p><b>Otsing v&otilde;tmes&otilde;nade
j&auml;rgi</b>. V&otilde;tmes&otilde;nade
j&auml;rgi otsingu kriteeriumites saab ette anda vajaminevat loogikat, m&auml;&auml;rates
kohustuslikke tingimusi (K&otilde;ik s&otilde;nad, &Uuml;ks s&otilde;nadest, T&auml;pne
fraas, Ei kohtu) ning otsingu ala. Lisaks sellele, v&otilde;ib ette anda mitu
sellist kriteeriumi – kriteeriumide nimekirja j&auml;rgmise rea koostamist
teostatakse nupu <b>+</b>&nbsp;„Lisada tingimus“ abil, mis asub eelmise rea
l&otilde;pus.</p>
<p><b>Otsing regioonide j&auml;rgi</b>. On v&otilde;imalik teostada otsingut nii
&uuml;hes, kui ka mitmes regioonis &uuml;heaegselt, m&auml;&auml;rates neid
v&auml;ljas <b>Regioon</b>. Mitmeid regioone valitakse nimekirjast klahvide Shift
v&otilde;i Ctrl abil. Otsingut valitud regiooni kolimise v&otilde;imalusega
teostatakse valikuga&nbsp;<b>Sisaldades valmisolevaid siia kolimiseks</b>.</p>
<p>CV otsinguks pildi olemasolu
tingimusega on vajalik lisada lippu <b>Ainult
pildiga CV-d</b>.</p>
<p><b>Otsing arvestades
v&otilde;&otilde;rkeelte valdamist</b>. V&auml;ljas
<b>Keelte valdamine</b> v&otilde;ib valida
keelt ning valdamise taset. Lisaks sellele, v&otilde;ib ette anda mitu sellist
kriteeriumi - nimekirja j&auml;rgmise rea koostamist teostatakse nupu <b>+</b>&nbsp;„Lisada
keel“ abil, mis asub eelmise rea l&otilde;pus.</p>
<p>Otsingu jaoks veebilehelt eriala
(rubriigi) j&auml;rgi on vajalik valida seda v&auml;ljast<b> Rubriik</b>. On
v&otilde;imalik koheselt ka mitme elemendi valimine klahvi<b> Ctrl </b>hoides.</p>
<ul type="disc">
 <li>Vajutage nupp<b> Otsida</b>. Eemaldada
     k&otilde;iki eelnevalt etteseadistatud kriteeriume v&otilde;ib nupu
     „Puhastada vorm“ abil instrumentide paneelil.</li>
</ul>
<p>K&auml;ivitub otsing valitud veebilehtedel.
Vajadusel saab otsingu protsessi katkestada nupu „Peatada laadimist“ abil (punase
ruudu kujul). Otsingu l&otilde;ppedes kuvatakse vahelehel <b>Tulemused </b>leitud CV-de loetelu.</p>
<p>Akna &uuml;lemises osas vahelehel
<b>Tulemused </b>on reastatud etteantud
kriteeriumid, paremas – statistika leitud CV-de osas iga veebilehe jaoks, kus
otsingut teostati:</p>
<ul type="disc">
 <li>leitud CV-de &uuml;ldine arv;</li>
 <li>internetimoodulisse laaditud CV-de arv;</li>
 <li>lugemata CV-de arv.</li>
</ul>
<p>Allpool asub &uuml;lesleitud CV-de
loetelu. Eelnevalt Teie poolt &uuml;le vaadatud CV t&auml;histatakse halli
v&auml;rviga ning andmebaasi lisatud CV-d on t&auml;histatud m&auml;rgiga „<b>+“</b>
veerus <b>On olemas </b><b>andmebaasis</b>.</p>
<ul type="disc">
 <li>Leitud CV &uuml;levaateks selekteerige see
     nimekirjast.</li>
</ul>
<p>Akna alumises osas eelvaade alal
ilmub taotleja CV sisu standardiseeritud kujul.</p>
<p>Paremas alumises nurgas asub
nuppudega ala valitud CV lisamiseks andmebaasi ning v&otilde;tmeinfo
&uuml;levaatuseks kandidaadi osas, kelle CV oli eelnevalt andmebaasi
salvestatud (kiireks ligip&auml;&auml;suks tema kaardile saab kasutada PNI
kujul kuvatavat viidet).</p>
<ul type="disc">
 <li>Valitud CV t&otilde;stmiseks Teie andmebaasi
     kasutatakse nuppu <b>Lisada andmebaasi.</b>&nbsp;Juhul, kui olete
     koheselt selgeks teinud, millisele vakantsile vaadeldav kandidaat sobib, siis
     CV t&otilde;stmist v&otilde;ib teostada paralleelselt valikuga sellele
     vakantsile k&auml;su <b>Lisada andmebaasi
     ning valida vakantsile </b>abil k&otilde;rvalasuva nupu „K&otilde;ik
     toimingud“ rippmen&uuml;&uuml;st. Sellisel juhul avaneb dialoogi aken, mis
     pakub valida vakantsi aktiivsete vakantside nimekirjast. Et edaspidi,
     teiste taotlejate CV-de t&otilde;stmisel, poleks vajalik otsida &uuml;he
     ja sama vakantsi, saab kasutada k&auml;sku<b> Lisada </b><b>andmebaasi jooksvale vakantsile</b> &uuml;hekordselt
     m&auml;&auml;rates sellist vakantsi k&auml;suga<b> Valida jooksvat
     vakantsi</b>.</li>
</ul>
<p>Avaneb kandidaadi kaart, kus on
t&auml;idetud need v&auml;ljad, mida tarkvara suutis tuvastada. Ekraani
alumises osas asub kandidaadi CV esialgsel kujul.</p>
<p>Enne CV lisamist teostab rakendus
eelnevalt kontrolli v&otilde;imalike dublikaatide olemasolu osas andmebaasis. Juhul,
kui avastatakse dublikaate, annab tarkvara ette vastavat teavitust.</p>
<ul type="disc">
 <li>Kandidaadi kaardi salvestamiseks andmebaasis
     vajutage nupp<b> Salvestada ja sulgeda</b>.</li>
</ul>
<p>&nbsp;</p></body>
</html>
