<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>CV impordi allikad</h1>
<p>Kataloog <b>CV impordi allikad </b>on m&otilde;eldud Datex Recruit seadistamiseks
CV-de impordiks &uuml;hest v&otilde;i mitmest postkastist, samuti ka ketta
kataloogidest. Postirakenduste ning postkastidega &uuml;henduse viiside
mitmekesisuse t&otilde;ttu on v&otilde;imalik, et  Datex Recruit &otilde;ige seadistuse
teostamiseks on Teile vajalik Teie s&uuml;steemadministraatori abi.&nbsp;Erandjuhtudel
v&otilde;ib seadistamist teostada ainult s&uuml;steemadministraator.</p>
<p>V&auml;lja <b>Nimetus </b>kasutatakse ainult erinevate allikate visuaalse eristamise jaoks
ning see v&otilde;ib sisaldada suvalist teksti.</p>
<p>V&auml;li&nbsp;<b>Allika omanik</b> sisaldab
s&uuml;steemi kasutajat, kellele antud allikas kuulub. Juhul, kui omanik ei ole
m&auml;&auml;ratud, v&otilde;ivad allikat kasutada k&otilde;ik s&uuml;steemi
kasutajad.</p>
<p>V&auml;li&nbsp;<b>Allika t&uuml;&uuml;p</b> lubab
selgeks teha allika t&uuml;&uuml;pi – postkasti v&otilde;i ketta kataloogi.</p>
<p>V&auml;lja <b>Ligip&auml;&auml;su
meetod</b>&nbsp;kasutatakse postirakendusega (postkastiga) &uuml;henduse viisi
valimiseks.</p>
<p>Ligip&auml;&auml;su meetod <b>Simple MAPI</b>&nbsp;on
Microsoft ettev&otilde;tte poolt pakutav standardne meetod selliste tarkvarade
postkastidele ligip&auml;&auml;suks, mis antud meetodit toetavad.&nbsp;Tegelikkuses,
toetavad k&auml;esoleva ligip&auml;&auml;su meetodit ainult tarkvarad<b> Outlook
Express</b>&nbsp;ning&nbsp;<b>Microsoft Outlook</b>, kusjuures ainult postkasti
jaoks, mis asub Teie arvutis ning mida vaikimisi kasutatakse (<b>Sisenev post</b> v&otilde;i<b> Inbox</b>).</p>
<p>Ligip&auml;&auml;su meetod <b>Extended MAPI</b>&nbsp;on
samuti Microsoft ettev&otilde;tte poolt pakutav standardne meetod erinevate tarkvarade
postkastidele ligip&auml;&auml;suks, kuid mida toetab ainult tarkvara <b>Microsoft
Outlook</b>. Antud meetod v&otilde;imaldab t&ouml;&ouml;delda iga postkasti
ning iga kausta Microsoft Outlook sees, s&otilde;ltumata postkasti ning Teie
postiserveri t&uuml;&uuml;bist.</p>
<p>Ligip&auml;&auml;su meetod <b>POP3</b>&nbsp;lubab tarkvaral
p&ouml;&ouml;rduda otse (m&ouml;&ouml;dudes Teie postirakendusest) Teie
postiserveri poole ning t&ouml;&ouml;delda postkasti. Seda meetodit ei
soovitata juhul, kui kavatsete vaadata kirju postkastis nii Datex Recruit, kui
ka Teie postirakenduse abil, kuna nii Datex Recruit-sse ning teie
postirakendusse laaditakse kirjade koopiad ning Teil tuleb sooritada nende
sortimisel topelt t&ouml;&ouml;d.</p>
<p>Ligip&auml;&auml;su meetod <b>IMAP</b>&nbsp;lubab samuti
tarkvaral p&ouml;&ouml;rduda otse (m&ouml;&ouml;dudes Teie postirakendusest)
Teie postiserveri poole ning t&ouml;&ouml;delda postkasti. K&auml;esolev meetod
on t&auml;iuslikum, kui <b>POP3</b>, kuna lubab t&auml;histada CV-d sisaldavaid
kirju, nagu nad oleksid loetud otse Teie postkastist serveril. Seega, postkasti
t&ouml;&ouml;tlemise tulemust on n&auml;ha ka Teie postirakenduses.</p>
<p>Allpool on toodud peamised soovitused
ligip&auml;&auml;su meetodi valiku osas rea populaarseimate postirakenduste
jaoks:</p>
<p>&nbsp;</p>
<p><u>Juhul, kui Te kasutate&nbsp;<b>Outlook Express</b>:</u></p>
<p>Kui Teie post laetakse lokaalsesse postkasti Teie
arvutil –&nbsp;<b>Sisenev post</b>&nbsp;v&otilde;i&nbsp;<b>Inbox</b>, valige
meetod<b> Simple MAPI</b>. Sellisel juhul, peab normaalseks funktsioneerimiseks
Outlook Express olema valitud Windows-s vaikimisi kasutatavana. Selleks:</p>
<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;K&auml;ivitage tarkvara Internet
Explorer ning valige k&auml;sk<b> Interneti omadused...</b>&nbsp;(<b>Internet
Options...</b>) men&uuml;&uuml;st&nbsp;<b>Servis</b>&nbsp;(<b>Tools</b>).</p>
<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Avanenud dialoogiaknas valige
vaheleht<b> Tarkvarad</b>&nbsp;(<b>Programs</b>).</p>
<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Nimekirjas
<b>elektroonse posti</b> (<b>E-mail</b>)
vastas valige <b>Outlook Express</b>&nbsp;ning vajutage&nbsp;<b>OK</b>.</p>
<p>Seej&auml;rel saab tarkvara t&ouml;&ouml;delda
ainult kirju, mis asuvad vahetult selles postkastis. Lisakaustasid ei t&ouml;&ouml;delda.</p>
<p>Kui postkastid, mida Teie loete Outlook Express
abil, asuvad eraldi serveril, valige ligip&auml;&auml;su meetod<b> IMAP</b>.
M&auml;&auml;rake <b>Postiserver</b> (nimi v&otilde;i IP-aadress),
kus postkast asub ning samuti <b>Kasutajanimi</b>
ja <b>Salas&otilde;na</b> kastile
ligip&auml;&auml;su jaoks. Neid parameetreid v&otilde;ib vaadata Outlook
Express seadistustes (Men&uuml;&uuml;&nbsp;<b>Servis</b>&nbsp;(<b>Tools</b>), punkt&nbsp;<b>Kontod…</b>&nbsp;(<b>Accounts…</b>).</p>
<p>Vaikimisi, IMAP kasutamisel teostatakse importi
kaustast <b>Sisenevad</b> (<b>Inbox</b>). Kui soovite t&ouml;&ouml;delda teist
kausta serveril, m&auml;&auml;rake kausta nimi v&auml;ljas <b>Kaust</b>.</p>
<p>&nbsp;</p>
<p><u>Juhul, kui te kasutate <b>Microsoft Outlook</b>:</u></p>
<p>Valige meetod&nbsp;<b>Extended MAPI</b>. Sellisel
juhul peab normaalseks funktsioneerimiseks Microsoft Outlook olema valitud Windows-s
vaikimisi kasutatavana. Selleks:</p>
<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;K&auml;ivitage tarkvara Internet
Explorer ning valige k&auml;sk<b> Interneti omadused...</b>&nbsp;(<b>Internet
Options...</b>) men&uuml;&uuml;st&nbsp;<b>Servis</b>&nbsp;(<b>Tools</b>).</p>
<p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Avanenud dialoogiaknas valige
vaheleht<b> Tarkvarad</b>&nbsp;(<b>Programs</b>).</p>
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
Nimekirjas
<b>elektroonse posti</b> (<b>E-mail</b>)
vastas valige&nbsp;<b>Microsoft Outlook</b>&nbsp;ning vajutage&nbsp;<b>OK</b>.</p>
<p>Juhul, kui Teie postkast asub
sektsioonis<b> Isiklikud kaustad</b> (<b>Personal Folders</b>), j&auml;tke
v&auml;li <b>Postibaas (server)</b>&nbsp;t&uuml;hjaks. Vastasel juhul
m&auml;&auml;rake v&auml;ljas <b>Postibaas (server)&nbsp;</b>sektsiooni
nimetus Microsoft Outlook-s (postiserveri nimi), kus Teie postkast asub.</p>
<p>Vaikimisi teostatakse kasutamisel importi kaustast <b>Sisenevad</b>
(<b>Inbox</b>). Juhul, kui soovite t&ouml;&ouml;delda teist kausta, nimetage
see v&auml;ljas <b>Kaust</b>. Juhul, kui Te
soovite samuti t&ouml;&ouml;delda ka k&otilde;iki kaustasid, mis asuvad Teie
poolt m&auml;&auml;ratud kausta sees, paigaldage lipp<b> Sealhulgas sees olevad
kaustad</b>.</p>
<p>&nbsp;</p>
<p><u>Juhul, kui Te kasutate <b>Eudora</b>&nbsp;v&otilde;i&nbsp;<b>The
Bat!</b>:</u></p>
<p>Juhul, kui Teie post laetakse lokaalsesse postkasti
Teie arvutis (<b>Sisenev post </b>v&otilde;i<b>
Inbox</b>) protokolli POP3 kaudu, &uuml;ritage &uuml;le minna protokolli
IMAP kasutamisele. Selle k&uuml;simuse osas tuleb Teil konsulteerida Teie
s&uuml;steemadministraatoriga. Juhul, kui selline &uuml;leminek ei ole
v&otilde;imalik, siis v&auml;ljas <b>Ligip&auml;&auml;su meetod</b> valige <b>POP3</b>.
M&auml;&auml;rake v&auml;ljas <b>Postiserver</b> nimi ja v&otilde;i IP-aadress,
kui postkast asub, samuti ka <b>Kasutajanimi
</b>ning <b>Salas&otilde;na</b> ligip&auml;&auml;su
jaoks<b> </b>postkastile. Neid parameetreid
v&otilde;ib vaadata Teie postirakenduse seadistustes.</p>
<p>Juhul, kui Teie postkast asub eraldi serveril, valige
ligip&auml;&auml;su meetod <b>IMAP</b>. M&auml;&auml;rake v&auml;ljas <b>Postiserver</b>
nimi ja v&otilde;i IP-aadress, kui postkast asub, samuti ka <b>Kasutajanimi </b>ning <b>Salas&otilde;na</b> ligip&auml;&auml;su jaoks<b> </b>postkastile. Neid parameetreid v&otilde;ib vaadata Teie
postirakenduse seadistustes.</p>
<p>Vaikimisi teostatakse IMAP kasutamisel importi
kaustast <b>Sisenevad</b> (<b>Inbox</b>). Juhul, kui soovite t&ouml;&ouml;delda
teist kausta serveril, nimetage kausta nimetus v&auml;ljas <b>Kaust.</b></p>
<p>&nbsp;</p>
<p><u>Juhul, kui Te kasutate <b>Lotus Notes</b>&nbsp;v&otilde;i&nbsp;<b>Novell
GroupWise</b>:</u></p>
<p>Antud juhul peab kastidele ligip&auml;&auml;suks
teie postiserveril olema sissel&uuml;litatud protokoll<b> IMAP</b>. Antud
k&uuml;simuse osas peate eelnevalt konsulteerida Teie s&uuml;steemadministraatoriga.</p>
<p>M&auml;&auml;rake v&auml;ljas <b>Postiserver</b> nimi
v&otilde;i IP-aadress, kui postkast asub, samuti ka <b>Kasutajanimi </b>ning <b>Salas&otilde;na</b>
ligip&auml;&auml;su jaoks<b> </b>postkastile.
</p>
<p>Vaikimisi teostatakse IMAP kasutamisel importi
kaustast <b>Sisenevad</b> (<b>Inbox</b>). Juhul, kui soovite t&ouml;&ouml;delda
teist kausta serveril, nimetage kausta nimetus v&auml;ljas <b>Kaust.</b></p>
<p>&nbsp;</p>
<p>Impordi allika kaart sisaldab samuti rida
seadistamise lisaparameetreid, millest osa on k&auml;ttesaadav vaid teatud
ligip&auml;&auml;su meetodite jaoks:</p>
<p>Lipp&nbsp;<b>Kasutada SSL</b>&nbsp;v&otilde;imaldab
POP3 ning IMAP t&ouml;&ouml;delda postkaste kaitstud &uuml;henduste protokolli
kasutamisega SSL (Secure Sockets Layer), nagu, n&auml;iteks, Gmail.com.</p>
<p>Lipp&nbsp;<b>Uuendada postkasti enne impordi algust</b>
lubab importida hiljuti saabunuid kirju enne postkasti t&ouml;&ouml;tlemise
algust.</p>
<p>Lipp&nbsp;<b>Kontrollida ainult lugemata kirju</b>&nbsp;lubab
tarkvaral lugeda ainult neid kurju, mis on m&auml;rgitstatud kui lugemata. Seda
lippu v&auml;lja l&uuml;litada ei ole soovituslik, kuna see v&otilde;ib viia
oluliseks t&ouml;&ouml; aeglustamiseks &uuml;hte ja samade kirjade
j&auml;rjekordse t&ouml;&ouml;tlemise t&otilde;ttu. Erandjuhtudel, v&otilde;ib
selle lipu v&auml;ljal&uuml;litamine olla &otilde;igustatud (n&auml;iteks, kui
import toimub esimest korda v&otilde;i kui kasutaja eelistab k&otilde;igepealt
&uuml;le vaadata kirju oma postirakenduses, filtreerida neid ning alles siis
teostada nende importi andmebaasi).</p>
<p>Lipp&nbsp;<b>M&auml;rgistada k&otilde;iki
kontrollitud kirju loetuks</b> lubab m&auml;rgistada k&otilde;iki tarkvara
poolt &uuml;le vaadatuid kirju loetuks, s&otilde;ltumata sellest kas nendes on CV
avastatud. Juhul, kui antud lipp on paigaldatud, m&auml;rgistatakse peale igast
importi k&otilde;iki kirju postkastis loetuks.</p>
<p>Lipp <b>M&auml;rgistada
loetuks CV-d sisaldavaid loetuid kirju</b>&nbsp;on paigutatud vaikimisi. See
lubab m&auml;rgistada loetuna ainult neid kirju, kus tarkvara on CV tuvastanud
ning laadinud andmebaasi. Soovitatakse paigutada seda lippu juhul, kui
postkasti kasutatakse mitte ainult CV-de k&auml;ttesaamiseks, vaid ka
t&ouml;&ouml;taja -tarkvara kasutaja - &auml;riliseks kirjavahetuseks.</p>
<p>V&auml;li <b>Kontrolli
tase CV olemasolu osas</b> lubab reguleerida kirjade kontrolli ranguse astet
nendes CV-de olemasolu osas.</p>
<p>V&auml;ljade komplekt&nbsp;<b>Paigaldada laaditud
kandidaatide jaoks</b> v&otilde;imaldab paigaldada etteantud v&auml;&auml;rtusi
m&otilde;nedele v&auml;ljadele CV-de jaoks, mis olid imporditud
k&auml;esolevast allikast.</p></body>
</html>
