<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>Posti saatmine</h1>
<p>Sektsioon
<b>Posti saatmine </b>on m&otilde;eldud kandidaatidele
ning tellijatele kirjade saatmise seadistamiseks mustrite j&auml;rgi. Kirjade
saatmine on v&otilde;imalik kas Teie postirakenduse kaudu v&otilde;i otseselt SMTP-serveri
kaudu. M&otilde;lemal juhul on Teil vajalik teostada Datex Recruit
m&otilde;ningaid seadistusi.</p>
<p>Punkti <b>&Uuml;ksikkirjade
ettevalmistuse meetod </b>kasutatakse<b>
</b>postirakendusega<b> </b>koostoime meetodi valimiseks v&otilde;i <b>SMTP</b>-serveri
kaudu saatmise valimiseks.</p>
<p>Reeglina,
enamuse postirakenduste jaoks toimib meetod<b> Simple&nbsp;MAPI</b>, mis on valitud
vaikimisi. Sellisel juhul peab Teie postirakendus normaalseks
funktsioneerimiseks olema valitud Windows operatsioonilises s&uuml;steemis
vaikimisi kasutatavana. Selleks:</p>
<p>·&nbsp; K&auml;ivitage
<b>Internet&nbsp;Explorer</b>&nbsp;tarkvara ning valige k&auml;sk<b> Brauseri
omadused</b> men&uuml;&uuml;st <b>Servis</b>.</p>
<p>·&nbsp; Avanenud
dialoogi aknas valige vaheleht <b>Tarkvarad</b>.</p>
<p>·&nbsp; Vajutage
nupp<b> Ette anda tarkvarad</b> ning edasi avanevas aknas <b>– Tarkvarade ning vaikimiste
ligip&auml;&auml;su seadistus.</b></p>
<p>·&nbsp; Avanenud
nimekirjas valige teie postirakendus, paigaldage lipp <b>Teha k&auml;esoleva tarkvara
k&auml;ttesaadavaks</b> ning vajutage&nbsp;<b>OK</b>.</p>
<p>Antud
meetod funktsioneerib normaalselt postirakenduste <b>Outlook&nbsp;Express</b>,&nbsp;<b>Microsoft&nbsp;Outlook</b>,&nbsp;<b>The&nbsp;Bat!
</b>kasutamise puhul.</p>
<p>Juhul,
kui <b>Microsoft&nbsp;Outlook</b>&nbsp;postirakenduse kasutamisel kirja loomine
saatmiseks ei toimi – valige ettevalmistuse meetod <b>Microsoft Outlook
automation&nbsp;</b>ning sektsioonis<b> Moodulid v&auml;liste tarkvarade jaoks</b>
<b>Microsoft Outlook</b>&nbsp;kirje vastas vajutage nupp<b> Paigaldada </b>(juhul,
kui moodul ei olnud eelnevalt paigaldatud).</p>
<p><b>Lotus&nbsp;Notes&nbsp;</b>postirakenduse
kasutamisel saab kasutada nii <b>Simple&nbsp;MAPI</b>, kui ka <b>Lotus&nbsp;Notes </b>meetodit.</p>
<p>Selle
juures on vajalik, et Lotus Notes oleks paigaldatud esialgsest
paigalduspaketist ning peale tema paigaldust poleks paigaldatud teisi
postirakendusi. Juhul, kui kirjade saatmine ei toimi, paigaldage Lotus Notes Teie
arvutis uuesti.</p>
<p>Datex
Recruit Teie postirakendusega koostoime kontrollimiseks valitud meetodiga vajutage
nupp <b>Ette valmistada tests&otilde;numit</b>. Kasutatavas postirakenduses
peab avanema s&otilde;num tekstiga Test.</p>
<p>Ettevalmistamise
meetodit <b>SMTP</b>&nbsp;kaudu saab kasutada postirakenduse puudumisel
t&ouml;&ouml;kohal. Sellisel juhul iga kirja luuakse ning eelnevalt avatakse
vahetult Datex Recruit-s. SMTP kaudu saatmise funktsiooni kasutamine on
v&otilde;imalik ettev&otilde;tte SMTP-serveri &uuml;ldiste seadistuste abil (viide
<b>SMTP &uuml;ldised seadistused</b>&nbsp;kiireks &uuml;leminekuks
seadistustele) v&otilde;i personaalsete seadistuste abil (n&auml;iteks,
kasutades oma tasuta elektroonpostkasti v&auml;ljamineva posti seadistusi ning
registreerimisandmeid). V&auml;ljades <b>Saatja aadress</b>&nbsp;ning<b>&nbsp;Saatja
nimi</b> sisestage vastavalt elektroonposti aadress (millelt tulevikus kirju saadetakse)
ning nimi (&uuml;ldiste SMTP seadistuste kasutamisel saadetakse kirju kasutaja
elektroonposti aadressilt, mitte &uuml;ldiselt korporatiivaadressilt, mis on
m&auml;&auml;ratud posti automaatse saatmise seadistustes). Sisestatud andmete
&otilde;igsuse kontrollimiseks sisestage v&auml;ljas <b>Test E-post </b>oma elektroonposti aadress&nbsp;ning
vajutage nupp<b> Saata tests&otilde;num</b>. Korrektselt sisestatud andmete
korral saabub m&auml;&auml;ratud postiaadressile s&otilde;num tekstiga Test.</p>
<p>&Otilde;ige
seadistuse jaoks v&otilde;ib Teil vaja minna Teie s&uuml;steemadministraatori
abi. Erandjuhtudel saab seadistamist teostada ainult
s&uuml;steemadministraator.</p></body>
</html>
