<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>Kirjade mallid</h1>
<p>Datex
Recruit tarkvara v&otilde;imaldab saata valitud kandidaatidele ning tellijatele
kirju standardsete malli j&auml;rgi. Kirjade saatmiseks mallide j&auml;rgi on
teil v&otilde;imalik kasutada nuppe<b> Esialgne e-kiri </b>ning <b>CV tellija juures</b> valitud
kandidaadi kaardil. Koos tarkvaraga tarnitakse &uuml;le k&uuml;mne standardsete
kirjade malle.</p>
<p>Vajadusel
on Teil v&otilde;imalik Redigeerida olemasolevaid ning lisada uusi malle.
Selleks kasutatakse sektsiooni <b>Administreerimine-&gt;Kataloogid-&gt;Kirjade
mallid</b>.</p>
<ul type="disc">
 <li>Uue
     malli lisamiseks vajutage nupp<b> Uus element</b>.</li>
 <li>Avanenud
     aknas sisestage malli <b>Nimetus</b> (Te
     hakkate seda n&auml;gema nimekirjas malli valikul saatmiseks), m&auml;&auml;rake
     <b>Saaja t&uuml;&uuml;p</b> (mall
     konkreetse kontaktisiku, kandidaadi, kasutaja, fikseeritud adressaadi
     v&otilde;i v&auml;lise kalendri kirje jaoks), teema ning kirja tekst. Juhul,
     kui on valitud saaja t&uuml;&uuml;p -&nbsp;<b>Kasutaja</b>, siis on
     vajalik &uuml;le kontrollida, et saajate seadistustes (sektsioon <b>Administreerimine-</b>&gt;<b>Ligip&auml;&auml;s</b>-&gt;<b>kasutajad</b>)
     on m&auml;&auml;ratud vastav t&ouml;&ouml;taja ning selle
     t&ouml;&ouml;taja kaardil on sisestatud E-posti aadress.</li>
</ul>
<p>Kirja
sisus, analoogselt standardsete mallidega, on Teil v&otilde;imalik kasutada  standardseid arvutatavaid elemente (PNI, vakants,
allkiri), mille kohale asetab tarkvara tegelikke v&auml;&auml;rtusi.</p>
<p>M&auml;rkus:
arvutatavate elementidega s&otilde;numite korrektseks loomiseks on vajalik, et
s&otilde;numi loomise momendil oleksid kaardil sisestatud andmed, mida asetab
&uuml;ks v&otilde;i teine arvutatav element.</p>
<p>Faili
lisamiseks, mille olemasolu on kohustuslik s&otilde;numi loomiseks antud malli
j&auml;rgi, kirje <b>Lisatud statistilised failid </b>vastas vajutage nupp „<b>+“</b>
(Lisada), valige fail ning vajutage nupp<b> Avada</b>.</p>
<p>Faili
lisamiseks kaardi manusest, kirje <b>Lisatud
failid kaardist </b>vastas vajutage nupp „<b>+</b>“ (Lisada),
m&auml;&auml;rake faili nimetus (saab kasutada arvutatavaid elemente), manuse
t&uuml;&uuml;p ning l&auml;hteobjekt, kust m&auml;&auml;ratud t&uuml;&uuml;bi
manust imporditakse. Juhul, kui seda manust ei ole k&otilde;ikidel kaartidel olemas,
paigaldage lipp<b> Mitte lisada fail juhul, kui see puudub kaardil</b>.</p>
<p>V&auml;li
<b>Skript</b> on m&otilde;eldud
stsenaariumi programmeerimiskoodi sisestamiseks, mida t&auml;idetakse malli
kutsumisel lisafunktsioonide realiseerimiseks (arendatakse eraldi).</p>
<p>Juhul,
kui on vajalik, et s&otilde;numi saatmise fakt antud malli j&auml;rgi oleks
fikseeritud, paigaldage lipp <b>Registreerida kirja saatmise fakt s&uuml;ndmuse
kujul</b> ning valige vajalik s&uuml;ndmus.</p>
<p>Lipp&nbsp;<b>Uus
grupp men&uuml;&uuml;s</b> lubab mallide nimekirja avamisel kaardil eraldada
see mall koos selle all olevate mallidega teistelt.</p>
<p>M&auml;&auml;rates
gruppi v&auml;ljas<b> Kasutada ainult kasutajate grupi sees</b>, v&otilde;ib
piirata antud malli k&auml;ttesaadavust sellesse gruppi mittekuuluvate
kasutajate jaoks.</p>
<p>Kuna tarkvara
v&otilde;rguversioonis kasutavad k&otilde;ik kasutajad &uuml;hiseid malle, siis
igale kasutajale on vajalik t&auml;ita oma allkirja malli sektsioonis<b> Servis-&gt;Personaalsed
seadistused</b> (punkt <b>Allkiri</b>).</p></body>
</html>
