<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>Vakantsi kaart</h1>
<p>Vakantsi kaardil Datex Recruit tarkvaras on
allj&auml;rgnev struktuur:</p>
<p>Sektsioon <b>&Uuml;ldised
andmed</b>:</p>
<p><b>Number</b>: vakantsi tabeli number. Vakantsi
k&auml;sitsi sisestamisel antakse s&uuml;steemi poolt automaatselt.</p>
<p><b>Nimetus</b>: Vakantsi nimetus.&nbsp;Juhul,
kui s&uuml;steemi &uuml;ldistes seadistustes (<b>T&ouml;&ouml; vakantsidega</b>) on sisse l&uuml;litatud valik <b>Vakantsi
sidumise puhul ametikohaga sunniviisiliselt&nbsp;anda vakantsile vastava
ametikoha nimetust</b>, &uuml;htib selle v&auml;lja v&auml;&auml;rtus ametikoha
nimetusega, millele vakants kuulub.</p>
<p><b>Struktuur&uuml;ksus</b>&nbsp;(ettev&otilde;tete
personaliteenistuste jaoks): Viide objektile<b> Struktuur&uuml;ksus</b>, millele
kuulub antud vakants. Juhul, kui s&uuml;steemi &uuml;distes seadistustes (<b>Ametistruktuur</b>) on sisse l&uuml;litatud
valik <b>Pidada ametikohtade arvestust</b> antakse sellele v&auml;ljale
automaatselt struktuur&uuml;ksuse nimetust, mille juurde kuulub valitud
ametikoht.</p>
<p><b>Klient </b>(personaliagentuuride jaoks): Viide
objektile <b>Organisatsioon</b>, mille juurde kuulub vakants.</p>
<p><b>Kontaktisikud</b>: Kontaktisikute nimekiri (viited
objektile <b>F&uuml;&uuml;siline isik</b>),
kelle juurde suunatakse kandidaate &uuml;levaatuseks antud vakantsi raames.</p>
<p><b>&Uuml;ksik</b>: Valik lubab l&auml;bi viia
otsingut &quot;&uuml;ks vakants -&nbsp; &uuml;ks inimene &quot;. Kandidaadi
t&ouml;&ouml;lev&otilde;tmisel pakub tarkvara antud vakantsi sulgeda.</p>
<p><b>Mitme inimese jaoks</b>: Valik lubab l&auml;bi viia
mitme inimese otsingut &uuml;hesuguse t&uuml;&uuml;bi positsioonile. Antud valiku
sissel&uuml;litamisel ilmub vakantsi kaardil sektsioon<b> Detailsus </b>ja nupp<b> Lisada vajaliku inimeste arvu</b>
instrumentide ribal. Iga vajamineva inimese jaoks tekitakse n.n. detailne
vakants oma parameetrite kogumiga (avamise kuup&auml;ev, tekkimise
p&otilde;hjus,&nbsp;prioriteet, otsingu t&auml;htaeg, v&auml;rbaja, finaalne
kandidaat), mida s&auml;ilitatakse p&otilde;hivakantsi kaardil. Kandidaadi
t&ouml;&ouml;lev&otilde;tmisel p&otilde;hivakantsi raames sulgeb tarkvara
kronoloogiliselt j&auml;rgmist detailset vakantsi. Kui k&otilde;iki detailseid
vakantse t&auml;idetakse &auml;ra, pakub tarkvara sulgeda ka
p&otilde;hivakantsi.</p>
<p><b>Massiline&nbsp;(vool)</b>: Valik lubab l&auml;bi viia
piiramata arvu inimeste otsingut massilisele vakantsile, mida reeglina kunagi
ei suleta. Antud valik l&uuml;litab vakantsi kaardil detailsust ning
s&uuml;ndmuste statistika arvestust v&auml;lja. Vajadusel on v&otilde;imalik
v&auml;lja l&uuml;litada otsingu l&auml;biviimist sellise t&uuml;&uuml;bi
taotluste j&auml;rgi lipu<b> Lubada massilisi vakantse (vool)</b>&nbsp;mahav&otilde;tmisega
sektsioonis <b>Administreerimine-&gt;&Uuml;ldised seadistused -&gt;T&ouml;&ouml;
vakantsidega.</b></p>
<p><b>Avamise kuup&auml;ev</b>: Vakantsi avamise kuup&auml;ev. Uue
vakantsi loomisel kehtestatakse automaatselt jooksva kuup&auml;eva j&auml;rgi.</p>
<p>Detailse vakantsi puhul (<b>Mitme inimese jaoks)</b>,
v&auml;lja <b>Avamise kuup&auml;ev </b>t&auml;idetakse
automaatselt esimese detailse vakantsi avamise kuup&auml;evaga. Vajadusel saab
seda valikut v&auml;lja l&uuml;litada lipu<b> Lugeda vakantsi mitme inimese jaoks
avamise kuup&auml;evaks esimese avatud detailse vakantsi kuup&auml;eva</b> mahav&otilde;tmisega
sektsioonis<b> Administreerimine-&gt;&Uuml;ldised seadistused -&gt;T&ouml;&ouml;
vakantsidega.</b></p>
<p><b>Tekkimise alus</b>: vakantsi tekkimise alus - vahetus,
uue ameti sisseviimine jms. (v&auml;&auml;rtus kataloogist). Selle kataloogi
sisu v&otilde;ib muuta sektsioonis<b> Administreerimine-&gt;Kataloogid-&gt;Vakantsid-Vakantside
tekkimise alused.</b></p>
<p><b>Otsingu algus:&nbsp;</b>Vakantsi
raames<b> </b>kandidaatide otsingu alguskuup&auml;ev. V&auml;li on k&auml;ttesaadav
sissel&uuml;litatud re&#382;iimi <b>Lugeda vakantsi raames t&ouml;&ouml;
alguskuup&auml;evaks eraldi v&auml;ljal otsingu alguskuup&auml;eva </b>abil
sektsioonis<b> Administreerimine-&gt;&Uuml;ldised seadistused -&gt;T&ouml;&ouml;
vakantsidega</b>.</p>
<p><b>Planeeritud t&auml;htaeg</b>: Maksimaalne otsingu
t&auml;htaeg vakantsi raames. V&otilde;ib olla kehtestatud p&auml;evades, t&ouml;&ouml;p&auml;evades
v&otilde;i kuudes. V&auml;lja muutmise korral kasutaja poolt arvutakse
automaatselt &uuml;mber vakantsi sulgemise planeeritud t&auml;htaja v&auml;lja
v&auml;&auml;rtust –&nbsp;<b>Sulgeda kuni</b>.
Juhul, kui planeeritud t&auml;htaeg on ette antud t&ouml;&ouml;p&auml;evades, planeeritud
kuup&auml;eva m&auml;&auml;ratakse samuti kui l&auml;himat
t&ouml;&ouml;p&auml;eva.</p>
<p>Maksimaalse otsingu t&auml;htaja v&auml;&auml;rtus,
mida kehtestatakse uue vakantsi jaoks vaikimisi v&otilde;ib m&auml;&auml;rata
sektsioonis&nbsp;<b>Administreerimine-&gt;&Uuml;ldised seadistused -&gt;T&ouml;&ouml;
vakantsidega</b>.</p>
<p><b>Korrigeerimine</b>: summaarne p&auml;evade arv, mis
lisatakse planeeritud t&auml;htajale erinevatel p&otilde;hjustel (peatamise
asemel). Korrigeerimise t&auml;htaegade lisamine koos t&uuml;&uuml;piliste
p&otilde;hjuste (n&auml;iteks, on pikendatud juhipoolne vaatlemise aeg, on
pikendatud turvakontrolli t&auml;htaeg, kandidaat ei ole kohale ilmunud jne.) ning
kommentaaride m&auml;rkimise v&otilde;imalusega teostatakse sektsioonis<b> T&auml;htaja
korrigeerimine</b>. Valiku haldamist teostatakse lipu <b>Lubada vakantsi sulgemise t&auml;htaja korrigeerimist </b>abil<b> </b>sektsioonis<b> Administreerimine-&gt;&Uuml;ldised
seadistused -&gt;T&ouml;&ouml; 
vakantsidega</b>.</p>
<p><b>Sulgeda kuni</b>: Kuup&auml;ev, milleni tuleks
vakantsi sulgeda (v&otilde;i peab olema l&otilde;petatud valiku protsess). T&auml;htaja
arvutust teostatakse sulgemise t&auml;htaja korrigeerimise arvestamisega. Selle
v&auml;lja muutmisel kasutaja poolt <b>Planeeritud
aeg </b>t&auml;htaja v&auml;&auml;rtust arvutatakse automaatselt &uuml;mber.</p>
<p><b>Jooksev staatus</b>: Vakantsi jooksev staatus (v&auml;&auml;rtus
kataloogist). Vaikimisi omab uuesti loodud vakants staatust <b>&quot;T&ouml;&ouml;s
&quot;</b>. Datex Recruit integratsiooni puhul korporatiivportaaliga v&otilde;i
personaliarvestuse s&uuml;steemiga, kus otsingu taotlusi v&otilde;ib esitada juht,
laaditud kuid t&ouml;&ouml;sse veel v&otilde;tmata vakants v&otilde;ib omada
staatust <b>&quot;Uus taotlus &quot;</b>. Staatust <b>&quot;Suletud&quot;</b> antakse
reeglina vakantsile automaatselt s&uuml;steemi poolt vakantsi raames vaadeldud
kandidaadi t&ouml;&ouml;lev&otilde;tmisel. Tellijat v&otilde;ib vajadusel
teavitada vakantsi &uuml;leminekust &uuml;hesse v&otilde;i teisse staatusse.
Selleks tuleb sektsioonis<b> Administreerimine-&gt;Kataloogid-&gt;Vakantsid-&gt;Vakantside
staatused</b> n&otilde;utud staatuste jaoks lisada toimingut <b>Saata E-post </b>v&otilde;i <b>Saata SMS </b>malli<b> </b>m&auml;rkimisega,
mille j&auml;rgi luuakse teavitus. E-posti teel teavituste jaoks v&otilde;ib
kasutada kirja standardset malli „Juhi teavitus vakantsi staatuse muutusest“.</p>
<p><b>Valiku etapp</b>: Valiku etapi nimetus (v&auml;&auml;rtus
kataloogist). V&auml;lja t&auml;idetakse aktiivses staatuses olevate vakantside
puhul. V&auml;lja v&auml;&auml;rtust arvutatakse automaatselt v&auml;lja
s&otilde;ltuvalt sellest, mis etapini on j&otilde;udnud &uuml;ks k&auml;esolevale
vakantsile vaadeldavatest kandidaatidest.</p>
<p>Valiku etappide nimekiri:</p>
<p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>Esialgne valik</b>. Esmane staatus.</p>
<p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>Intervjueerimine</b>.
Tingimus: on olemas kasv&otilde;i &uuml;ks kandidaat planeeritud v&otilde;i
toimunud t&ouml;&ouml;vestlusega, kes on antud hetkel j&auml;tkuvalt vaadeldav
vakantsile (aktiivse vakantsi staatusega).</p>
<p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>Intervjueerimine tellija juures</b>. Tingimus:
on olemas kasv&otilde;i &uuml;ks kandidaat, kellel on planeeritud v&otilde;i
toimunud tellijaga ning kes on antud hetkel j&auml;tkuvalt vaadeldav vakantsile
(aktiivse vakantsi staatusega).</p>
<p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>Finalist</b>.
Tingimus: on olemas kasv&otilde;i &uuml;ks kandidaat s&uuml;ndmusega <b>„T&ouml;&ouml;pakkumine“ </b> ning kes on antud hetkel j&auml;tkuvalt
vaadeldav vakantsile (aktiivse vakantsi staatusega).</p>
<p>Juhul, kui mitu etappi vastavad neile
s&auml;testatud tingimustele valitakse j&auml;rjestuses viimast staatust
nimekirjas. Valiku etappide seadistamist teostatakse sektsioonis<b> Administreerimine-&gt;Kataloogid-&gt;Vakantsid-&gt;Vakantsi
valiku etapid.</b></p>
<p><b>Valiku kategooria</b>: Vakantsi valiku kategooria (stsenaarium)
– massiline valik, spetsialistid, k&otilde;rgeim juhtkond (v&auml;&auml;rtus
kataloogist). Sektsioonis <b>Administreerimine-&gt;&Uuml;ldised seadistused -&gt;T&ouml;&ouml;
vakantsidega</b> on v&otilde;imalik m&auml;&auml;rata valikuid, mis
s&auml;testavad massilise valiku v&otilde;imalust iga kategooria jaoks.</p>
<p><b>Keerukuse kategooria</b>: Vakantsi keerukuse kategooria (v&auml;&auml;rtus
kataloogist).</p>
<p><b>Prioriteet</b>: Vakantsi prioriteet (v&auml;&auml;rtus
kataloogist).</p>
<p><b>Palk</b>: Vakantse ametikoha palgatase,
kui seda on ette teada.</p>
<p><b>Palgatase (alates, kuni)</b>: Palga diapasoon, mille raames
teostatakse kandidaatide otsingut.</p>
<p><b>Eriala</b>: Objektide erialane klassifikaator
(v&auml;&auml;rtus kataloogist). Vaikimisi kasutab tarkvara kahetasemelist
erialade kataloogi, mida tarnitakse koos tarkvaraga. Teil on v&otilde;imalik
redigeerida standardset erialade kataloogi sektsioonis<b> Administreerimine-&gt;Kataloogid-&gt;Erialad</b>
v&otilde;i importida selle sisse ettevalmistatud MS Excel formaadi failist.</p>
<p><b>Riik:</b>&nbsp;<a name="_Hlk491777047">tulevase
t&ouml;&ouml;koha riik (v&auml;&auml;rtus kataloogist).</a></p>
<p><b>Regioon</b>: tulevase t&ouml;&ouml;koha
regioon (v&auml;&auml;rtus kataloogist). Kasutakse juhul, kui ettev&otilde;ttel
on olemas tegevus mitmes regioonis korraga.</p>
<p><b>Finaalsed kandidaadid</b>: Nimekiri kandidaatidest, kes on
antud vakantsi raames finalistid. Reeglina, t&auml;idetakse v&auml;lja tarkvara
poolt automaatselt. Kandidaadi staatus, mille saabumisel muutub kandidaat
finalistiks seadistatakse ette sektsioonis<b> Administreerimine-&gt;Kataloogid-&gt;S&uuml;ndmuste
t&uuml;&uuml;bid</b>. Vaikimisi muutub kandidaat finalistiks <b>„T&ouml;&ouml;pakkumine</b>“ staatuse
saabumisel. Viimast finaalset kandidaati t&auml;histatakse nimekirjas plussiga
„+“.</p>
<p><b>Lisaandmed</b>: Suvaline lisainformatsioon. Kasutada
seda v&auml;lja vakantsi kirjelduse salvestamiseks ei soovitata, selleks on olemas
standardne lisa<b> Sisemine kirjeldus.</b></p>
<p><b>Valitud kandidaate</b>,<b>&nbsp;T&ouml;&ouml;vestlus on
toimunud</b> jt.: Statistika v&otilde;tmes&uuml;ndmuste osas (&quot;valiku
lehter &quot;), kuvatud diagrammide kujul. Lubab visuaalselt hinnata
t&ouml;&ouml;etappi vakantsi osas ning valiku efektiivsust. &Uuml;hte
v&otilde;i teiste s&uuml;ndmuste arvestite olemasolu erinevate
l&otilde;petamise omaduste jaoks m&auml;&auml;ratakse lipuga <b>Pidada antud
t&uuml;&uuml;pi s&uuml;ndmuste arvestit vakantsi osas </b>vastava s&uuml;ndmuse<b> </b>staatuse seadistustes
 (sektsioon&nbsp;<b>Administreerimine-</b>&gt;<b>Kataloogid</b>-&gt;<b>&Uuml;ldised</b>-&gt;<b>S&uuml;ndmuste t&uuml;&uuml;bid</b>).</p>
<p>&nbsp;</p>
<p><b>Vasakpoolne paneel</b>:</p>
<p><b>Initsiaator</b>: Isik, kes on vakantsi
initsiaatoriks (tellijaks). Kasutatakse tavaliselt juhul, kui vakantsi osas on
olemas mitu kontaktisikut konkreetse k&auml;esoleva taotluse esitanud isiku m&auml;&auml;ramiseks.</p>
<p><b>K&uuml;lmutatud</b>: P&auml;evade arv, mille jooksul
oli vakants staatuses <b>„Peatatud“</b>. Tarkvara
t&auml;idab antud v&auml;lja automaatselt vakantsi staatuse edaspidisel
muutmisel staatuseks <b>„T&ouml;&ouml;s“</b>.
Juhul, kui sektsioonis <b>Administreerimine-&gt;&Uuml;ldised seadistused -&gt;T&ouml;&ouml;
vakantsidega</b>&nbsp;on m&auml;rgitud valik vakantsi otsingu
t&auml;htaeg t&ouml;&ouml;p&auml;evades, siis  on-hold p&auml;evade arvu kuvatakse nii
kalendri-, kui ka t&ouml;&ouml;p&auml;evades. Juhul, kui ennem suletud vakantsi
raames oli otsustatud otsingut taasalustada, siis peale vakantsi staatuse
muutmist <b>„T&ouml;&ouml;s“</b> peale on on-hold
p&auml;evade arvu andmete uuendamiseks vajalik kasutada k&auml;sku<b> Servis-&gt;&Uuml;mber
arvestada on-hold p&auml;evi muutuste ajaloos</b>.</p>
<p><b>T&ouml;&ouml;s</b>: P&auml;evade arv, mille jooksul
on vakants t&ouml;&ouml;s. Peale vakantsi sulgemist (valiku protsess on
l&otilde;ppenud), v&auml;lja nimetus muutub <b>Fakt. t&auml;htaeg </b>vastu&nbsp;ning sisaldab p&auml;evade
arvu vakantsi avamisest kuni sulgemise p&auml;evani (valiku l&otilde;petamise
kuup&auml;eva). Juhul, kui vakants on endiselt t&ouml;&ouml;s, sisaldab
v&auml;li p&auml;evade arvu avamise p&auml;evast kuni jooksva kuup&auml;evani.&nbsp;M&otilde;lemal
juhul on-hold p&auml;evade arvu sisse ei arvestata.</p>
<p><b>V&auml;rbaja/Grupp</b>: Vakantsi eest vastutav Datex
Recruit kasutaja ning vastav grupp. Vakantsi m&auml;&auml;ramisel teisele
kasutajale saab viimane selle kohta teavitust alasektsioonis&nbsp;<b>S&uuml;ndmused-&gt;Teavitused</b>.</p>
<p><b>Piiratud ligip&auml;&auml;s</b>: selle lipuga sisse l&uuml;litatav
valik&nbsp;laseb muuta antud vakantsi „eksklusiivseks“, s.t. n&auml;htavaks
piiratud kasutajate arvule:&nbsp;vakantsi omanikule, kasutajatele, kes on
m&auml;rgitud v&auml;ljas <b>Lubada
ligip&auml;&auml;s kasutajatele</b> alasektsioonis<b> Lisaandmed </b>ning kasutajatele, kellel on
k&otilde;rgendatud ligip&auml;&auml;su tase (<b>valik T&auml;ielik ligip&auml;&auml;s</b>&nbsp;v&otilde;i&nbsp;<b>Lubatud piiratud ligip&auml;&auml;suga
objektide vaatlemine </b>ligip&auml;&auml;su taseme seadistustes).</p>
<p>&nbsp;</p>
<p>Sektsioon&nbsp;<b>Lisaandmed</b>:</p>
<p><b>V&auml;line ID</b>: Juhul, kui vakants oli
&uuml;les laaditud korporatiivportaalilt v&otilde;i v&auml;lisest
personaliarvestuse s&uuml;steemist, sisaldab antud v&auml;li vastava objekti
identifikaatori v&auml;lises s&uuml;steemis.</p>
<p><b>Konfidentsiaalne vakants</b>: Selle lipuga sisse
l&uuml;litatav valik lubab keelata k&otilde;igile kasutajatele
ligip&auml;&auml;su sektsioonile, mis sisaldab andmeid vakantsi
avalikustamiseks („Interneti kuulutused“).</p>
<p><b>Lisaavaldamine teise vakantsi juurde</b>: Lipp m&auml;rgistav, et
vakantsi kaarti kasutatakse ainult kui alternatiivset avaldamist teisele
(algsele) vakantsile ilma eraldiseisva otsinguta. Antud juhul andmebaasi
sisestatud vastus muutub esmasele vakantsile valitud kandidaadiks, mitte sellele
millele ta reageerinud on.</p>
<p><b>Vakantsiga t&ouml;&ouml;tavad agentuurid</b> (re&#382;iimis &quot;Ettev&otilde;tte
personaliteenistus &quot;): Agentuuride nimekiri (viited objektile <b>Organisatsioon</b>), kellega tehakse
koost&ouml;&ouml;d antud vakantsi raames.</p>
<p><b>Valiku allikas</b>: Finaalse kandidaadi laekumise
allikas (v&auml;&auml;rtus kataloogist). V&auml;li t&auml;idetakse tarkvara
poolt automaatselt.</p>
<p>&nbsp;</p>
<p>Sektsioon&nbsp;<b>N&otilde;udmised
kandidaadile</b>: Sektsioon sisaldab v&auml;ljade loetelu, mis
m&auml;&auml;ravad n&otilde;udmisi potentsiaalsetele kandidaatidele vakantsile
(haridus, t&ouml;&ouml;kogemus, vanus, sugu). Lisaks, v&auml;ljas <b>Testide kogum </b>v&otilde;ib m&auml;&auml;rata vajalikku kogumit (valitakse
seadistatavast kataloogist), mis sisaldab testide nimekirja, mida kandidaadid
peaksid t&auml;itma testimise etapil. Testide kogumite kataloogi
t&auml;idetakse kasutaja poolt sektsioonis&nbsp;<b>Administreerimine-&gt;Kataloogid-&gt;Integratsioon-&gt;Testide
kogumid</b>.</p>
<p>Sektsioon <b>Detailsus</b>:
Sektsioon sisaldab detailsete vakantside nimekirja (sisse l&uuml;litatud valiku
<b>Mitme inimese jaoks </b>puhul).</p>
<p>Sektsioon <b>Muudatuste
ajalugu</b>: Sektsioon sisaldab vakantsi staatuse muudatuste ajaloos&uuml;ndmuste
nimekirja, kui sellised eksisteerivad. Ajalugu t&auml;idetakse automaatselt
vakantsi staatuse muutmisel.</p>
<p>Sektsioon <b>Interneti
kuulutus</b>: Sektsioon sisaldab andmeid vakantsi avalikustamisest interneti veebilehtedel,
Datex Recruit Internetimooduli kasutamise puhul. T&auml;iendatavat infot selle
kohta saab lugeda sekstioonis <a href="vacancy_publish.htm">Vakantsi
avalikustamine Internetis</a>.</p>
<p>Sektsioon <b>T&auml;htaja
korrigeerimine</b>: Sektsioon sisaldab vakantsi sulgemise t&auml;htaja
korrigeerimiste loetelu. T&auml;htaegade korrigeerimise lisamine koos
t&uuml;&uuml;piliste p&otilde;hjuste ning kommentaaride lisamise
v&otilde;imalusega toimub nupu <b>Lisada </b>abil.</p>
<p>Sektsioon <b>Kandidaadid
t&ouml;&ouml;s</b>: Sektsioon sisaldab antud vakantsile valitud kandidaatide
nimekirja. Nimekirja kohal tekkivad automaatselt statistilised n&auml;itajad, mis
peegeldavad selle positsiooni valiku jooksvat progressi. Vasakus osas kuvatakse
&uuml;ldiseid n&auml;itajaid – antud vakantsile valitud kandidaatide
&uuml;ldist arvu, paljud neist on antud hetkel vaatluses, palju oli tagasi
l&uuml;katud v&otilde;i reservi arvatud. Paremas osas kuvatakse n&auml;itajaid,
mis peegeldavad igal valiku etapil olevate kandidaatide arvu (igas staatuses). Detailide
saamiks iga n&auml;itaja osas on piisavalt sellel hiirega kl&otilde;psata.</p>
<p>Sektsioon <b>Kandidaatide
s&uuml;ndmused</b>: Sisaldab antud vakantsile valitud (vaadeldavate)
kandidaatidega seotud s&uuml;ndmuste nimekirja.</p>
<p>Sektsioon <b>Lisad</b>:
Sektsioon sisaldab suvalisi manuseid vakantsi kaardile, seal hulgas standardset
lisa <b>&quot;Sisemine kirjeldus &quot;</b>.</p></body>
</html>
