<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>Vakantsi avalikustamine Internetis</h1>
<p>Juhul, kui Te avalikustate
vakantsi Datex Recruit kaudu esmakordselt, avage sektsioon <b>Personaalsed seadistused
-&gt;Kontod</b>, avage vaheldumisi veebilehtede kaardid, kus kavatsete vakantse
avalikustada ning sisestage oma kasutajanimed ja salas&otilde;nad nende veebilehtede
jaoks, kus on olemas kohustuslik registreerimine. Selleks peate olema
registreeritud igal sellisel veebilehel. P&ouml;&ouml;rake samuti
t&auml;helepanu sellele, et iga veebilehe teenuste maksumust
m&auml;&auml;ratakse iga veebilehe poolt eraldi ning see ei s&otilde;ltu
sellest, kas kasutate vakantsi avalikustamiseks rakendust v&otilde;i sisestage
vakantsi k&auml;sitsi brauseri kaudu.</p>
<p>·&nbsp; Avage Internetis
avalikustamiseks mineva vakantsi kaart.</p>
<p>·&nbsp; Sektsioonis <b>&Uuml;ldised andmed</b> v&auml;ljas <b>Eriala&nbsp;</b>valige<b> </b>vajadusel kutseala ning
eriala valitud kutseala sees (juhul, kui Te ei valinud selle eelnevalt).</p>
<p>·&nbsp; Minge sektsiooni&nbsp;<b>Interneti
kuulutus</b>. Vastavaid erialasid (rubriike) t&auml;idetakse iga veebilehe
jaoks automaatselt (juhul, kui leitakse adekvaatset vastavust). Juhul, kui
vastavust ei leita v&otilde;i see ei sobi Teile, on Teil v&otilde;imalik
m&auml;&auml;rata teist eriala (rubriiki) iga veebilehe jaoks. On v&otilde;imalik
koheselt ka mitme rubriigi valik avalikustamiseks (nende lehtede jaoks, mis
toetavad sellist funktsiooni), hoides klahvi <b>Ctrl</b>.</p>
<p>·&nbsp; T&auml;itke vajalikud
v&auml;ljad &auml;ra vahelehtedel&nbsp;<b>&Uuml;ldine</b>,&nbsp;<b>Kirjeldus</b>,&nbsp;<b>Detailne
kirjeldus</b>&nbsp;(ainult cvkeskus.ee jaoks),&nbsp;<b>Kontaktid</b>. Juhul,
kui detailset kirjeldust t&auml;idetakse esimesena, t&auml;idetakse vahelehe
t&auml;iskirjelduse v&auml;lja <b>Kirjeldus </b>automaatselt &auml;ra. Kontaktinformatsioon<b>
(</b>v&auml;ljad&nbsp;<b>Kontaktisik</b>,&nbsp;<b>Telefon</b>,&nbsp;<b>E-post</b>,&nbsp;<b>Organisatsioon</b>)
s&auml;ilib peale sisestamist ning edaspidi tuuakse seda &uuml;le ka iga
j&auml;rgneva vakantsi kaardile.</p>
<p>Avalikustamine on v&otilde;imalik
nii &uuml;hes, kui ka mitmes regioonis &uuml;heaegselt, m&auml;&auml;rates neid
v&auml;ljas <b>Regioon</b>. Mitu regiooni
korraga valitakse nimekirjas klahvide <b>Shift</b>&nbsp;v&otilde;i&nbsp;<b>Ctrl</b>
kasutamisega.</p>
<p>Vakantsi anon&uuml;&uuml;mse
avalikustamise jaoks (ilma ettev&otilde;tte nimetamiseta ning ettev&otilde;tte
kodulehek&uuml;ljele viitamiseta) (cvkeskus.ee, cv.ee) on vajalik paigutada
lippu<b> Anon&uuml;&uuml;mne vakants</b> ning vahelehel <b>Kontaktid</b>&nbsp;sisestada
organisatsiooni &uuml;ldist kirjeldust.</p>
<p>Juhul, kui veebilehel on
registreeritud mitu organisatsiooni, siis v&auml;ljas <b>Ettev&otilde;te</b>&nbsp;valige
vajaminev. Ettev&otilde;tete nimekiri peab olema eelnevalt imporditud Datex
Recruit tarkvara sektsioonis<b> Administreerimine-&gt;Kataloogid-&gt;Integratsioon-&gt;Ettev&otilde;tted
avalikustamiseks</b>.</p>
<p>Nende veebilehtede jaoks, mis
toetavad oma korporatiivdisaini m&auml;&auml;ramise v&otilde;imalust saab avalikustamisel
vahelehel <b>&Uuml;ldine </b>v&auml;ljas <b>Korporatiivdisain</b> valida vajalikku
varianti. Disainide variantide valikut luuakse sektsioonis<b> Administreerimine-&gt;Kataloogid-&gt;Integratsioon-&gt;Korporatiivdisainid
avalikustamiseks.</b></p>
<p>·&nbsp; Vakantsi avalikustamiseks
vormi t&auml;itmise l&otilde;petamisel paigutage lipud veebilehtede juurde, kus
Te soovite antud vakantsi avalikustada ning vajutage nupp <b>Avalikustamine-&gt;Avalikustada
Internetis</b>.</p>
<p>·&nbsp; K&auml;ivitub vakantsi
avalikustamise protsess.</p>
<p>S&otilde;ltuvalt v&otilde;rgu kiirusest
ning iga veebilehe h&otilde;ivatusest v&otilde;ib avalikustamine v&otilde;tta 2-st
kuni 15 sekundini. Vajaduse korral on Teil v&otilde;imalik vaadata iga serveri
vastust vajutades viitele&nbsp;<b>Lisateave</b>.</p>
<p><a name="0.1_position_publish_info"></a>Juhul, kui vakants oli juba varem avalikustatud,
siis nupu<b> Avalikustada Internetis </b>vajutamisel kontrollib tarkvara &uuml;le millisel veebilehel oleks
vajalik kuulutust uuendada (l&auml;htudes eelneva avalikustamise
kuup&auml;evast ning veebilehe poliitikast) ning teostab selle uuendamist.</p>
<p>Sektsiooni <b>Interneti kuulutus </b>t&auml;itmine on v&otilde;imalik mitte
ainult k&auml;sitsi, vaid samuti ka automaatselt eelnevalt ettevalmistatud
kuulutuse malli alusel valides selle vakantsi kaardil alasektsioonis<b> Lisaandmed</b>.
Luua selliseid malle on v&otilde;imalik sektsioonis<b> Administreerimine-&gt;Kataloogid-&gt;Vakantsid-&gt;Vakantside
mallid</b>.</p>
<p>Vakantsi &uuml;leviimisel
mitteaktiivsesse staatusse pakub s&uuml;steem eemaldada veebilehtedelt
sisestatud vakantside kuulutusi.</p><br/>
<br/>
<p><a href="view_publications.htm">Avalikustatud vakantside informatsiooni ülevaatus Internetis</a></p>
</body>
</html>
