<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=utf-8"/>
<title></title>
<style>
<!--
*
{
	font-family: Calibri,Arial,sans-serif;
	font-size: 12pt;
	__margin: 2px;
}


p, li
{
	__margin: 0px;
}

-->
</style>
</head>
<body>
<h1>Tarkvara sektsioonidega töö üldised printsiibid</h1>
<p>Erineva t&uuml;&uuml;bi kaartidele
ligip&auml;&auml;su jaoks kasutatakse tarkvara peaakna vasakus osas asuvat
sektsioonide puud. K&otilde;ik puus loetletud tarkvara sektsioonid on &uuml;les
ehitatud &uuml;hise printsiibi j&auml;rgi. Vajadusel v&otilde;ib igat tarkvara
sektsioonidest avada eraldi aknas (<b>Ctrl+N</b>&nbsp;klaviatuuril v&otilde;i
k&auml;suga men&uuml;&uuml;s<b> Vaade-&gt;Avada sektsioon uues aknas</b>). Alajaotusi
sisaldavaid sektsioone v&otilde;ib kokku v&otilde;tta. Tarkvara j&auml;tab
meelde iga sektsiooni seisukorda, seega j&auml;rgneval avamisel kuvatakse neid ennem
valitud formaadis.</p>
<p>Ekraani paremas osas kuvatakse valitud sektsioonile
vastavat objektide loetelu (&uuml;ksused, vakantsid, kandidaadid jne.).</p>
<ul type="disc">
 <li>Andmete
     valimiseks nimekirjast erinevate kriteeriumide j&auml;rgi tuleks ette anda
     filtrite vajaliku v&auml;&auml;rtuste komplekti ekraani &uuml;lemises osas
     nimekirja kohal. Filtri elementide kogumi sisaldava v&auml;&auml;rtuse selekteerimisel,
     teostatakse valik koheselt peale v&auml;&auml;rtuse valimist. Teksti sisestamisega
     filtri kasutamisel tuleks filtri rakendamiseks vajutada nuppu <b>Leida </b>v&otilde;i olles<b> </b>tekstiv&auml;ljal vajutada klahvi
     <b>Enter</b>.</li>
</ul>
<p>D&uuml;naamiliste filtrite komplekti jooksva
sektsiooni jaoks v&otilde;ib muuta peamen&uuml;&uuml; k&auml;suga <b>Vaade–&gt; Filtrid</b>. Kontekstmen&uuml;&uuml; sektsiooni <b>Kasutatavad filtrid </b>k&auml;skude <b>Liigutada
&uuml;lesse/ Liigutada alla </b>abil, on Teil v&otilde;imalik muuta filtrite
asukohta.</p>
<p>Vaikimisi toimub filtrite valiku muutmine vaid
konkreetse t&ouml;&ouml;koha jaoks (re&#382;iim <b>Seadistada vaid minu jaoks</b>). Tsentraliseeritud muudatuste
tegemiseks peab administraator valima re&#382;iimi <b>Seadistada k&otilde;ikide kasutajate jaoks</b>.</p>
<p>Kataloogile viidavates lisatud filtrites (n&auml;iteks,
<b>Regioon</b>, <b>Eriala</b> ) v&otilde;ib koheselt valida mitu v&auml;&auml;rtust,
valides neid vaheldumisi hoides klahvi <b>Ctrl</b>. Seda on mugav teha
elementide valiku aknas, mis ilmub k&auml;sul <b>Valida nimekirjast </b>(hiire
parema nupu vajutamisega filtril).</p>
<p>·&nbsp; Eraldiseisva d&uuml;naamilise filtri
t&uuml;histamiseks on vajalik vajutada hiire parema nupuga sellele filtrile
ning valida k&auml;sku <b>Puhastada
v&auml;li</b>. K&otilde;ikide filtrite t&uuml;histamiseks tuleb vajutada hiire
parema nupuga vabasse tsoonialasse filtrite &uuml;mber ning valida <b>Puhastada vorm</b>.</p>
<p>Veergude komplekti ning nende j&auml;rjestust
jooksva sektsiooni jaoks v&otilde;ib muuta peamen&uuml;&uuml; k&auml;su abil <b>Vaade
–&gt; Veerud&nbsp;</b>analoogselt<b> </b>d&uuml;naamiliste
filtrite vahetamisele.</p>
<p>·&nbsp; Objektide sorteerimise j&auml;rjestuse
muutmiseks klikkige hiirega veeru p&auml;isse, mille j&auml;rgi peab sorteerimine
olema teostatud.</p>
<p>·&nbsp; Sorteerimise j&auml;rjestuse tagasi
muutmiseks klikkige veeru p&auml;isse hiirega uuesti.</p>
<p>·&nbsp; Objekti kaardi avamiseks klikkige hiirega topelt
vastavale loetelu reale.</p>
<p>·&nbsp; Objekti kaardi eemaldamiseks valige
vastavat loetelu rida ning seej&auml;rel vajutage klahv<b> Delete</b>.</p>
<p>Samuti saab objekti avamiseks ja kustutamiseks
kasutada kontekstmen&uuml;&uuml;d, mis ilmub hiire parema nupu vajutamisel
loetelu real.</p>
<p>&nbsp;</p>
<p>Loetelu kohal on kuvatud v&auml;ljade valik, mille j&auml;rgi
saab filtreerida objekte nimekirjas. Esimesena tuleb alati <b>Tekstiotsing</b>, mis lubab m&auml;&auml;rata kaardi sees olevat v&otilde;tmes&otilde;na
(v&otilde;i s&otilde;na fragmenti). T&auml;iendava informatsiooni saamiseks vt.
sektsiooni <a href="ft_search.htm"><b>Otsing v&otilde;tmes&otilde;nade
j&auml;rgi</b></a>.</p>
<p>&nbsp;</p></body>
</html>
